#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Motorcycle

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "ChaosVehicles_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Motorcycle.ABP_Motorcycle_C
// 0x14A0 (0x2080 - 0x0BE0)
class UABP_Motorcycle_C final : public UAppVehicleAnimationInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0BE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0BE8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0BF0(0x0008)()
	struct FAnimNode_MeshSpaceRefPose             AnimGraphNode_MeshRefPose;                         // 0x0BF8(0x0010)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_4;                          // 0x0C08(0x00F0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0CF8(0x0128)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_3;                          // 0x0E20(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_2;                          // 0x0F10(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_1;                          // 0x1000(0x00F0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x10F0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x1218(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x1340(0x0128)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone;                            // 0x1468(0x00F0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1558(0x0128)()
	struct FAnimNode_WheelController              AnimGraphNode_WheelController;                     // 0x1680(0x00E0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1760(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1888(0x0020)()
	uint8                                         Pad_18A8[0x8];                                     // 0x18A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt_1;                            // 0x18B0(0x0250)()
	struct FAnimNode_LookAt                       AnimGraphNode_LookAt;                              // 0x1B00(0x0250)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1D50(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1E78(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1E98(0x0128)()
	class ABP_Motorcycle_C*                       Motercycle;                                        // 0x1FC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DeltaSec;                                          // 0x1FC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDrifting;                                        // 0x1FD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAxelTurn;                                        // 0x1FD1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FD2[0x6];                                     // 0x1FD2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AxelTurnRearWheelRotationAngle;                    // 0x1FD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AxelTurnRearWheelRotationSpeed;                    // 0x1FE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DriftBodyAngle;                                    // 0x1FE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FEC[0x4];                                     // 0x1FEC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        LeanAngle;                                         // 0x1FF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               SteeringHandleRotation;                            // 0x1FF8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               SteeringWheelRotation;                             // 0x2010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        SteeringHandleLimitStartAngle;                     // 0x2028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               FrontWheelRotation;                                // 0x2030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                AllBodyTranslation;                                // 0x2048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                BodyOnlyTranslation;                               // 0x2060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Motorcycle_AnimGraphNode_ModifyBone_2E2D16F64422858B2AFDD381B9E229FD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Motorcycle_AnimGraphNode_ModifyBone_3B44E8024A83D508ED18169FF20727AD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Motorcycle_AnimGraphNode_ModifyBone_69DBFB864D3F108F1697C693A145C45E();
	void ExecuteUbergraph_ABP_Motorcycle(int32 EntryPoint);
	void GetDriftTargetBodyAngle(float* TargetAngle);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Motorcycle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Motorcycle_C")
	}
	static class UABP_Motorcycle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Motorcycle_C>();
	}
};
DUMPER7_ASSERTS_UABP_Motorcycle_C;

}

