#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Cinematics_HumanBone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ABP_Cinematics_HumanBone_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ControlRig_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Cinematics_HumanBone.ABP_Cinematics_HumanBone_C
// 0xD650 (0xE860 - 0x1210)
class UABP_Cinematics_HumanBone_C final : public UCinematicCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1210(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Cinematics_HumanBone::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;     // 0x1218(0x0078)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1290(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1298(0x0008)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_2;                   // 0x12A0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_105;                   // 0x12E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_104;                   // 0x1310(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_13;                // 0x1338(0x0040)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_33;                   // 0x1378(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_103;                   // 0x13F8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_32;                   // 0x1420(0x0080)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_4;               // 0x14A0(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_102;                   // 0x14D8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_31;                   // 0x1500(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_101;                   // 0x1580(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_12;                // 0x15A8(0x0040)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_31;                             // 0x15E8(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_20;                      // 0x1630(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_30;                             // 0x16F8(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_19;                      // 0x1740(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_30;                   // 0x1808(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_29;                   // 0x1888(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_100;                   // 0x1908(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x1930(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_99;                    // 0x19F8(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x1A20(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_98;                    // 0x1AE8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_97;                    // 0x1B10(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_96;                    // 0x1B38(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_95;                    // 0x1B60(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_29;                 // 0x1B88(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_94;                    // 0x1C78(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_28;                 // 0x1CA0(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_93;                    // 0x1D90(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_27;                 // 0x1DB8(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_26;                 // 0x1EA8(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_29;                             // 0x1F98(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_25;                 // 0x1FE0(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_92;                    // 0x20D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_91;                    // 0x20F8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_28;                             // 0x2120(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_24;                 // 0x2168(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_23;                 // 0x2258(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_22;                 // 0x2348(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_21;                 // 0x2438(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_90;                    // 0x2528(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_18;                      // 0x2550(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_28;                   // 0x2618(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_27;                             // 0x2698(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_17;                      // 0x26E0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_27;                   // 0x27A8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_89;                    // 0x2828(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_88;                    // 0x2850(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_26;                             // 0x2878(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_16;                      // 0x28C0(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_25;                             // 0x2988(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_15;                      // 0x29D0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_26;                   // 0x2A98(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25;                   // 0x2B18(0x0080)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_3;            // 0x2B98(0x00D0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_2;            // 0x2C68(0x00D0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0x2D38(0x00D0)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x2E08(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_87;                    // 0x2ED8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_86;                    // 0x2F00(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_85;                    // 0x2F28(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_84;                    // 0x2F50(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_83;                    // 0x2F78(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_82;                    // 0x2FA0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_81;                    // 0x2FC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_80;                    // 0x2FF0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0x3018(0x0080)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_11;                // 0x3098(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_10;                // 0x30D8(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_9;                 // 0x3118(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_79;                    // 0x3158(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_78;                    // 0x3180(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_77;                    // 0x31A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_76;                    // 0x31D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_75;                    // 0x31F8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_24;                             // 0x3220(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_23;                             // 0x3268(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_22;                             // 0x32B0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_21;                             // 0x32F8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_20;                             // 0x3340(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_14;                      // 0x3388(0x00C8)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_3;               // 0x3450(0x0038)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0x3488(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_74;                    // 0x3508(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_73;                    // 0x3530(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_72;                    // 0x3558(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_71;                    // 0x3580(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_70;                    // 0x35A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_69;                    // 0x35D0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_68;                    // 0x35F8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_13;                      // 0x3620(0x00C8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_8;                        // 0x36E8(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_3;                        // 0x3BB8(0x0168)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;             // 0x3D20(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;             // 0x3D40(0x0020)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_2;                        // 0x3D60(0x0168)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_67;                    // 0x3EC8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_12;                      // 0x3EF0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_66;                    // 0x3FB8(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_7;                        // 0x3FE0(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_6;                        // 0x44B0(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_20;                 // 0x4980(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x4A70(0x0020)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_8;                 // 0x4A90(0x0040)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x4AD0(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0x4B88(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_65;                    // 0x4C08(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_7;                 // 0x4C30(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_6;                 // 0x4C70(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5;                 // 0x4CB0(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x4CF0(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_64;                    // 0x4D30(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_63;                    // 0x4D58(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_62;                    // 0x4D80(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_1;                   // 0x4DA8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_61;                    // 0x4DF0(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x4E18(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_60;                    // 0x4ED0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_19;                 // 0x4EF8(0x00F0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_14;                       // 0x4FE8(0x0128)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x5110(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x5130(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_18;                 // 0x5150(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_17;                 // 0x5240(0x00F0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x5330(0x0040)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_59;                    // 0x5370(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_16;                 // 0x5398(0x00F0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x5488(0x0040)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_15;                 // 0x54C8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_58;                    // 0x55B8(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_5;                        // 0x55E0(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone_1;                        // 0x5AB0(0x0168)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x5C18(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x5C38(0x0020)()
	struct FAnimNode_SpringBone                   AnimGraphNode_SpringBone;                          // 0x5C58(0x0168)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x5DC0(0x0040)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_14;                 // 0x5E00(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x5EF0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x5F10(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x5F30(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0x5FE8(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x6068(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x6088(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x61B0(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x61D0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x62F8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x6420(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x6548(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x6670(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x6798(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x68C0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x69E8(0x0128)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x6B10(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_57;                    // 0x6B58(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0x6B80(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_19;                             // 0x6BA8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_18;                             // 0x6BF0(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_17;                             // 0x6C38(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_16;                             // 0x6C80(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_15;                             // 0x6CC8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_14;                             // 0x6D10(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0x6D58(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0x6D80(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0x6DA8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0x6DD0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0x6DF8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0x6E20(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_11;                      // 0x6E48(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0x6F10(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_13;                 // 0x6F38(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0x7028(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x7050(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_13;                             // 0x7070(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0x70B8(0x0080)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_4;                        // 0x7138(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_3;                        // 0x7608(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_12;                 // 0x7AD8(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_12;                             // 0x7BC8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_11;                             // 0x7C10(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x7C58(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_19;                   // 0x7CA0(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_11;                 // 0x7D20(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0x7E10(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_10;                 // 0x7E38(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_18;                   // 0x7F28(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0x7FA8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_9;                  // 0x7FD0(0x00F0)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_2;               // 0x80C0(0x0038)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8;                  // 0x80F8(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_17;                   // 0x81E8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0x8268(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x8290(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x8358(0x00C8)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_1;               // 0x8420(0x0038)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0x8458(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_16;                   // 0x8548(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0x85C8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x85F0(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x86E0(0x00F0)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive;                 // 0x87D0(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0x8808(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0x8830(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0x8858(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x88D8(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x89C8(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x8AB8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_41;                    // 0x8B38(0x0028)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_6;                         // 0x8B60(0x0280)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_5;                         // 0x8DE0(0x0280)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x9060(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x9080(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_2;                        // 0x90A0(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x9570(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x95B8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_40;                    // 0x9638(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_39;                    // 0x9660(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_38;                    // 0x9688(0x0028)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x96B0(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x9B80(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0x9BA8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x9BD0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x9C18(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0x9C98(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0x9CC0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0x9CE8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0x9D10(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x9D38(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x9D80(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0x9E00(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x9E28(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x9E70(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x9EF0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x9F18(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x9F40(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x9F68(0x00B8)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_4;                         // 0xA020(0x0280)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0xA2A0(0x0020)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_3;                         // 0xA2C0(0x0280)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0xA540(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0xA568(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0xA620(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0xA640(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0xA6F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0xA718(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0xA7D0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0xA7F0(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0xA818(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0xA8D0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0xA8F0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0xA918(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0xA960(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0xA9E0(0x0020)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0xAA00(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0xAAF0(0x0028)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0xAB18(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0xAB38(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0xAB60(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0xAB88(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0xABD0(0x00F0)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_1;                      // 0xACC0(0x0010)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose;                        // 0xACD0(0x0010)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_6;                   // 0xACE0(0x00C8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0xADA8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0xAED0(0x0128)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0xAFF8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0xB020(0x0080)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_10;                      // 0xB0A0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0xB168(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0xB1E8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0xB210(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_5;                   // 0xB238(0x00C8)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_2;                         // 0xB300(0x0280)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_1;                         // 0xB580(0x0280)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0xB800(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_9;                       // 0xB820(0x00C8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xB8E8(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0xB908(0x0080)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0xB988(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0xBA50(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0xBB18(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0xBB40(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0xBBC0(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0xBCB0(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0xBCD8(0x0128)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0xBE00(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0xBE48(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0xBE70(0x00C8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0xBF38(0x0128)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0xC060(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0xC088(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0xC108(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0xC130(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0xC178(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0xC1F8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_8;                       // 0xC220(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0xC2E8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_7;                       // 0xC310(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0xC3D8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_6;                       // 0xC400(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0xC4C8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_5;                       // 0xC4F0(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0xC5B8(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_4;                       // 0xC680(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0xC748(0x00C8)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0xC810(0x0040)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0xC850(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0xC918(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0xC998(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0xC9C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0xC9E8(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_3;                       // 0xCA10(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0xCAD8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0xCB58(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0xCB80(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0xCBA8(0x0128)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0xCCD0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0xCCF8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0xCD78(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_2;                       // 0xCDA0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0xCE68(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0xCE90(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0xCED8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0xCF00(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0xCF48(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0xD010(0x0028)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0xD038(0x00C8)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK;                           // 0xD100(0x0280)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0xD380(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0xD850(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_1;                       // 0xD870(0x0120)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0xD990(0x0120)()
	class APawn*                                  K2Node_PropertyAccess_2;                           // 0xDAB0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DAB8[0x8];                                     // 0xDAB8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             __CustomProperty_L_A24EA7284B464F4BAD98759567DA5B7B; // 0xDAC0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCinematicWeaponTypeOffsetParams       __CustomProperty_Weapon_Offset_B8D999E94CF9F2B1E82654A07F9AE3B8; // 0xDB20(0x0360)(NoDestructor)
	EWeaponCategory                               __CustomProperty_Weapon_Category_B8D999E94CF9F2B1E82654A07F9AE3B8; // 0xDE80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE81[0x7];                                     // 0xDE81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Aim_EyeTargetBlend_BB2EFB3A43670D9DC3DD258EE6161AA6; // 0xDE88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Eye_Weight_BB2EFB3A43670D9DC3DD258EE6161AA6; // 0xDE90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE98[0x8];                                     // 0xDE98(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             __CustomProperty_Aim_SecondTargetTansformWS_BB2EFB3A43670D9DC3DD258EE6161AA6; // 0xDEA0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bAim_SecondTarget_Eye_BB2EFB3A43670D9DC3DD258EE6161AA6; // 0xDF00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DF01[0x7];                                     // 0xDF01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Aim_Blendtime_BB2EFB3A43670D9DC3DD258EE6161AA6; // 0xDF08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bAim_Eye_BB2EFB3A43670D9DC3DD258EE6161AA6; // 0xDF10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DF11[0x7];                                     // 0xDF11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Aim_EyeRatio_BB2EFB3A43670D9DC3DD258EE6161AA6; // 0xDF18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             __CustomProperty_Aim_TargetTansformWS_BB2EFB3A43670D9DC3DD258EE6161AA6; // 0xDF20(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Aim_BustTargetBlend_CDC19BCD488325D0CD6BDC8BE778B9EE; // 0xDF80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Aim_FaceTargetBlend_CDC19BCD488325D0CD6BDC8BE778B9EE; // 0xDF88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Bust_Weight_CDC19BCD488325D0CD6BDC8BE778B9EE; // 0xDF90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Face_Weight_CDC19BCD488325D0CD6BDC8BE778B9EE; // 0xDF98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             __CustomProperty_Aim_SecondTargetTansform_NoEyeDirtWS_CDC19BCD488325D0CD6BDC8BE778B9EE; // 0xDFA0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bAim_SecondTarget_Bust_CDC19BCD488325D0CD6BDC8BE778B9EE; // 0xE000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bAim_SecondTarget_Face_CDC19BCD488325D0CD6BDC8BE778B9EE; // 0xE001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E002[0x6];                                     // 0xE002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Aim_Blendtime_CDC19BCD488325D0CD6BDC8BE778B9EE; // 0xE008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bAim_Bust_CDC19BCD488325D0CD6BDC8BE778B9EE; // 0xE010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E011[0x7];                                     // 0xE011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Aim_BustRatio_CDC19BCD488325D0CD6BDC8BE778B9EE; // 0xE018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bAim_Face_CDC19BCD488325D0CD6BDC8BE778B9EE; // 0xE020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E021[0x7];                                     // 0xE021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Aim_FaceRatio_CDC19BCD488325D0CD6BDC8BE778B9EE; // 0xE028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_Aim_FaceRollOffset_CDC19BCD488325D0CD6BDC8BE778B9EE; // 0xE030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E048[0x8];                                     // 0xE048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             __CustomProperty_Aim_TargetTansform_NoEyeDirtWS_CDC19BCD488325D0CD6BDC8BE778B9EE; // 0xE050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             AimTargetTransformWS;                              // 0xE0B0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             AimSecondTargetTransformWS;                        // 0xE110(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             AimTargetTransform;                                // 0xE170(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             R_Hand_IK_TargetTransform;                         // 0xE1D0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             L_Hand_IK_TargetTransform;                         // 0xE230(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Hand_IK_Weight_R;                                  // 0xE290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Hand_IK_Weight_L;                                  // 0xE298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Anim_CurveWeight;                              // 0xE2A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2A1[0x7];                                     // 0xE2A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Speed;                                             // 0xE2A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PrevLocation;                                      // 0xE2B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2C8[0x8];                                     // 0xE2C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             AimSecondTargetTransform;                          // 0xE2D0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UBP_Cine_WeaponBlend_C>  DA_WeaponAnimList;                                 // 0xE330(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Graat_Sword;                                       // 0xE358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Bayonet;                                           // 0xE360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Halberd;                                           // 0xE368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Hammer;                                            // 0xE370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Rune_Blade;                                        // 0xE378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      No_Weapon;                                         // 0xE380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Dual_Sword;                                        // 0xE388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Player;                                         // 0xE390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Female_Editor;                                  // 0xE391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Height_Offset_Receive_Actor_;                   // 0xE392(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E393[0x5];                                     // 0xE393(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FemaleOffset;                                      // 0xE398(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          UseFemaleMotion;                                   // 0xE3B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          UseWeaponFullBodyBlend;                            // 0xE3B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          UseWeaponUpperBodyBlend;                           // 0xE3B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3B3[0x5];                                     // 0xE3B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        WeaponUpperBodyBlend;                              // 0xE3B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLSwordReady;                                    // 0xE3C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          UseRuneBladeReady;                                 // 0xE3C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E3C2[0x6];                                     // 0xE3C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Byonet_UpperBody_Blend_IK_Alpha;                   // 0xE3C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        Halbard_UpperBody_Blend_IK_Alpha;                  // 0xE3D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        PC_Height_Normalize_Value;                         // 0xE3D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LookAt_Sweep_Blend;                                // 0xE3E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        LookAt_Sweep_Min;                                  // 0xE3E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        LookAt_Sweep_Max;                                  // 0xE3F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        LookAt_Sweep_Pose_Value;                           // 0xE3F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseHeadOffset;                                     // 0xE400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E401[0x7];                                     // 0xE401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Head_Rotation_Min;                                 // 0xE408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	double                                        Head_Rotation_Max;                                 // 0xE410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSweep;                                          // 0xE418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_Head_Rotation;                              // 0xE419(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_Height_OffsetBlend;                         // 0xE41A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E41B[0x5];                                     // 0xE41B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Female_LHandAttach_Sword;                          // 0xE420(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Female_LHandAttach_Bayonet;                        // 0xE480(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Female_LHandAttach_Halberd;                        // 0xE4E0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Female_LHandAttach_Hammer;                         // 0xE540(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Female_LHandAttach_TSword;                         // 0xE5A0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Female_LHandAttach_RuneBlade;                      // 0xE600(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Female_LHandAttach_UPV;                            // 0xE660(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	bool                                          UseFemaleLHandAttach;                              // 0xE678(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E679[0x7];                                     // 0xE679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
