#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABPL_ActionHuman_MountRiderPitch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABPL_ActionHuman_MountRiderPitch.ABPL_ActionHuman_MountRiderPitch_C
// 0x02C0 (0x0930 - 0x0670)
class UABPL_ActionHuman_MountRiderPitch_C final : public UMountRiderPitchAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0678(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0680(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0688(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x06A8(0x00B8)()
	struct FAppAnimNode_PitchUpperBody            AppAnimGraphNode_PitchUpperBody;                   // 0x0760(0x0170)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x08D0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x08F0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0910(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABPL_ActionHuman_MountRiderPitch(int32 EntryPoint);
	void MountRiderPitch(const struct FPoseLink& InPose_MountRiderPitch, struct FPoseLink* MountRiderPitch_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABPL_ActionHuman_MountRiderPitch_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABPL_ActionHuman_MountRiderPitch_C")
	}
	static class UABPL_ActionHuman_MountRiderPitch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABPL_ActionHuman_MountRiderPitch_C>();
	}
};
DUMPER7_ASSERTS_UABPL_ActionHuman_MountRiderPitch_C;

}

