#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABPL_Player_LookAt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK::Params
{

// Function ABPL_Player_LookAt.ABPL_Player_LookAt_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABPL_Player_LookAt_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABPL_Player_LookAt_C_AnimGraph;

// Function ABPL_Player_LookAt.ABPL_Player_LookAt_C.ExecuteUbergraph_ABPL_Player_LookAt
// 0x0F30 (0x0F30 - 0x0000)
struct ABPL_Player_LookAt_C_ExecuteUbergraph_ABPL_Player_LookAt final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue;       // 0x0010(0x00D0)(ConstParm, NoDestructor)
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_1;     // 0x00E0(0x00D0)(ConstParm, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_2;     // 0x01C0(0x00D0)(ConstParm, NoDestructor)
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_3;     // 0x0290(0x00D0)(ConstParm, NoDestructor)
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_4;     // 0x0360(0x00D0)(ConstParm, NoDestructor)
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_5;     // 0x0430(0x00D0)(ConstParm, NoDestructor)
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_6;     // 0x0500(0x00D0)(ConstParm, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_2;                      // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_2;                     // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_2;                       // 0x05E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E8[0x8];                                      // 0x05E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_7;     // 0x05F0(0x00D0)(ConstParm, NoDestructor)
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_8;     // 0x06C0(0x00D0)(ConstParm, NoDestructor)
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_9;     // 0x0790(0x00D0)(ConstParm, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_3;                      // 0x0860(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_3;                     // 0x0864(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_3;                       // 0x0868(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86C[0x4];                                      // 0x086C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_10;    // 0x0870(0x00D0)(ConstParm, NoDestructor)
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_11;    // 0x0940(0x00D0)(ConstParm, NoDestructor)
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_12;    // 0x0A10(0x00D0)(ConstParm, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0AE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AE1[0x7];                                      // 0x0AE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_BoolToDouble_ReturnValue;            // 0x0AE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_13;    // 0x0AF0(0x00D0)(ConstParm, NoDestructor)
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_14;    // 0x0BC0(0x00D0)(ConstParm, NoDestructor)
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_15;    // 0x0C90(0x00D0)(ConstParm, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_4;                      // 0x0D60(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_4;                     // 0x0D64(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_4;                       // 0x0D68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D6C[0x4];                                      // 0x0D6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_16;    // 0x0D70(0x00D0)(ConstParm, NoDestructor)
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue_17;    // 0x0E40(0x00D0)(ConstParm, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue_1;      // 0x0F10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0F11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F12[0x6];                                      // 0x0F12(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet___CustomProperty_Eye_Weight_999A16204161F968505DBE993A244086_ImplicitCast; // 0x0F18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_StructMemberSet_Alpha_ImplicitCast;         // 0x0F20(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABPL_Player_LookAt_C_ExecuteUbergraph_ABPL_Player_LookAt;

// Function ABPL_Player_LookAt.ABPL_Player_LookAt_C.Eyes
// 0x0020 (0x0020 - 0x0000)
struct ABPL_Player_LookAt_C_Eyes final
{
public:
	struct FPoseLink                              InPose_Eyes;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Eyes_0;                                            // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABPL_Player_LookAt_C_Eyes;

// Function ABPL_Player_LookAt.ABPL_Player_LookAt_C.LookAt
// 0x0020 (0x0020 - 0x0000)
struct ABPL_Player_LookAt_C_LookAt final
{
public:
	struct FPoseLink                              InPose_LookAt;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LookAt_0;                                          // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABPL_Player_LookAt_C_LookAt;

// Function ABPL_Player_LookAt.ABPL_Player_LookAt_C.OnUpdate_AimOffset
// 0x0130 (0x0130 - 0x0000)
struct ABPL_Player_LookAt_C_OnUpdate_AimOffset final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue;       // 0x0020(0x00D0)(ConstParm, NoDestructor)
	struct FBlendSpacePlayerReference             CallFunc_ConvertToBlendSpacePlayerPure_BlendSpacePlayer; // 0x00F0(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToBlendSpacePlayerPure_Result;     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            CallFunc_GetBlendSpace_ReturnValue;                // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlendSpacePlayerReference             CallFunc_SetBlendSpaceWithInertialBlending_ReturnValue; // 0x0118(0x0010)(NoDestructor)
};
DUMPER7_ASSERTS_ABPL_Player_LookAt_C_OnUpdate_AimOffset;

// Function ABPL_Player_LookAt.ABPL_Player_LookAt_C.OnUpdate_LocalAdditiveBS
// 0x0130 (0x0130 - 0x0000)
struct ABPL_Player_LookAt_C_OnUpdate_LocalAdditiveBS final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	struct FAnimLookAtParameter                   CallFunc_GetLookAtAnimParameter_ReturnValue;       // 0x0020(0x00D0)(ConstParm, NoDestructor)
	struct FBlendSpacePlayerReference             CallFunc_ConvertToBlendSpacePlayerPure_BlendSpacePlayer; // 0x00F0(0x0010)(NoDestructor)
	bool                                          CallFunc_ConvertToBlendSpacePlayerPure_Result;     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            CallFunc_GetBlendSpace_ReturnValue;                // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlendSpacePlayerReference             CallFunc_SetBlendSpaceWithInertialBlending_ReturnValue; // 0x0118(0x0010)(NoDestructor)
};
DUMPER7_ASSERTS_ABPL_Player_LookAt_C_OnUpdate_LocalAdditiveBS;

// Function ABPL_Player_LookAt.ABPL_Player_LookAt_C.GetMainABP
// 0x0018 (0x0018 - 0x0000)
struct ABPL_Player_LookAt_C_GetMainABP final
{
public:
	class UABP_ActionHuman_C*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UABP_ActionHuman_C*                     K2Node_DynamicCast_AsABP_Action_Human;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABPL_Player_LookAt_C_GetMainABP;

}

