#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABPL_Cinematics_ShoeSole

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABPL_Cinematics_ShoeSole.ABPL_Cinematics_ShoeSole_C
// 0x05F0 (0x0C30 - 0x0640)
class UABPL_Cinematics_ShoeSole_C final : public UPermanentShoeSoleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0640(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0648(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0650(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0658(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0678(0x00B8)()
	struct FAppAnimNode_ShoeSole                  AppAnimGraphNode_ShoeSole;                         // 0x0730(0x0330)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0A60(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0A80(0x0020)()
	struct FAppAnimNode_FABRIK                    AppAnimGraphNode_FABRIK;                           // 0x0AA0(0x0170)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0C10(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABPL_Cinematics_ShoeSole(int32 EntryPoint);
	void ShoeSole(const struct FPoseLink& InPose_ShoeSole, struct FPoseLink* ShoeSole_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABPL_Cinematics_ShoeSole_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABPL_Cinematics_ShoeSole_C")
	}
	static class UABPL_Cinematics_ShoeSole_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABPL_Cinematics_ShoeSole_C>();
	}
};
DUMPER7_ASSERTS_UABPL_Cinematics_ShoeSole_C;

}

