#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABPL_Player_LookAt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ABPL_Player_LookAt_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABPL_Player_LookAt.ABPL_Player_LookAt_C
// 0x1AD0 (0x22F0 - 0x0820)
class UABPL_Player_LookAt_C final : public UActionHumanLookAtAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0820(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABPL_Player_LookAt::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;           // 0x0828(0x0040)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0868(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0870(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0878(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0898(0x00B8)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_4;          // 0x0950(0x0118)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_3;          // 0x0A68(0x0118)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x0B80(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0BC8(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_2;          // 0x0C10(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0D28(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x0DA8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x0DD0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x0DF8(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0E20(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x0E90(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x0F80(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x0FA8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x1098(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x10C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x10E8(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_1;          // 0x1110(0x0118)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1228(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1270(0x0028)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x1298(0x0118)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x13B0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x13F8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x14E8(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1510(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x15D8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x16C8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x16F0(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1738(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1758(0x00B8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig_1;                        // 0x1810(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x1CE0(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x21B0(0x0020)()
	struct FRotator                               __CustomProperty_Eye_Rotate_DA2192794364E38E2BD6C3863934F6A4; // 0x21D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        __CustomProperty_Aim_EyeTargetBlend_999A16204161F968505DBE993A244086; // 0x21E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        __CustomProperty_Eye_Weight_999A16204161F968505DBE993A244086; // 0x21F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bAim_Blend_IntegrateDeltaTime_999A16204161F968505DBE993A244086; // 0x21F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21F9[0x7];                                     // 0x21F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             __CustomProperty_Aim_SecondTargetTansformWS_999A16204161F968505DBE993A244086; // 0x2200(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bAim_SecondTarget_Eye_999A16204161F968505DBE993A244086; // 0x2260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2261[0x7];                                     // 0x2261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Aim_Blendtime_999A16204161F968505DBE993A244086; // 0x2268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_bAim_Eye_999A16204161F968505DBE993A244086; // 0x2270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2271[0x7];                                     // 0x2271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        __CustomProperty_Aim_EyeRatio_999A16204161F968505DBE993A244086; // 0x2278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             __CustomProperty_Aim_TargetTansformWS_999A16204161F968505DBE993A244086; // 0x2280(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          K2Node_PropertyAccess;                             // 0x22E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABPL_Player_LookAt_AnimGraphNode_ApplyAdditive_82D9178A49DD168EF7F2668897B7277C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABPL_Player_LookAt_AnimGraphNode_BlendListByBool_306526C44B0C81FF884957919F2BDA52();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABPL_Player_LookAt_AnimGraphNode_BlendListByBool_4CD417C54AA051A502AF4AB3733AEC24();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABPL_Player_LookAt_AnimGraphNode_BlendListByBool_9F0570344CDDF8F3E8A366A7F033EE2C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABPL_Player_LookAt_AnimGraphNode_BlendListByBool_F17465C44E319DC26F895F8BC2006636();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABPL_Player_LookAt_AnimGraphNode_BlendListByEnum_38312A7540E6A8A34F9149B9969FA0A7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABPL_Player_LookAt_AnimGraphNode_BlendSpacePlayer_5F3DC37143DB07AAD0C7FE9EA6C44D34();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABPL_Player_LookAt_AnimGraphNode_ControlRig_999A16204161F968505DBE993A244086();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABPL_Player_LookAt_AnimGraphNode_ControlRig_DA2192794364E38E2BD6C3863934F6A4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABPL_Player_LookAt_AnimGraphNode_LayeredBoneBlend_3565EF314FA5E7736400C98141D59354();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABPL_Player_LookAt_AnimGraphNode_RotationOffsetBlendSpace_532407B14902473FD35E34BF633E5043();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABPL_Player_LookAt_AnimGraphNode_RotationOffsetBlendSpace_62F6D4344805B4E270B206A28C28B175();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABPL_Player_LookAt_AnimGraphNode_RotationOffsetBlendSpace_A082403B47881C0A923136BAC39474C9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABPL_Player_LookAt_AnimGraphNode_RotationOffsetBlendSpace_BE315DFD4D826FE94717DA80ABF76A1C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABPL_Player_LookAt_AnimGraphNode_RotationOffsetBlendSpace_D937B4094DA5D24DAB0E74881B14E47C();
	void ExecuteUbergraph_ABPL_Player_LookAt(int32 EntryPoint);
	void Eyes(const struct FPoseLink& InPose_Eyes, struct FPoseLink* Eyes_0);
	void LookAt(const struct FPoseLink& InPose_LookAt, struct FPoseLink* LookAt_0);
	void OnUpdate_AimOffset(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void OnUpdate_LocalAdditiveBS(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);

	class UABP_ActionHuman_C* GetMainABP() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABPL_Player_LookAt_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABPL_Player_LookAt_C")
	}
	static class UABPL_Player_LookAt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABPL_Player_LookAt_C>();
	}
};
DUMPER7_ASSERTS_UABPL_Player_LookAt_C;

}

