#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABPL_Player_ShoeSole

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABPL_Player_ShoeSole.ABPL_Player_ShoeSole_C
// 0x05F0 (0x0C90 - 0x06A0)
class UABPL_Player_ShoeSole_C final : public UPlayerShoeSoleAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x06A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06A8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06B0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x06B8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x06D8(0x00B8)()
	struct FAppAnimNode_ShoeSole                  AppAnimGraphNode_ShoeSole;                         // 0x0790(0x0330)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0AC0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0AE0(0x0020)()
	struct FAppAnimNode_FABRIK                    AppAnimGraphNode_FABRIK;                           // 0x0B00(0x0170)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0C70(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_ABPL_Player_ShoeSole(int32 EntryPoint);
	void ShoeSole(const struct FPoseLink& InPose_ShoeSole, struct FPoseLink* ShoeSole_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABPL_Player_ShoeSole_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABPL_Player_ShoeSole_C")
	}
	static class UABPL_Player_ShoeSole_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABPL_Player_ShoeSole_C>();
	}
};
DUMPER7_ASSERTS_UABPL_Player_ShoeSole_C;

}

