#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABPL_Cinematics_SkeletalControl

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABPL_Cinematics_SkeletalControl.ABPL_Cinematics_SkeletalControl_C.AnimBlueprintGeneratedConstantData
// 0x02EF (0x02F0 - 0x0001)
struct ABPL_Cinematics_SkeletalControl::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_31;                                 // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_32;                                 // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_33;                               // 0x0018(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_34;                                 // 0x0038(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_35;                                 // 0x0040(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0048(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00C8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                         // 0x00E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedInputPose;                // 0x0110(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0140(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_FootOnFloor;                 // 0x0170(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_TwoBoneIK_2;                 // 0x01A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x01D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_SlopeWarping;                // 0x0200(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_TwoBoneIK_1;                 // 0x0230(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_PelvisDumping;               // 0x0260(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_TwoBoneIK;                   // 0x0290(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x02C0(0x0030)()
};
DUMPER7_ASSERTS_ABPL_Cinematics_SkeletalControl__FAnimBlueprintGeneratedConstantData;

}

