#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABPL_ActionHuman_SkeletalControl

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABPL_ActionHuman_SkeletalControl.ABPL_ActionHuman_SkeletalControl_C
// 0x3E80 (0x41F0 - 0x0370)
class UABPL_ActionHuman_SkeletalControl_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAppAnimNode_AlongFloor                AppAnimGraphNode_AlongFloor;                       // 0x0388(0x01E8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_10;            // 0x0570(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9;             // 0x0590(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x05B0(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x0630(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x06B0(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x0730(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x0750(0x0080)()
	struct FAppAnimNode_GestureIK                 AppAnimGraphNode_GestureIK;                        // 0x07D0(0x01C8)()
	uint8                                         Pad_998[0x8];                                      // 0x0998(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAppAnimNode_OutsideWall               AppAnimGraphNode_OutsideWall;                      // 0x09A0(0x0320)()
	struct FAppAnimNode_Ladder                    AppAnimGraphNode_Ladder;                           // 0x0CC0(0x0258)()
	struct FAppAnimNode_PelvisDumping             AppAnimGraphNode_PelvisDumping;                    // 0x0F18(0x0450)()
	struct FAppAnimNode_FABRIK                    AppAnimGraphNode_FABRIK_1;                         // 0x1368(0x0170)()
	struct FAppAnimNode_FootLocking               AppAnimGraphNode_FootLocking;                      // 0x14D8(0x01C8)()
	struct FAppAnimNode_WeaponHand                AppAnimGraphNode_WeaponHand;                       // 0x16A0(0x01F8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x1898(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x1918(0x0020)()
	struct FAppAnimNode_TwoBoneIK                 AppAnimGraphNode_TwoBoneIK_9;                      // 0x1938(0x0170)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x1AA8(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x1B28(0x0020)()
	struct FAppAnimNode_Flinch                    AppAnimGraphNode_Flinch;                           // 0x1B48(0x0158)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8;             // 0x1CA0(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x1CC0(0x0080)()
	struct FAppAnimNode_FootOnFloor               AppAnimGraphNode_FootOnFloor;                      // 0x1D40(0x0290)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x1FD0(0x0080)()
	struct FAppAnimNode_TwoBoneIK                 AppAnimGraphNode_TwoBoneIK_8;                      // 0x2050(0x0170)()
	struct FAppAnimNode_Chair                     AppAnimGraphNode_Chair;                            // 0x21C0(0x01E8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x23A8(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x2428(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x24A8(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x24D0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;             // 0x24F0(0x0020)()
	struct FAppAnimNode_FABRIK                    AppAnimGraphNode_FABRIK;                           // 0x2510(0x0170)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x2680(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x26A0(0x0080)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x2720(0x0020)()
	struct FAppAnimNode_TwoBoneIK                 AppAnimGraphNode_TwoBoneIK_7;                      // 0x2740(0x0170)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x28B0(0x0020)()
	struct FAppAnimNode_TwoBoneIK                 AppAnimGraphNode_TwoBoneIK_6;                      // 0x28D0(0x0170)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x2A40(0x0020)()
	struct FAppAnimNode_TwoBoneIK                 AppAnimGraphNode_TwoBoneIK_5;                      // 0x2A60(0x0170)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x2BD0(0x0020)()
	struct FAppAnimNode_TwoBoneIK                 AppAnimGraphNode_TwoBoneIK_4;                      // 0x2BF0(0x0170)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x2D60(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x2D80(0x0020)()
	struct FAppAnimNode_TwoBoneIK                 AppAnimGraphNode_TwoBoneIK_3;                      // 0x2DA0(0x0170)()
	struct FAppAnimNode_SlopeCapsuleAdjust        AppAnimGraphNode_SlopeCapsuleAdjust;               // 0x2F10(0x02E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x31F0(0x0080)()
	struct FAppAnimNode_SlopeWarping              AppAnimGraphNode_SlopeWarping;                     // 0x3270(0x01F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x3460(0x0080)()
	struct FAppAnimNode_TwoBoneIK                 AppAnimGraphNode_TwoBoneIK_2;                      // 0x34E0(0x0170)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x3650(0x0080)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x36D0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x3788(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x37A8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x3860(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x3880(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x3938(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x3958(0x00B8)()
	struct FAppAnimNode_TwoBoneIK                 AppAnimGraphNode_TwoBoneIK_1;                      // 0x3A10(0x0170)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x3B80(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x3C48(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x3D10(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x3DD8(0x0020)()
	struct FAppAnimNode_TwoBoneIK                 AppAnimGraphNode_TwoBoneIK;                        // 0x3DF8(0x0170)()
	struct FAppAnimNode_InteractionIK             AppAnimGraphNode_InteractionIK;                    // 0x3F68(0x0258)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x41C0(0x0020)()
	class UAnimInstance*                          K2Node_PropertyAccess;                             // 0x41E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void ActionHumanSkeletalControl(const struct FPoseLink& InPose_ActionHumanSkeletalControl, struct FPoseLink* ActionHumanSkeletalControl_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AttackPitch(const struct FPoseLink& InPose_AttackPitch, struct FPoseLink* AttackPitch_0);
	void ExecuteUbergraph_ABPL_ActionHuman_SkeletalControl(int32 EntryPoint);
	void MountRiderPitch(const struct FPoseLink& InPose_MountRiderPitch, struct FPoseLink* MountRiderPitch_0);
	void ShoeSole(const struct FPoseLink& InPose_ShoeSole, struct FPoseLink* ShoeSole_0);

	class UActionAnimInstance* GetActionAnimInstance() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABPL_ActionHuman_SkeletalControl_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABPL_ActionHuman_SkeletalControl_C")
	}
	static class UABPL_ActionHuman_SkeletalControl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABPL_ActionHuman_SkeletalControl_C>();
	}
};
DUMPER7_ASSERTS_UABPL_ActionHuman_SkeletalControl_C;

}

