#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABPL_Player_Lean

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Extensions_classes.hpp"
#include "ABPL_Player_Lean_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABPL_Player_Lean.ABPL_Player_Lean_C
// 0x0320 (0x1B50 - 0x1830)
class UABPL_Player_Lean_C final : public UActionHumanAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1830(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABPL_Player_Lean::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;             // 0x1838(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x1840(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x1848(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1850(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1870(0x00B8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x1928(0x0070)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1998(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1A60(0x0020)()
	class UAnimInstance*                          K2Node_PropertyAccess_2;                           // 0x1A80(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_1;                           // 0x1A88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A89[0x7];                                     // 0x1A89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  K2Node_PropertyAccess;                             // 0x1A90(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LeanMulti;                                         // 0x1AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LeanLR;                                            // 0x1AB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaTime;                                         // 0x1ABC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRuntimeFloatCurve                     LeanCurve;                                         // 0x1AC0(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCurveFloat*                            NewVar;                                            // 0x1B48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABPL_Player_Lean(int32 EntryPoint);
	class UABP_ActionHuman_C* GetMainABP();
	void Lean(const struct FPoseLink& InPose_Lean, struct FPoseLink* Lean_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABPL_Player_Lean_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABPL_Player_Lean_C")
	}
	static class UABPL_Player_Lean_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABPL_Player_Lean_C>();
	}
};
DUMPER7_ASSERTS_UABPL_Player_Lean_C;

}

