#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABPL_ActionHuman_SkeletalControl

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// ScriptStruct ABPL_ActionHuman_SkeletalControl.ABPL_ActionHuman_SkeletalControl_C.AnimBlueprintGeneratedConstantData
// 0x0CDF (0x0CE0 - 0x0001)
struct ABPL_ActionHuman_SkeletalControl::FAnimBlueprintGeneratedConstantData final : public FAnimBlueprintConstantData
{
public:
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   __NameProperty_203;                                // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_204;                                // 0x000C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_205;                                // 0x0014(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_206;                                // 0x001C(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNodeFunctionRef                   __StructProperty_207;                              // 0x0028(0x0020)(BlueprintVisible, NoDestructor)
	class FName                                   __NameProperty_208;                                // 0x0048(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   __NameProperty_209;                                // 0x0050(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimSubsystem_PropertyAccess          AnimBlueprintExtension_PropertyAccess;             // 0x0058(0x0080)()
	struct FAnimSubsystem_Base                    AnimBlueprintExtension_Base;                       // 0x00D8(0x0018)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_AlongFloor;                  // 0x00F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_10;       // 0x0120(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_9;        // 0x0150(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_13;              // 0x0180(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_12;              // 0x01B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_11;              // 0x01E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_3;        // 0x0210(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_10;              // 0x0240(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_GestureIK;                   // 0x0270(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_OutsideWall;                 // 0x02A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_Ladder;                      // 0x02D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_PelvisDumping;               // 0x0300(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_FABRIK_1;                    // 0x0330(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_FootLocking;                 // 0x0360(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_WeaponHand;                  // 0x0390(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_9;               // 0x03C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_2;        // 0x03F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_TwoBoneIK_9;                 // 0x0420(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_8;               // 0x0450(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace_1;        // 0x0480(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_Flinch;                      // 0x04B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_8;        // 0x04E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_7;               // 0x0510(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_FootOnFloor;                 // 0x0540(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_6;               // 0x0570(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_TwoBoneIK_8;                 // 0x05A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_Chair;                       // 0x05D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_5;               // 0x0600(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_4;               // 0x0630(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_UseCachedPose;                  // 0x0660(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LocalToComponentSpace;          // 0x0690(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_7;        // 0x06C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_FABRIK;                      // 0x06F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_6;        // 0x0720(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_3;               // 0x0750(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_5;        // 0x0780(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_TwoBoneIK_7;                 // 0x07B0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_4;        // 0x07E0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_TwoBoneIK_6;                 // 0x0810(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_3;        // 0x0840(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_TwoBoneIK_5;                 // 0x0870(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_2;        // 0x08A0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_TwoBoneIK_4;                 // 0x08D0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace_1;        // 0x0900(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_ComponentToLocalSpace;          // 0x0930(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_TwoBoneIK_3;                 // 0x0960(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_SlopeCapsuleAdjust;          // 0x0990(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_2;               // 0x09C0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_SlopeWarping;                // 0x09F0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose_1;               // 0x0A20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_TwoBoneIK_2;                 // 0x0A50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_SaveCachedPose;                 // 0x0A80(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_3;                   // 0x0AB0(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_4;                         // 0x0AB8(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_2;                   // 0x0AE8(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_3;                         // 0x0AF0(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose_1;                   // 0x0B20(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_2;                         // 0x0B28(0x0030)()
	struct FAnimNodeExposedValueHandler           AnimGraphNode_LinkedInputPose;                     // 0x0B58(0x0008)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_TwoBoneIK_1;                 // 0x0B60(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_2;              // 0x0B90(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer_1;              // 0x0BC0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_LinkedAnimLayer;                // 0x0BF0(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root_1;                         // 0x0C20(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_TwoBoneIK;                   // 0x0C50(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AppAnimGraphNode_InteractionIK;               // 0x0C80(0x0030)()
	struct FAnimNodeExposedValueHandler_PropertyAccess AnimGraphNode_Root;                           // 0x0CB0(0x0030)()
};
DUMPER7_ASSERTS_ABPL_ActionHuman_SkeletalControl__FAnimBlueprintGeneratedConstantData;

}

