#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIFramework

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum AIFramework.EAIFwBTParamType
// NumValues: 0x0006
enum class EAIFwBTParamType : uint8
{
	Bool                                     = 0,
	Int                                      = 1,
	Float                                    = 2,
	String                                   = 3,
	Unknown                                  = 255,
	EAIFwBTParamType_MAX                     = 256,
};

// Enum AIFramework.EAIFwFocusPriority
// NumValues: 0x0003
enum class EAIFwFocusPriority : uint8
{
	Default                                  = 0,
	Gameplay                                 = 1,
	EAIFwFocusPriority_MAX                   = 2,
};

// Enum AIFramework.EAIFwBTStatus
// NumValues: 0x0005
enum class EAIFwBTStatus : uint8
{
	Invalid                                  = 0,
	Success                                  = 1,
	Failure                                  = 2,
	Running                                  = 3,
	EAIFwBTStatus_MAX                        = 4,
};

// Enum AIFramework.EAIFwPTRunMode
// NumValues: 0x0004
enum class EAIFwPTRunMode : uint8
{
	Best                                     = 0,
	Random                                   = 1,
	All                                      = 2,
	EAIFwPTRunMode_MAX                       = 3,
};

// Enum AIFramework.EPTCriterionSlot
// NumValues: 0x0005
enum class EPTCriterionSlot : uint8
{
	Slot1                                    = 0,
	Slot2                                    = 1,
	Slot3                                    = 2,
	Slot4                                    = 3,
	EPTCriterionSlot_MAX                     = 4,
};

// Enum AIFramework.EPTEvalOperation
// NumValues: 0x0004
enum class EPTEvalOperation : uint8
{
	Constant                                 = 0,
	Linear                                   = 1,
	InverseLinear                            = 2,
	EPTEvalOperation_MAX                     = 3,
};

// Enum AIFramework.EPTEvalScoreType
// NumValues: 0x0003
enum class EPTEvalScoreType : uint8
{
	Min                                      = 0,
	Max                                      = 1,
	Average                                  = 2,
};

// Enum AIFramework.EAIFwPTEvalPathfindingMode
// NumValues: 0x0004
enum class EAIFwPTEvalPathfindingMode : uint8
{
	Exist                                    = 0,
	Cost                                     = 1,
	Length                                   = 2,
	EAIFwPTEvalPathfindingMode_MAX           = 3,
};

// ScriptStruct AIFramework.AIFwBlackboard
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FAIFwBlackboard final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIFwBlackboard;

// ScriptStruct AIFramework.AIFwBTArgument
// 0x0040 (0x0040 - 0x0000)
struct FAIFwBTArgument final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAIFwBTParamType                              Type;                                              // 0x0010(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bUseValue : 1;                                     // 0x0014(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseBBKey : 1;                                     // 0x0014(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         BoolValue : 1;                                     // 0x0014(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IntValue;                                          // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StringValue;                                       // 0x0020(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BlackboardKey;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIFwBTArgument;

// ScriptStruct AIFramework.AIFwParameterizedBTRequest
// 0x0018 (0x0018 - 0x0000)
struct FAIFwParameterizedBTRequest final
{
public:
	class UAIFwBehaviorTree*                      Template;                                          // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAIFwBTArgument>                Arguments;                                         // 0x0008(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIFwParameterizedBTRequest;

// ScriptStruct AIFramework.AIFwBTNodeProperty
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FAIFwBTNodeProperty
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIFwBTNodeProperty;

// ScriptStruct AIFramework.AIFwBTNodePropertyBool
// 0x0008 (0x0018 - 0x0010)
struct FAIFwBTNodePropertyBool final : public FAIFwBTNodeProperty
{
public:
	bool                                          DefaultValue;                                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIFwBTNodePropertyBool;

// ScriptStruct AIFramework.AIFwBTNodePropertyInt
// 0x0008 (0x0018 - 0x0010)
struct FAIFwBTNodePropertyInt final : public FAIFwBTNodeProperty
{
public:
	int32                                         DefaultValue;                                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIFwBTNodePropertyInt;

// ScriptStruct AIFramework.AIFwBTNodePropertyFloat
// 0x0008 (0x0018 - 0x0010)
struct FAIFwBTNodePropertyFloat final : public FAIFwBTNodeProperty
{
public:
	float                                         DefaultValue;                                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIFwBTNodePropertyFloat;

// ScriptStruct AIFramework.AIFwBTNodePropertyString
// 0x0010 (0x0020 - 0x0010)
struct FAIFwBTNodePropertyString final : public FAIFwBTNodeProperty
{
public:
	class FString                                 DefaultValue;                                      // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIFwBTNodePropertyString;

// ScriptStruct AIFramework.AIFwBTNodePropertyEnumBase
// 0x0000 (0x0010 - 0x0010)
struct FAIFwBTNodePropertyEnumBase final : public FAIFwBTNodeProperty
{
};
DUMPER7_ASSERTS_FAIFwBTNodePropertyEnumBase;

// ScriptStruct AIFramework.AIFwClothoidCurve
// 0x000C (0x000C - 0x0000)
struct FAIFwClothoidCurve final
{
public:
	float                                         InitialDirection;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InitialCurvature;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurvatureChangeRate;                               // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIFwClothoidCurve;

// ScriptStruct AIFramework.AIFwClothoidSegment
// 0x0020 (0x0020 - 0x0000)
struct FAIFwClothoidSegment final
{
public:
	struct FVector2D                              StartPosition;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIFwClothoidCurve                     Curve;                                             // 0x0010(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIFwClothoidSegment;

// ScriptStruct AIFramework.AIFwMultipleClothoidSegment
// 0x0040 (0x0040 - 0x0000)
struct FAIFwMultipleClothoidSegment final
{
public:
	struct FVector2D                              StartPosition;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIFwClothoidCurve                     Curve1;                                            // 0x0010(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAIFwClothoidCurve                     Curve2;                                            // 0x001C(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAIFwClothoidCurve                     Curve3;                                            // 0x0028(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                         S1;                                                // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         S2;                                                // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIFwMultipleClothoidSegment;

// ScriptStruct AIFramework.AIFwHTNMethod
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FAIFwHTNMethod final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIFwHTNMethod;

// ScriptStruct AIFramework.AIFwHTNTask
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FAIFwHTNTask final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIFwHTNTask;

// ScriptStruct AIFramework.AIFwIMapLayoutCell
// 0x0028 (0x0028 - 0x0000)
struct FAIFwIMapLayoutCell final
{
public:
	uint64                                        NavNode;                                           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         X;                                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Y;                                                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Neighbors[0x4];                                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIFwIMapLayoutCell;

// ScriptStruct AIFramework.AIFwParameterizedHTNDomain
// 0x0018 (0x0018 - 0x0000)
struct FAIFwParameterizedHTNDomain final
{
public:
	class UAIFwHTNDomain*                         Domain;                                            // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAIFwBTArgument>                Arguments;                                         // 0x0008(0x0010)(Edit, EditFixedSize, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIFwParameterizedHTNDomain;

// ScriptStruct AIFramework.AIFwPerceivedItemPoint
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FAIFwPerceivedItemPoint final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIFwPerceivedItemPoint;

// ScriptStruct AIFramework.AIFwPerceivedItemActor
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FAIFwPerceivedItemActor final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIFwPerceivedItemActor;

// ScriptStruct AIFramework.AIFwHearingActorData
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FAIFwHearingActorData final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIFwHearingActorData;

// ScriptStruct AIFramework.AIFwFactionRelationSettings
// 0x000C (0x000C - 0x0000)
struct FAIFwFactionRelationSettings final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIFwFactionRelationSettings;

// ScriptStruct AIFramework.AIFwFactionSettings
// 0x0018 (0x0018 - 0x0000)
struct FAIFwFactionSettings final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAIFwFactionRelationSettings>   Relations;                                         // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIFwFactionSettings;

// ScriptStruct AIFramework.AIFwSmartObjectUserSettings
// 0x0008 (0x0008 - 0x0000)
struct FAIFwSmartObjectUserSettings final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIFwSmartObjectUserSettings;

// ScriptStruct AIFramework.AIFwSmartObjectUserSelector
// 0x0004 (0x0004 - 0x0000)
struct alignas(0x04) FAIFwSmartObjectUserSelector final
{
public:
	uint8                                         bSupportsUser0 : 1;                                // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsUser1 : 1;                                // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsUser2 : 1;                                // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsUser3 : 1;                                // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsUser4 : 1;                                // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsUser5 : 1;                                // 0x0000(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsUser6 : 1;                                // 0x0000(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsUser7 : 1;                                // 0x0000(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsUser8 : 1;                                // 0x0001(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsUser9 : 1;                                // 0x0001(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsUser10 : 1;                               // 0x0001(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsUser11 : 1;                               // 0x0001(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsUser12 : 1;                               // 0x0001(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsUser13 : 1;                               // 0x0001(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsUser14 : 1;                               // 0x0001(0x0001)(BitIndex: 0x06, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bSupportsUser15 : 1;                               // 0x0001(0x0001)(BitIndex: 0x07, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIFwSmartObjectUserSelector;

// ScriptStruct AIFramework.AIFwSmartObjectEvent
// 0x0030 (0x0030 - 0x0000)
struct FAIFwSmartObjectEvent final
{
public:
	struct FAIFwSmartObjectUserSelector           SupportedUsers;                                    // 0x0000(0x0004)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Usage;                                             // 0x0008(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bFactionNeutral : 1;                               // 0x0018(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFactionFriendly : 1;                              // 0x0018(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bFactionHostile : 1;                               // 0x0018(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIFwSmartObjectCondition*              Condition;                                         // 0x0020(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAIFwSmartObjectAction*                 Action;                                            // 0x0028(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAIFwSmartObjectEvent;

// ScriptStruct AIFramework.AIFwTupleSpaceRef
// 0x0010 (0x0010 - 0x0000)
struct alignas(0x08) FAIFwTupleSpaceRef final
{
public:
	uint8                                         Pad_0[0x10];                                       // 0x0000(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAIFwTupleSpaceRef;

}

