#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ALI_ActionHuman_WeponBlend

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ALI_ActionHuman_WeponBlend.ALI_ActionHuman_WeponBlend_C.Post Finger Blend
// 0x0020 (0x0020 - 0x0000)
struct ALI_ActionHuman_WeponBlend_C_Post_Finger_Blend final
{
public:
	struct FPoseLink                              InPose_1;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              Post_Finger_Blend_0;                               // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ALI_ActionHuman_WeponBlend_C_Post_Finger_Blend;

// Function ALI_ActionHuman_WeponBlend.ALI_ActionHuman_WeponBlend_C.Post InAir Blend
// 0x0010 (0x0010 - 0x0000)
struct ALI_ActionHuman_WeponBlend_C_Post_InAir_Blend final
{
public:
	struct FPoseLink                              Post_InAir_Blend_0;                                // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ALI_ActionHuman_WeponBlend_C_Post_InAir_Blend;

// Function ALI_ActionHuman_WeponBlend.ALI_ActionHuman_WeponBlend_C.PostBlend
// 0x0020 (0x0020 - 0x0000)
struct ALI_ActionHuman_WeponBlend_C_PostBlend final
{
public:
	struct FPoseLink                              InPose_0;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              PostBlend_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ALI_ActionHuman_WeponBlend_C_PostBlend;

// Function ALI_ActionHuman_WeponBlend.ALI_ActionHuman_WeponBlend_C.PreBlend
// 0x0020 (0x0020 - 0x0000)
struct ALI_ActionHuman_WeponBlend_C_PreBlend final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              PreBlend_0;                                        // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ALI_ActionHuman_WeponBlend_C_PreBlend;

}

