#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ANS_VanishMaterialParameter

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass ANS_VanishMaterialParameter.ANS_VanishMaterialParameter_C
// 0x0030 (0x00A0 - 0x0070)
class UANS_VanishMaterialParameter_C final : public USimpleAnimNotifyState
{
public:
	E_ANS_MeshType                                MeshType;                                          // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseVanishActorSize;                               // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        VanishActorSize;                                   // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseVanishCenter;                                  // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VanishCenter;                                      // 0x0088(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ANS_VanishMaterialParameter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ANS_VanishMaterialParameter_C")
	}
	static class UANS_VanishMaterialParameter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANS_VanishMaterialParameter_C>();
	}
};
DUMPER7_ASSERTS_UANS_VanishMaterialParameter_C;

}

