#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AppAudio

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AppAudio_structs.hpp"
#include "AkAudio_structs.hpp"
#include "AkAudio_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Niagara_classes.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// Class AppAudio.AnimNotify_AppVoice
// 0x0008 (0x0040 - 0x0038)
class UAnimNotify_AppVoice final : public UAnimNotify
{
public:
	class FName                                   VoiceName;                                         // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimNotify_AppVoice")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimNotify_AppVoice")
	}
	static class UAnimNotify_AppVoice* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimNotify_AppVoice>();
	}
};
DUMPER7_ASSERTS_UAnimNotify_AppVoice;

// Class AppAudio.AppAudioAmbientLibrary
// 0x0000 (0x0028 - 0x0028)
class UAppAudioAmbientLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void SetCircleAmbientDebugDraw(const class UObject* WorldContextObject, bool bDraw);
	static void SetPointData(struct FAppAudioCircleAmbientPointData& PointData, const TArray<struct FVector>& InPoints, float AreaBoxSize);
	static void SetRainAudio(const class UObject* WorldContextObject, float Wet, float Drop);
	static void SetWindAudio(const class UObject* WorldContextObject, float Speed, const struct FVector& Direction);
	static void SpawnThunderAudio(const class UObject* WorldContextObject, const struct FVector& Location);
	static void TraceGround(const class UObject* WorldContextObject, const TSet<class FName>& SurfaceNames, const struct FBox& TraceRange, float TraceMargin, float TraceMarginZ, TMap<class FName, struct FAppAudioCircleAmbientPoints>* Out);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioAmbientLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioAmbientLibrary")
	}
	static class UAppAudioAmbientLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioAmbientLibrary>();
	}
};
DUMPER7_ASSERTS_UAppAudioAmbientLibrary;

// Class AppAudio.AppAudioAmbientSound
// 0x0038 (0x02D8 - 0x02A0)
class AAppAudioAmbientSound final : public AActor
{
public:
	class UAkComponent*                           AkComponent;                                       // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopWhenOwnerIsDestroyed;                          // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoPost;                                          // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2AA[0x2E];                                     // 0x02AA(0x002E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void StartAmbientSound();
	void StopAmbientSound();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioAmbientSound")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioAmbientSound")
	}
	static class AAppAudioAmbientSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppAudioAmbientSound>();
	}
};
DUMPER7_ASSERTS_AAppAudioAmbientSound;

// Class AppAudio.AppAudioAmbientWorld
// 0x0160 (0x01A0 - 0x0040)
class UAppAudioAmbientWorld final : public UTickableWorldSubsystem
{
public:
	TMap<class FName, class AAppAudioCircleAmbient*> CircleAmbientMap;                               // 0x0040(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	TMap<class FName, class AAppAudioRandomAmbient*> CircleRandomAmbientMap;                         // 0x0090(0x0050)(Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	class AAppAudioPaintAreaAmbient*              PaintAreaAmbient;                                  // 0x00E0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UAppAudioWindAmbientComponent*          WindAmbient;                                       // 0x00E8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UAkComponent*                           RainAkComponent;                                   // 0x00F0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_F8[0x8];                                       // 0x00F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAkComponent*>                   ThunderComponentPool;                              // 0x0100(0x0010)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_110[0x90];                                     // 0x0110(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class AAppAudioCircleAmbient* GetCircleAmbient(class FName MaterialName);
	class AAppAudioRandomAmbient* GetCircleRandomAmbient(class FName MaterialName);
	class AAppAudioPaintAreaAmbient* GetPaintAreaAmbient();
	class UAppAudioWindAmbientComponent* GetWindAmbient();
	void ThunderPostEvent(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioAmbientWorld")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioAmbientWorld")
	}
	static class UAppAudioAmbientWorld* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioAmbientWorld>();
	}
};
DUMPER7_ASSERTS_UAppAudioAmbientWorld;

// Class AppAudio.AppAudioAnimFoleyComponent
// 0x0200 (0x0430 - 0x0230)
class UAppAudioAnimFoleyComponent final : public USceneComponent
{
public:
	class UAppAudioAnimFoleyDataAsset*            AnimFoleyData;                                     // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_238[0x1E8];                                    // 0x0238(0x01E8)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSingleNodeInstance*                LogAnimSingleNodeInstance;                         // 0x0420(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_428[0x8];                                      // 0x0428(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioAnimFoleyComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioAnimFoleyComponent")
	}
	static class UAppAudioAnimFoleyComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioAnimFoleyComponent>();
	}
};
DUMPER7_ASSERTS_UAppAudioAnimFoleyComponent;

// Class AppAudio.AppAudioAnimFoleyDataAsset
// 0x00A8 (0x00D8 - 0x0030)
class UAppAudioAnimFoleyDataAsset final : public UDataAsset
{
public:
	TMap<class FName, struct FAppAudioAnimFoleyEvent> EventMap;                                      // 0x0030(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class UAkAudioEvent*, float>             EventLimitTime;                                    // 0x0080(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UAkRtpc*                                ActorSpeedRTPC;                                    // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioAnimFoleyDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioAnimFoleyDataAsset")
	}
	static class UAppAudioAnimFoleyDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioAnimFoleyDataAsset>();
	}
};
DUMPER7_ASSERTS_UAppAudioAnimFoleyDataAsset;

// Class AppAudio.ANS_DisableAppAudioAnimFoley
// 0x0008 (0x0038 - 0x0030)
class UANS_DisableAppAudioAnimFoley final : public UAnimNotifyState
{
public:
	class UAppAudioAnimFoleyComponent*            TargetComponent;                                   // 0x0030(0x0008)(ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ANS_DisableAppAudioAnimFoley")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ANS_DisableAppAudioAnimFoley")
	}
	static class UANS_DisableAppAudioAnimFoley* GetDefaultObj()
	{
		return GetDefaultObjImpl<UANS_DisableAppAudioAnimFoley>();
	}
};
DUMPER7_ASSERTS_UANS_DisableAppAudioAnimFoley;

// Class AppAudio.AppAudioCircleAmbient
// 0x01C8 (0x0468 - 0x02A0)
class AAppAudioCircleAmbient final : public AActor
{
public:
	class FName                                   MaterialName;                                      // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8[0x1C0];                                    // 0x02A8(0x01C0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioCircleAmbient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioCircleAmbient")
	}
	static class AAppAudioCircleAmbient* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppAudioCircleAmbient>();
	}
};
DUMPER7_ASSERTS_AAppAudioCircleAmbient;

// Class AppAudio.AppAudioCircleAmbientMaterialDataAsset
// 0x0050 (0x0080 - 0x0030)
class UAppAudioCircleAmbientMaterialDataAsset final : public UDataAsset
{
public:
	TMap<class FName, struct FAppAudioCircleAmbientMaterialData> MaterialData;                       // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioCircleAmbientMaterialDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioCircleAmbientMaterialDataAsset")
	}
	static class UAppAudioCircleAmbientMaterialDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioCircleAmbientMaterialDataAsset>();
	}
};
DUMPER7_ASSERTS_UAppAudioCircleAmbientMaterialDataAsset;

// Class AppAudio.AppAudioCircleAmbientPointDataAsset
// 0x0088 (0x00B8 - 0x0030)
class UAppAudioCircleAmbientPointDataAsset final : public UDataAsset
{
public:
	TMap<class FName, struct FAppAudioCircleAmbientPointData> PointData;                             // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FBox                                   Box;                                               // 0x0080(0x0038)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	void SetPoints(class FName MaterialName, const TArray<struct FVector>& InPoints, float AreaBoxSize);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioCircleAmbientPointDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioCircleAmbientPointDataAsset")
	}
	static class UAppAudioCircleAmbientPointDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioCircleAmbientPointDataAsset>();
	}
};
DUMPER7_ASSERTS_UAppAudioCircleAmbientPointDataAsset;

// Class AppAudio.AppAudioCircleAmbientPointComponent
// 0x0010 (0x0240 - 0x0230)
class UAppAudioCircleAmbientPointComponent final : public USceneComponent
{
public:
	class UAppAudioCircleAmbientPointDataAsset*   Data;                                              // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_238[0x8];                                      // 0x0238(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioCircleAmbientPointComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioCircleAmbientPointComponent")
	}
	static class UAppAudioCircleAmbientPointComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioCircleAmbientPointComponent>();
	}
};
DUMPER7_ASSERTS_UAppAudioCircleAmbientPointComponent;

// Class AppAudio.AppAudioCircleAmbientPointActor
// 0x0008 (0x02A8 - 0x02A0)
class AAppAudioCircleAmbientPointActor final : public AActor
{
public:
	class UAppAudioCircleAmbientPointComponent*   PointComponent;                                    // 0x02A0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioCircleAmbientPointActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioCircleAmbientPointActor")
	}
	static class AAppAudioCircleAmbientPointActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppAudioCircleAmbientPointActor>();
	}
};
DUMPER7_ASSERTS_AAppAudioCircleAmbientPointActor;

// Class AppAudio.AppAudioComponent
// 0x0080 (0x0490 - 0x0410)
class UAppAudioComponent final : public UAkComponent
{
public:
	uint8                                         Pad_410[0x80];                                     // 0x0410(0x0080)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioComponent")
	}
	static class UAppAudioComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioComponent>();
	}
};
DUMPER7_ASSERTS_UAppAudioComponent;

// Class AppAudio.AppAudioFollowAddVolume
// 0x0000 (0x02D8 - 0x02D8)
class AAppAudioFollowAddVolume final : public AVolume
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioFollowAddVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioFollowAddVolume")
	}
	static class AAppAudioFollowAddVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppAudioFollowAddVolume>();
	}
};
DUMPER7_ASSERTS_AAppAudioFollowAddVolume;

// Class AppAudio.AppAudioFollowVolume
// 0x0030 (0x0308 - 0x02D8)
class AAppAudioFollowVolume : public AVolume
{
public:
	bool                                          bIncludeAllDescendants;                            // 0x02D8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D9[0x2F];                                     // 0x02D9(0x002F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioFollowVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioFollowVolume")
	}
	static class AAppAudioFollowVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppAudioFollowVolume>();
	}
};
DUMPER7_ASSERTS_AAppAudioFollowVolume;

// Class AppAudio.AppAudioFollowAmbientSound
// 0x0010 (0x0318 - 0x0308)
class AAppAudioFollowAmbientSound final : public AAppAudioFollowVolume
{
public:
	class UAkComponent*                           AkComponent;                                       // 0x0308(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	bool                                          AutoPost;                                          // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioFollowAmbientSound")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioFollowAmbientSound")
	}
	static class AAppAudioFollowAmbientSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppAudioFollowAmbientSound>();
	}
};
DUMPER7_ASSERTS_AAppAudioFollowAmbientSound;

// Class AppAudio.AppAudioGameInstance
// 0x0008 (0x0038 - 0x0030)
class UAppAudioGameInstance final : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioGameInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioGameInstance")
	}
	static class UAppAudioGameInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioGameInstance>();
	}
};
DUMPER7_ASSERTS_UAppAudioGameInstance;

// Class AppAudio.AppAudioGameSettings
// 0x0138 (0x0168 - 0x0030)
class UAppAudioGameSettings final : public UDataAsset
{
public:
	TArray<class UAkAudioType*>                   GlobalAkAudioEvents;                               // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	class UAppAudioVoiceResource*                 StreamingVoiceResource;                            // 0x0040(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAppAudioCircleAmbientMaterialDataAsset* CircleAmbientMaterialData;                        // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAppAudioPaintAreaAmbientEventDataAsset* PaintAmbientEventData;                            // 0x0050(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAppAudioRandomAmbientDataAsset*        RandomAmbientData;                                 // 0x0058(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAppAudioNavAreaAmbientDataAsset*       NavAreaAmbientData;                                // 0x0060(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAppAudioWindAmbientData*               WindAmbientData;                                   // 0x0068(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAkAudioEvent*                          RainAudioEvent;                                    // 0x0070(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAkRtpc*                                RainWetRTPC;                                       // 0x0078(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAkRtpc*                                RainDropRTPC;                                      // 0x0080(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAkAudioEvent*                          ThunderAudioEvent;                                 // 0x0088(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAkRtpc*                                ThunderDistanceMeterRTPC;                          // 0x0090(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UCurveFloat*                            ThunderDelayCurve;                                 // 0x0098(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<struct FAppAudioAuxBusParam>           DynamicReverbAuxBusParams;                         // 0x00A0(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UAkRtpc*                                PlayerVectorHeightRTPC;                            // 0x00B0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TMap<class FName, int32>                      OcclusionTagToPercentMap;                          // 0x00B8(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<class FName, class FName>                PhysicalMaterialToOcclusionTagMap;                 // 0x0108(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         OcclusionValueChangeDuration;                      // 0x0158(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OcclusionDistanceMax;                              // 0x015C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OcclusionHitNum;                                   // 0x0160(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OcclusionBoundsSize;                               // 0x0164(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioGameSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioGameSettings")
	}
	static class UAppAudioGameSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioGameSettings>();
	}
};
DUMPER7_ASSERTS_UAppAudioGameSettings;

// Class AppAudio.AppAudioInterface
// 0x0000 (0x0000 - 0x0000)
class IAppAudioInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioInterface")
	}
	static class IAppAudioInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAppAudioInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAppAudioInterface;

// Class AppAudio.AppAudioLibrary
// 0x0000 (0x0028 - 0x0028)
class UAppAudioLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UAkComponent* GetAkComponent(class AActor* Actor, const struct FVector& Location, EAttachLocation LocationType);
	static class UAkComponent* GetAkComponentAttachPoint(class USceneComponent* AttachToComponent, class FName AttachPointName, const struct FVector& Location, EAttachLocation LocationType);
	static void PauseGame();
	static int32 PostAssociatedEvent(class UAkComponent* AkComponent);
	static int32 PostEvent(class UAkAudioEvent* AkEvent, class AActor* Actor);
	static int32 PostEventActorAtLocation(class UAkAudioEvent* AkEvent, class AActor* Actor, const struct FVector& Location, const struct FRotator& Orientation);
	static int32 PostEventAtActorLocation(class UAkAudioEvent* AkEvent, const class AActor* Actor);
	static int32 PostEventAtLocation(const class UObject* WorldContextObject, class UAkAudioEvent* AkEvent, const struct FVector& Location, const struct FRotator& Orientation);
	static int32 PostEventAtSocketLocation(class UAkAudioEvent* AkEvent, const class USceneComponent* SceneComponent, class FName SocketName);
	static int32 PostEventAttachPoint(class UAkAudioEvent* AkEvent, class USceneComponent* AttachToComponent, class FName AttachPointName);
	static int32 PostEventAtTransform(const class UObject* WorldContextObject, class UAkAudioEvent* AkEvent, const struct FTransform& Transform);
	static int32 PostEventComponent(class UAkAudioEvent* AkEvent, class UAkComponent* AkComponent);
	static int32 PostEventSystem(const class UObject* WorldContextObject, class UAkAudioEvent* AkEvent);
	static void PostTrigger(class FName TriggerName, class AActor* Actor);
	static void ResumeGame();
	static void SetRTPC(class FName RTPCName, float Value, int32 InterpolationTimeMs, class AActor* Actor);
	static void SetState(class FName GroupName, class FName StateName);
	static void SetSwitch(class FName GroupName, class FName StateName, class AActor* Actor);
	static class UAkComponent* SpawnAkComponentAtActorLocation(class UAkAudioEvent* AkEvent, const class AActor* Actor, bool AutoPost, bool AutoDestroy);
	static class UAkComponent* SpawnAkComponentAtLocation(const class UObject* WorldContextObject, class UAkAudioEvent* AkEvent, const struct FVector& Location, const struct FRotator& Orientation, bool AutoPost, bool AutoDestroy);
	static class UAkComponent* SpawnAkComponentAtSocketLocation(class UAkAudioEvent* AkEvent, const class USceneComponent* SceneComponent, class FName SocketName, bool AutoPost, bool AutoDestroy);
	static class UAkComponent* SpawnAkComponentAtTransform(const class UObject* WorldContextObject, class UAkAudioEvent* AkEvent, const struct FTransform& Transform, bool AutoPost, bool AutoDestroy);
	static class UAkComponent* SpawnAkComponentAtWorld(const class UObject* WorldContextObject, class UAkAudioEvent* AkEvent, bool AutoPost, bool AutoDestroy);
	static void StopActor(class AActor* Actor);
	static void StopActorAll(class AActor* Actor);
	static void StopAll();
	static void StopAttachPoint(class USceneComponent* AttachToComponent, class FName AttachPointName);
	static void StopPlayingID(int32 PlayingID);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioLibrary")
	}
	static class UAppAudioLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioLibrary>();
	}
};
DUMPER7_ASSERTS_UAppAudioLibrary;

// Class AppAudio.AppAudioNavAreaAmbientComponent
// 0x0240 (0x0470 - 0x0230)
class UAppAudioNavAreaAmbientComponent : public USceneComponent
{
public:
	class UAppAudioNavAreaAmbientWorld*           NavAreaWorld;                                      // 0x0230(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class AAppAudioNavAreaAmbientPoint*           NowAreaPoint;                                      // 0x0238(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class AAppAudioNavAreaAmbientExitVolume*      NowAreaExit;                                       // 0x0240(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class AAppAudioNavAreaAmbientPoint*           NextAreaPoint;                                     // 0x0248(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	bool                                          bNextAreaError;                                    // 0x0250(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_251[0xD7];                                     // 0x0251(0x00D7)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, float>                      ExitAreaDistanceSq;                                // 0x0328(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_378[0xF8];                                     // 0x0378(0x00F8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioNavAreaAmbientComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioNavAreaAmbientComponent")
	}
	static class UAppAudioNavAreaAmbientComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioNavAreaAmbientComponent>();
	}
};
DUMPER7_ASSERTS_UAppAudioNavAreaAmbientComponent;

// Class AppAudio.AppAudioNavAreaAmbientPlayerComponent
// 0x0000 (0x0470 - 0x0470)
class UAppAudioNavAreaAmbientPlayerComponent final : public UAppAudioNavAreaAmbientComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioNavAreaAmbientPlayerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioNavAreaAmbientPlayerComponent")
	}
	static class UAppAudioNavAreaAmbientPlayerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioNavAreaAmbientPlayerComponent>();
	}
};
DUMPER7_ASSERTS_UAppAudioNavAreaAmbientPlayerComponent;

// Class AppAudio.AppAudioNavAreaAmbientMain
// 0x0008 (0x02A8 - 0x02A0)
class AAppAudioNavAreaAmbientMain final : public AActor
{
public:
	class UAppAudioNavAreaAmbientPlayerComponent* NavAreaComponent;                                  // 0x02A0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioNavAreaAmbientMain")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioNavAreaAmbientMain")
	}
	static class AAppAudioNavAreaAmbientMain* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppAudioNavAreaAmbientMain>();
	}
};
DUMPER7_ASSERTS_AAppAudioNavAreaAmbientMain;

// Class AppAudio.AppAudioNavAreaAmbientDataAsset
// 0x0058 (0x0088 - 0x0030)
class UAppAudioNavAreaAmbientDataAsset final : public UDataAsset
{
public:
	TMap<class FName, struct FAppAudioNavAreaAmbientData> Areas;                                     // 0x0030(0x0050)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         SearchExitDistance;                                // 0x0080(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SearchOutsideDistance;                             // 0x0084(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioNavAreaAmbientDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioNavAreaAmbientDataAsset")
	}
	static class UAppAudioNavAreaAmbientDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioNavAreaAmbientDataAsset>();
	}
};
DUMPER7_ASSERTS_UAppAudioNavAreaAmbientDataAsset;

// Class AppAudio.AppAudioNavAreaAmbientExitVolume
// 0x0010 (0x02E8 - 0x02D8)
class AAppAudioNavAreaAmbientExitVolume final : public AVolume
{
public:
	TArray<class AAppAudioNavAreaAmbientPoint*>   Areas;                                             // 0x02D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioNavAreaAmbientExitVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioNavAreaAmbientExitVolume")
	}
	static class AAppAudioNavAreaAmbientExitVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppAudioNavAreaAmbientExitVolume>();
	}
};
DUMPER7_ASSERTS_AAppAudioNavAreaAmbientExitVolume;

// Class AppAudio.AppAudioNavAreaAmbientPoint
// 0x0020 (0x02F8 - 0x02D8)
class AAppAudioNavAreaAmbientPoint final : public AVolume
{
public:
	class FName                                   AreaName;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseNavMesh;                                       // 0x02E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AAppAudioNavAreaAmbientExitVolume*> Exits2;                                         // 0x02E8(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)

public:
	struct FBox GetBoundsBox() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioNavAreaAmbientPoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioNavAreaAmbientPoint")
	}
	static class AAppAudioNavAreaAmbientPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppAudioNavAreaAmbientPoint>();
	}
};
DUMPER7_ASSERTS_AAppAudioNavAreaAmbientPoint;

// Class AppAudio.AppAudioNavAreaAmbientIncludeVolume
// 0x0008 (0x02E0 - 0x02D8)
class AAppAudioNavAreaAmbientIncludeVolume final : public AVolume
{
public:
	class AAppAudioNavAreaAmbientPoint*           Parent;                                            // 0x02D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioNavAreaAmbientIncludeVolume")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioNavAreaAmbientIncludeVolume")
	}
	static class AAppAudioNavAreaAmbientIncludeVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppAudioNavAreaAmbientIncludeVolume>();
	}
};
DUMPER7_ASSERTS_AAppAudioNavAreaAmbientIncludeVolume;

// Class AppAudio.AppAudioNavAreaAmbientWorld
// 0x0040 (0x0070 - 0x0030)
class UAppAudioNavAreaAmbientWorld final : public UWorldSubsystem
{
public:
	class UAppAudioNavAreaAmbientDataAsset*       DataAsset;                                         // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class AAppAudioNavAreaAmbientMain*            NavAreaActor;                                      // 0x0038(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class AAppAudioNavAreaAmbientPoint*>   Areas;                                             // 0x0040(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class AAppAudioNavAreaAmbientExitVolume*> Exits;                                          // 0x0050(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class AAppAudioNavAreaAmbientIncludeVolume*> IncludeVolume;                               // 0x0060(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioNavAreaAmbientWorld")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioNavAreaAmbientWorld")
	}
	static class UAppAudioNavAreaAmbientWorld* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioNavAreaAmbientWorld>();
	}
};
DUMPER7_ASSERTS_UAppAudioNavAreaAmbientWorld;

// Class AppAudio.AppAudioPaintAreaAmbientEventDataAsset
// 0x0060 (0x0090 - 0x0030)
class UAppAudioPaintAreaAmbientEventDataAsset final : public UDataAsset
{
public:
	float                                         FadeDistance;                                      // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AuxBusFadeDistance;                                // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          PlayAudioEvent;                                    // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	TMap<struct FColor, struct FAppAudioPaintAreaAmbientEventColorToParamValue> ColorToParam;        // 0x0040(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioPaintAreaAmbientEventDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioPaintAreaAmbientEventDataAsset")
	}
	static class UAppAudioPaintAreaAmbientEventDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioPaintAreaAmbientEventDataAsset>();
	}
};
DUMPER7_ASSERTS_UAppAudioPaintAreaAmbientEventDataAsset;

// Class AppAudio.AppAudioPaintAreaAmbient
// 0x0228 (0x04C8 - 0x02A0)
class AAppAudioPaintAreaAmbient final : public AActor
{
public:
	class UAkAudioEvent*                          PlayAudioEvent;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	float                                         FadeDistance;                                      // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AuxBusFadeDistance;                                // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkComponent*                           Emitter;                                           // 0x02B0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_2B8[0x210];                                    // 0x02B8(0x0210)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioPaintAreaAmbient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioPaintAreaAmbient")
	}
	static class AAppAudioPaintAreaAmbient* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppAudioPaintAreaAmbient>();
	}
};
DUMPER7_ASSERTS_AAppAudioPaintAreaAmbient;

// Class AppAudio.AppAudioPaintAreaAmbientTextureData
// 0x0048 (0x0078 - 0x0030)
class UAppAudioPaintAreaAmbientTextureData final : public UDataAsset
{
public:
	TArray<struct FColor>                         Palette;                                           // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, NativeAccessSpecifierPublic)
	int32                                         TextureSizeX;                                      // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TextureSizeY;                                      // 0x0044(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x30];                                      // 0x0048(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioPaintAreaAmbientTextureData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioPaintAreaAmbientTextureData")
	}
	static class UAppAudioPaintAreaAmbientTextureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioPaintAreaAmbientTextureData>();
	}
};
DUMPER7_ASSERTS_UAppAudioPaintAreaAmbientTextureData;

// Class AppAudio.AppAudioPaintAreaAmbientDecalActor
// 0x0040 (0x02E8 - 0x02A8)
class AAppAudioPaintAreaAmbientDecalActor final : public ADecalActor
{
public:
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppAudioPaintAreaAmbientTextureData*   TexData;                                           // 0x02B0(0x0008)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     DecalMaterial;                                     // 0x02B8(0x0008)(Edit, ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	bool                                          DataLayerChangeFlag;                               // 0x02C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TargetDataLayerName;                               // 0x02C8(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAppAudioPaintAreaAmbientTextureData*   SubTexData;                                        // 0x02D8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAppAudioPaintAreaAmbientTextureData*   ActiveTexData;                                     // 0x02E0(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static void DebugSetVisibleAll(const class UObject* WorldContextObject, bool bVisible);

	void OnDataLayerStateChanged(const class UDataLayerInstance* DataLayer, EDataLayerRuntimeState State);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioPaintAreaAmbientDecalActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioPaintAreaAmbientDecalActor")
	}
	static class AAppAudioPaintAreaAmbientDecalActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppAudioPaintAreaAmbientDecalActor>();
	}
};
DUMPER7_ASSERTS_AAppAudioPaintAreaAmbientDecalActor;

// Class AppAudio.AppAudioPaintAreaAmbientTextureInterface
// 0x0000 (0x0000 - 0x0000)
class IAppAudioPaintAreaAmbientTextureInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioPaintAreaAmbientTextureInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioPaintAreaAmbientTextureInterface")
	}
	static class IAppAudioPaintAreaAmbientTextureInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAppAudioPaintAreaAmbientTextureInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAppAudioPaintAreaAmbientTextureInterface;

// Class AppAudio.AppAudioRandomAmbientDataAsset
// 0x0018 (0x0048 - 0x0030)
class UAppAudioRandomAmbientDataAsset final : public UDataAsset
{
public:
	float                                         EmitRadius;                                        // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAppAudioRandomAmbientSetting>  Settings;                                          // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioRandomAmbientDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioRandomAmbientDataAsset")
	}
	static class UAppAudioRandomAmbientDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioRandomAmbientDataAsset>();
	}
};
DUMPER7_ASSERTS_UAppAudioRandomAmbientDataAsset;

// Class AppAudio.AppAudioRandomAmbientEmitter
// 0x0010 (0x02B0 - 0x02A0)
class AAppAudioRandomAmbientEmitter final : public AActor
{
public:
	class UAppAudioComponent*                     AkComponent;                                       // 0x02A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioRandomAmbientEmitter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioRandomAmbientEmitter")
	}
	static class AAppAudioRandomAmbientEmitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppAudioRandomAmbientEmitter>();
	}
};
DUMPER7_ASSERTS_AAppAudioRandomAmbientEmitter;

// Class AppAudio.AppAudioRandomAmbient
// 0x00A8 (0x0348 - 0x02A0)
class AAppAudioRandomAmbient final : public AActor
{
public:
	class UAkAudioEvent*                          AudioEvent;                                        // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	int32                                         EmitNum;                                           // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EmitRate;                                          // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EmitSleepTime;                                     // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B8[0x88];                                     // 0x02B8(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppAudioWindAmbientComponent*          WindAmb;                                           // 0x0340(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioRandomAmbient")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioRandomAmbient")
	}
	static class AAppAudioRandomAmbient* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAppAudioRandomAmbient>();
	}
};
DUMPER7_ASSERTS_AAppAudioRandomAmbient;

// Class AppAudio.AppAudioRequestComponent
// 0x0150 (0x01F0 - 0x00A0)
class UAppAudioRequestComponent : public UActorComponent
{
public:
	class UAppAudioRequestData*                   RequestData;                                       // 0x00A0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class USceneComponent*                        SceneComponent;                                    // 0x00A8(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_B0[0x140];                                     // 0x00B0(0x0140)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 PostAkEvent(class UAkAudioEvent* Event);
	int32 PostAkEventAtLocation(class UAkAudioEvent* Event, const struct FVector& Location, const struct FRotator& Orientation);
	int32 PostAkEventCallback(class UAkAudioEvent* Event, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback_0);
	int32 PostEvent(class FName Name_0);
	int32 PostEventAtLocation(class FName Name_0, const struct FVector& Location, const struct FRotator& Orientation);
	int32 PostEventCallback(class FName Name_0, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback_0);
	void PostTrigger(class FName Name_0);
	void SetRTPC(class FName Name_0, float Value, int32 InterpolationTimeMs);
	void SetSwitch(class FName GroupName, class FName StateName);
	void StopAll();

	bool IsAkPlaying(class UAkAudioEvent* Event) const;
	bool IsPlaying(class FName EventName) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioRequestComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioRequestComponent")
	}
	static class UAppAudioRequestComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioRequestComponent>();
	}
};
DUMPER7_ASSERTS_UAppAudioRequestComponent;

// Class AppAudio.AppAudioCharacterRequestComponent
// 0x0000 (0x01F0 - 0x01F0)
class UAppAudioCharacterRequestComponent final : public UAppAudioRequestComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioCharacterRequestComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioCharacterRequestComponent")
	}
	static class UAppAudioCharacterRequestComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioCharacterRequestComponent>();
	}
};
DUMPER7_ASSERTS_UAppAudioCharacterRequestComponent;

// Class AppAudio.AppAudioActorRequestComponent
// 0x0000 (0x01F0 - 0x01F0)
class UAppAudioActorRequestComponent final : public UAppAudioRequestComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioActorRequestComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioActorRequestComponent")
	}
	static class UAppAudioActorRequestComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioActorRequestComponent>();
	}
};
DUMPER7_ASSERTS_UAppAudioActorRequestComponent;

// Class AppAudio.AppAudioRequestData
// 0x01A0 (0x01D0 - 0x0030)
class UAppAudioRequestData final : public UDataAsset
{
public:
	TMap<class FName, struct FAppAudioRequestComponentSetting> ComponentSettings;                    // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<class FName, struct FAppAudioRequestEventTarget> EventTargets;                              // 0x0080(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<class FName, struct FAppAudioRequestNameTarget> RtpcTargets;                                // 0x00D0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<class FName, struct FAppAudioRequestNameTarget> SwitchTargets;                              // 0x0120(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TMap<class FName, struct FAppAudioRequestNameTarget> TriggerTargets;                             // 0x0170(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UAkAudioType*>                   HardReferences;                                    // 0x01C0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppAudioRequestData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppAudioRequestData")
	}
	static class UAppAudioRequestData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppAudioRequestData>();
	}
};
DUMPER7_ASSERTS_UAppAudioRequestData;

// Class AppAudio.AppAudioReverbControlDataAsset
// 0x0150 (0x0180 - 0x0030)
class UAppAudioReverbControlDataAsset final : public UDataAsset
{
public:
	float                                         ReverbTraceLength;                                 // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RoofTraceLength;                                   // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableBypassByConsoleCommand;                      // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TestReverbTraceLoopNum;                            // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RunningAverageBufferSize;                          // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EPhysicalSurface, struct FMaterialToAppReverbPreset> UserMaterialToAppReverbPresets;        // 0x0048(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<EAppAudioReverbParam>                  UserAppReverbParametersDisabledInPresets;          // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         ReverbTracePitchMin;                               // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReverbTracePitchMax;                               // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReverbTraceFrontYawRange;                          // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RoofCheckTracePitch;                               // 0x00B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RoofCheckTracePitchRange;                          // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RoofCheckTraceYawRange;                            // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReverbRTPCInterpolationMS;                         // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RoofRTPCInterpolationMS;                           // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAppReverbDistanceType                        ReverbDistanceType;                                // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAppReverbRayTraceType                        ReverbRayTraceType;                                // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_CA[0x2];                                       // 0x00CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReverbRayTraceReflectionCount;                     // 0x00CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
