#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AppAudio

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum AppAudio.EAppAudioVoicePlayerDelegateType
// NumValues: 0x0004
enum class EAppAudioVoicePlayerDelegateType : uint8
{
	None                                     = 0,
	PlayStart                                = 1,
	PlayEnd                                  = 2,
	EAppAudioVoicePlayerDelegateType_MAX     = 3,
};

// Enum AppAudio.EAppAudioAnimFoleyTriggerType
// NumValues: 0x0009
enum class EAppAudioAnimFoleyTriggerType : uint8
{
	None                                     = 0,
	Angle                                    = 1,
	Speed                                    = 2,
	Distance                                 = 3,
	DistanceX                                = 4,
	DistanceY                                = 5,
	DistanceZ                                = 6,
	AngleSpeed                               = 7,
	EAppAudioAnimFoleyTriggerType_MAX        = 8,
};

// Enum AppAudio.EAppAudioAnimFoleyConditionValueType
// NumValues: 0x000D
enum class EAppAudioAnimFoleyConditionValueType : uint8
{
	BoolFalse                                = 0,
	BoolTrue                                 = 1,
	Angle                                    = 2,
	Speed                                    = 3,
	Distance                                 = 4,
	DistanceX                                = 5,
	DistanceY                                = 6,
	DistanceZ                                = 7,
	LocationX                                = 8,
	LocationY                                = 9,
	LocationZ                                = 10,
	AngleSpeed                               = 11,
	EAppAudioAnimFoleyConditionValueType_MAX = 12,
};

// Enum AppAudio.EAppAudioAnimFoleyConditionOperator
// NumValues: 0x0003
enum class EAppAudioAnimFoleyConditionOperator : uint8
{
	GT                                       = 0,
	LT                                       = 1,
	EAppAudioAnimFoleyConditionOperator_MAX  = 2,
};

// Enum AppAudio.EAppAudioAnimFoleyLogicalOperator
// NumValues: 0x0003
enum class EAppAudioAnimFoleyLogicalOperator : uint8
{
	And                                      = 0,
	Or                                       = 1,
	EAppAudioAnimFoleyLogicalOperator_MAX    = 2,
};

// Enum AppAudio.EAppAudioAnimFoleyStateLogType
// NumValues: 0x0003
enum class EAppAudioAnimFoleyStateLogType : uint8
{
	Threshold                                = 0,
	Condition                                = 1,
	EAppAudioAnimFoleyStateLogType_MAX       = 2,
};

// Enum AppAudio.ESpeakerType
// NumValues: 0x0004
enum class ESpeakerType : uint8
{
	MONO                                     = 0,
	STEREO                                   = 1,
	SURROUND                                 = 2,
	ESpeakerType_MAX                         = 3,
};

// Enum AppAudio.EAppAudioRandomAmbientSettingLocationType
// NumValues: 0x0002
enum class EAppAudioRandomAmbientSettingLocationType : uint8
{
	CircleAmbientPoint                       = 0,
	EAppAudioRandomAmbientSettingLocationType_MAX = 1,
};

// Enum AppAudio.EAppAudioReverbParam
// NumValues: 0x000E
enum class EAppAudioReverbParam : uint8
{
	None                                     = 0,
	Predelay                                 = 1,
	Reverb                                   = 2,
	HFDamping                                = 3,
	EQLow                                    = 4,
	EQLowPeak                                = 5,
	EQHigh                                   = 6,
	EQHighPeak                               = 7,
	Reverb_Bypass                            = 8,
	BusVolume                                = 9,
	Distance                                 = 10,
	DistanceMin                              = 11,
	Num                                      = 12,
	EAppAudioReverbParam_MAX                 = 13,
};

// Enum AppAudio.EAppReverbAuxBus
// NumValues: 0x0008
enum class EAppReverbAuxBus : uint8
{
	FrontLeft                                = 0,
	FrontRight                               = 1,
	BackLeft                                 = 2,
	BackRight                                = 3,
	Front                                    = 4,
	Back                                     = 5,
	Num                                      = 6,
	EAppReverbAuxBus_MAX                     = 7,
};

// Enum AppAudio.EAppReverbDistanceType
// NumValues: 0x0003
enum class EAppReverbDistanceType : uint8
{
	Min                                      = 0,
	Average                                  = 1,
	EAppReverbDistanceType_MAX               = 2,
};

// Enum AppAudio.EAppReverbRayTraceType
// NumValues: 0x0003
enum class EAppReverbRayTraceType : uint8
{
	Single                                   = 0,
	Reflect                                  = 1,
	EAppReverbRayTraceType_MAX               = 2,
};

// Enum AppAudio.EVoiceAnimationType
// NumValues: 0x0005
enum class EVoiceAnimationType : uint8
{
	None                                     = 0,
	Talk                                     = 1,
	Attack                                   = 2,
	Down                                     = 3,
	EVoiceAnimationType_MAX                  = 4,
};

// Enum AppAudio.EAppAudioVoicePriority
// NumValues: 0x0004
enum class EAppAudioVoicePriority : uint8
{
	Default                                  = 0,
	BattaleDrama                             = 1,
	BuddyBattle                              = 2,
	EAppAudioVoicePriority_MAX               = 3,
};

// Enum AppAudio.EAppAudioVoicePlayListPlayType
// NumValues: 0x0004
enum class EAppAudioVoicePlayListPlayType : uint8
{
	Random                                   = 0,
	Sequence                                 = 1,
	SwitchCharacter                          = 2,
	EAppAudioVoicePlayListPlayType_MAX       = 3,
};

// Enum AppAudio.EAppAudioVoicePlaySubtitlesType
// NumValues: 0x0005
enum class EAppAudioVoicePlaySubtitlesType : uint8
{
	None                                     = 0,
	Subtitles                                = 1,
	Exploration                              = 2,
	Emotion                                  = 3,
	EAppAudioVoicePlaySubtitlesType_MAX      = 4,
};

// Enum AppAudio.ENiagaraAppAudioParamType
// NumValues: 0x0003
enum class ENiagaraAppAudioParamType : uint8
{
	Location                                 = 0,
	RTPC                                     = 1,
	ENiagaraAppAudioParamType_MAX            = 2,
};

// ScriptStruct AppAudio.OnAppAudioVoicePlayParam
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x04) FOnAppAudioVoicePlayParam final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FOnAppAudioVoicePlayParam;

// ScriptStruct AppAudio.AppAudioAnimFoleyCondExp
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FAppAudioAnimFoleyCondExp final
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAppAudioAnimFoleyCondExp;

// ScriptStruct AppAudio.AppAudioCircleAmbientPointArea
// 0x0060 (0x0060 - 0x0000)
struct FAppAudioCircleAmbientPointArea final
{
public:
	struct FBox                                   Box;                                               // 0x0000(0x0038)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Points;                                            // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                                AveragePoint;                                      // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAppAudioCircleAmbientPointArea;

// ScriptStruct AppAudio.AppAudioVoicePlayerDelegateInfo
// 0x0008 (0x0008 - 0x0000)
struct FAppAudioVoicePlayerDelegateInfo final
{
public:
	int32                                         PlayID;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAppAudioVoicePlayerDelegateType              DelegateType;                                      // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAppAudioVoicePlayerDelegateInfo;

// ScriptStruct AppAudio.AppAudioCircleAmbientPoints
// 0x0010 (0x0010 - 0x0000)
struct FAppAudioCircleAmbientPoints final
{
public:
	TArray<struct FVector>                        Points;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAppAudioCircleAmbientPoints;

// ScriptStruct AppAudio.AppAudioAnimFoleyState
// 0x0038 (0x0038 - 0x0000)
struct alignas(0x08) FAppAudioAnimFoleyState final
{
public:
	uint8                                         Pad_0[0x38];                                       // 0x0000(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAppAudioAnimFoleyState;

// ScriptStruct AppAudio.AppAudioAnimFoleyThresholdData
// 0x0024 (0x0024 - 0x0000)
struct FAppAudioAnimFoleyThresholdData final
{
public:
	EAppAudioAnimFoleyTriggerType                 Type;                                              // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TargetSocketName;                                  // 0x0004(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReferenceSocketName;                               // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OriginSocketName;                                  // 0x0014(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReverseThreshold;                                 // 0x001C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFixedThreshold;                                   // 0x001D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ThresholdValue;                                    // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAppAudioAnimFoleyThresholdData;

// ScriptStruct AppAudio.AppAudioAnimFoleyConditionData
// 0x0050 (0x0050 - 0x0000)
struct FAppAudioAnimFoleyConditionData final
{
public:
	class FString                                 OpenBracket;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAppAudioAnimFoleyConditionValueType          Type;                                              // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TargetSocketName;                                  // 0x0014(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReferenceSocketName;                               // 0x001C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OriginSocketName;                                  // 0x0024(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAppAudioAnimFoleyConditionOperator           Operator;                                          // 0x002C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RightValue;                                        // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CloseBracket;                                      // 0x0038(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAppAudioAnimFoleyLogicalOperator             LogicalOperator;                                   // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAppAudioAnimFoleyConditionData;

// ScriptStruct AppAudio.AppAudioAnimFoleyEvent
// 0x0050 (0x0050 - 0x0000)
struct FAppAudioAnimFoleyEvent final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSolo;                                             // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAppAudioAnimFoleyThresholdData        Threshold;                                         // 0x0004(0x0024)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FAppAudioAnimFoleyConditionData> Conditions;                                       // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AudioEvent;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class FName                                   AudioSocketName;                                   // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AudioLimitTime;                                    // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAppAudioAnimFoleyEvent;

// ScriptStruct AppAudio.AppAudioAnimFoleyStateLog
// 0x0088 (0x0088 - 0x0000)
struct FAppAudioAnimFoleyStateLog final
{
public:
	EAppAudioAnimFoleyStateLogType                Type;                                              // 0x0000(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Name;                                              // 0x0004(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Threshold;                                         // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ThresholdMin;                                      // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BoolValue;                                         // 0x0018(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPost;                                             // 0x001C(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllow;                                            // 0x001D(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCond;                                             // 0x001E(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCondReset;                                        // 0x001F(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LimitTime;                                         // 0x0020(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TargetLocation;                                    // 0x0028(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReferenceLocation;                                 // 0x0040(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0058(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Distance;                                          // 0x0070(0x0018)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAppAudioAnimFoleyStateLog;

// ScriptStruct AppAudio.AppAudioAnimFoleyLog
// 0x0028 (0x0028 - 0x0000)
struct FAppAudioAnimFoleyLog final
{
public:
	class UAppAudioAnimFoleyDataAsset*            Data;                                              // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	float                                         AnimCurrentTime;                                   // 0x0008(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x000C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisable;                                          // 0x0010(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAppAudioAnimFoleyStateLog>     States;                                            // 0x0018(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAppAudioAnimFoleyLog;

// ScriptStruct AppAudio.AppAudioCircleAmbientAudioEventData
// 0x0028 (0x0028 - 0x0000)
struct FAppAudioCircleAmbientAudioEventData final
{
public:
	class UAkAudioEvent*                          L;                                                 // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAkAudioEvent*                          R;                                                 // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAkAudioEvent*                          SL;                                                // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAkAudioEvent*                          SR;                                                // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAkAudioEvent*                          Single;                                            // 0x0020(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FAppAudioCircleAmbientAudioEventData;

// ScriptStruct AppAudio.AppAudioCircleAmbientMaterialData
// 0x0080 (0x0080 - 0x0000)
struct FAppAudioCircleAmbientMaterialData final
{
public:
	float                                         SearchRadius;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SinglesNum;                                        // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GroupNum;                                          // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x000C(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAppAudioCircleAmbientAudioEventData   PlayAudioEventData;                                // 0x0020(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAppAudioCircleAmbientAudioEventData   StopAudioEventData;                                // 0x0048(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class UAkRtpc*                                AmountRTPC;                                        // 0x0070(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	float                                         DebugDrawSize;                                     // 0x0078(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAppAudioCircleAmbientMaterialData;

// ScriptStruct AppAudio.AppAudioCircleAmbientPointData
// 0x0048 (0x0048 - 0x0000)
struct FAppAudioCircleAmbientPointData final
{
public:
	TArray<struct FAppAudioCircleAmbientPointArea> Areas;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FBox                                   Box;                                               // 0x0010(0x0038)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAppAudioCircleAmbientPointData;

// ScriptStruct AppAudio.AppAudioAuxBusParam
// 0x0010 (0x0010 - 0x0000)
struct FAppAudioAuxBusParam final
{
public:
	class UAkAuxBus*                              AkAuxBus;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	float                                         AuxBusSendLevel;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAppAudioAuxBusParam;

// ScriptStruct AppAudio.AppAudioNavAreaPlayInfo
// 0x0028 (0x0028 - 0x0000)
struct FAppAudioNavAreaPlayInfo final
{
public:
	class UAkComponent*                           AkComponent;                                       // 0x0000(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	uint8                                         Pad_8[0x20];                                       // 0x0008(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAppAudioNavAreaPlayInfo;

// ScriptStruct AppAudio.AppAudioNavAreaAmbientData
// 0x0018 (0x0018 - 0x0000)
struct FAppAudioNavAreaAmbientData final
{
public:
	class UAkAudioEvent*                          AkAudioEvent;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAkRtpc*                                AkRtpcDistance;                                    // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	int32                                         EmitterMax;                                        // 0x0010(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAppAudioNavAreaAmbientData;

// ScriptStruct AppAudio.AppAudioPaintAreaAmbientEventColorToParamValue
// 0x0020 (0x0020 - 0x0000)
struct FAppAudioPaintAreaAmbientEventColorToParamValue final
{
public:
	class UAkRtpc*                                AkRtpc;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAkAuxBus*                              AkAuxBus;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UAkRtpc*                                AkAuxBusRtpc;                                      // 0x0010(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	float                                         AuxBusSendLevel;                                   // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAppAudioPaintAreaAmbientEventColorToParamValue;

// ScriptStruct AppAudio.AppAudioRandomAmbientSetting
// 0x0030 (0x0030 - 0x0000)
struct FAppAudioRandomAmbientSetting final
{
public:
	class UAkAudioEvent*                          AkAudioEvent;                                      // 0x0000(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	EAppAudioRandomAmbientSettingLocationType     LocationType;                                      // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LocationTypeName;                                  // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocationRandomW;                                   // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LocationRandomH;                                   // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EmitMax;                                           // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EmitPercent;                                       // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EmitSleepTime;                                     // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EmitCondWindMin;                                   // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EmitCondWindMax;                                   // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAppAudioRandomAmbientSetting;

// ScriptStruct AppAudio.AppAudioRequestComponentSetting
// 0x000C (0x000C - 0x0000)
struct FAppAudioRequestComponentSetting final
{
public:
	class FName                                   AttachName;                                        // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFollow;                                           // 0x0008(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOcclusion;                                        // 0x0009(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAppAudioRequestComponentSetting;

// ScriptStruct AppAudio.AppAudioRequestEventTarget
// 0x0038 (0x0038 - 0x0000)
struct FAppAudioRequestEventTarget final
{
public:
	TSoftObjectPtr<class UAkAudioEvent>           Event;                                             // 0x0000(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Targets;                                           // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAppAudioRequestEventTarget;

// ScriptStruct AppAudio.AppAudioRequestNameTarget
// 0x0018 (0x0018 - 0x0000)
struct FAppAudioRequestNameTarget final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Targets;                                           // 0x0008(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAppAudioRequestNameTarget;

// ScriptStruct AppAudio.MaterialToAppReverbPreset
// 0x001C (0x001C - 0x0000)
struct FMaterialToAppReverbPreset final
{
public:
	float                                         Reverb;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HFDamping;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EQLow;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EQLowPeak;                                         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EQHigh;                                            // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EQHighPeak;                                        // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BusVolume;                                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMaterialToAppReverbPreset;

// ScriptStruct AppAudio.DrawLineTraceSetting
// 0x0008 (0x0008 - 0x0000)
struct FDrawLineTraceSetting final
{
public:
	bool                                          bDraw;                                             // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 Color;                                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDrawLineTraceSetting;

// ScriptStruct AppAudio.AppAudioVoicePlayListVoice
// 0x0014 (0x0014 - 0x0000)
struct FAppAudioVoicePlayListVoice final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Delay;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAppAudioVoicePlaySubtitlesType               DisplaySubtitles;                                  // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DisplaySubtitlesExtraTime;                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAppAudioVoicePlayListVoice;

// ScriptStruct AppAudio.AppAudioVoicePlayList
// 0x0090 (0x0098 - 0x0008)
struct FAppAudioVoicePlayList final : public FTableRowBase
{
public:
	EAppAudioVoicePlayListPlayType                PlayType;                                          // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAppAudioVoicePlayListVoice>    List;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, struct FAppAudioVoicePlayListVoice> SWITCH;                                    // 0x0020(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         RandomAvoid;                                       // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAppAudioVoicePriority                        PriorityLayer;                                     // 0x0074(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Priority;                                          // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverridePriorityEqual;                            // 0x007C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWaitOther;                                        // 0x007D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvalidContinuousPlay;                            // 0x007E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InvalidContinuousPlayTimeFromEnd;                  // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayPercent;                                       // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           TalkTargets;                                       // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAppAudioVoicePlayList;

// ScriptStruct AppAudio.AppAudioWindAmbientAudioData
// 0x0018 (0x0018 - 0x0000)
struct FAppAudioWindAmbientAudioData final
{
public:
	float                                         Rotation;                                          // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Distance;                                          // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Height;                                            // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          PlayAudioEvent;                                    // 0x0010(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FAppAudioWindAmbientAudioData;

}

