#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AutoPlay

#include "Basic.hpp"

#include "AutoPlay_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AutoPlay.AutoPlayAgent.AddElement
// 0x0010 (0x0010 - 0x0000)
struct AutoPlayAgent_AddElement final
{
public:
	TSubclassOf<class UAutoPlayElement>           ElementClass;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAutoPlayElement*                       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayAgent_AddElement;

// Function AutoPlay.AutoPlayAgent.AddSensor
// 0x0010 (0x0010 - 0x0000)
struct AutoPlayAgent_AddSensor final
{
public:
	TSubclassOf<class UAutoPlaySensor>            SensorClass;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAutoPlaySensor*                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayAgent_AddSensor;

// Function AutoPlay.AutoPlayAgent.FindElementByClass
// 0x0010 (0x0010 - 0x0000)
struct AutoPlayAgent_FindElementByClass final
{
public:
	TSubclassOf<class UAutoPlayElement>           ElementClass;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAutoPlayElement*                       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayAgent_FindElementByClass;

// Function AutoPlay.AutoPlayAgent.FindMapByClass
// 0x0010 (0x0010 - 0x0000)
struct AutoPlayAgent_FindMapByClass final
{
public:
	TSubclassOf<class UAutoPlayMap>               MapClass;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAutoPlayMap*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayAgent_FindMapByClass;

// Function AutoPlay.AutoPlayAgent.FindSensorByClass
// 0x0010 (0x0010 - 0x0000)
struct AutoPlayAgent_FindSensorByClass final
{
public:
	TSubclassOf<class UAutoPlaySensor>            SensorClass;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAutoPlaySensor*                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayAgent_FindSensorByClass;

// Function AutoPlay.AutoPlayAgent.GetInput
// 0x0008 (0x0008 - 0x0000)
struct AutoPlayAgent_GetInput final
{
public:
	class UAutoPlayInput*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayAgent_GetInput;

// Function AutoPlay.AutoPlayAgent.GetLocalPlayer
// 0x0008 (0x0008 - 0x0000)
struct AutoPlayAgent_GetLocalPlayer final
{
public:
	class ULocalPlayer*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayAgent_GetLocalPlayer;

// Function AutoPlay.AutoPlayAgent.GetPawn
// 0x0008 (0x0008 - 0x0000)
struct AutoPlayAgent_GetPawn final
{
public:
	class APawn*                                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayAgent_GetPawn;

// Function AutoPlay.AutoPlayAgent.GetPlayerController
// 0x0008 (0x0008 - 0x0000)
struct AutoPlayAgent_GetPlayerController final
{
public:
	class APlayerController*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayAgent_GetPlayerController;

// Function AutoPlay.AutoPlayAgent.GetTaskSystem
// 0x0008 (0x0008 - 0x0000)
struct AutoPlayAgent_GetTaskSystem final
{
public:
	class UAutoPlayTaskSystem*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayAgent_GetTaskSystem;

// Function AutoPlay.AsyncActionRunAutoPlayTask.RunAutoPlayTask
// 0x0018 (0x0018 - 0x0000)
struct AsyncActionRunAutoPlayTask_RunAutoPlayTask final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAutoPlayTask*                          Task;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncActionRunAutoPlayTask*            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncActionRunAutoPlayTask_RunAutoPlayTask;

// Function AutoPlay.AutoPlayInput.CancelInput
// 0x0004 (0x0004 - 0x0000)
struct AutoPlayInput_CancelInput final
{
public:
	int32                                         Handle;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayInput_CancelInput;

// Function AutoPlay.AutoPlayInput.InputKey
// 0x0028 (0x0028 - 0x0000)
struct AutoPlayInput_InputKey final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Value;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AutoPlayInput_InputKey;

// Function AutoPlay.AutoPlaySubsystem.DisableAutoPlay
// 0x0008 (0x0008 - 0x0000)
struct AutoPlaySubsystem_DisableAutoPlay final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlaySubsystem_DisableAutoPlay;

// Function AutoPlay.AutoPlaySubsystem.EnableAutoPlay
// 0x0010 (0x0010 - 0x0000)
struct AutoPlaySubsystem_EnableAutoPlay final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAutoPlayAgent*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlaySubsystem_EnableAutoPlay;

// Function AutoPlay.AutoPlaySubsystem.RecordMacro
// 0x0010 (0x0010 - 0x0000)
struct AutoPlaySubsystem_RecordMacro final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlaySubsystem_RecordMacro;

// Function AutoPlay.AutoPlaySubsystem.RunMacro
// 0x0018 (0x0018 - 0x0000)
struct AutoPlaySubsystem_RunMacro final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DetailLevel;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AutoPlaySubsystem_RunMacro;

// Function AutoPlay.AutoPlaySubsystem.RunTask
// 0x0008 (0x0008 - 0x0000)
struct AutoPlaySubsystem_RunTask final
{
public:
	class FName                                   EventName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlaySubsystem_RunTask;

// Function AutoPlay.AutoPlaySubsystem.GetAgent
// 0x0010 (0x0010 - 0x0000)
struct AutoPlaySubsystem_GetAgent final
{
public:
	const class APlayerController*                PlayerController;                                  // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAutoPlayAgent*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlaySubsystem_GetAgent;

// Function AutoPlay.AutoPlayMacroSystem.GetValueAsFloat
// 0x0060 (0x0060 - 0x0000)
struct AutoPlayMacroSystem_GetValueAsFloat final
{
public:
	struct FAutoPlayEventArgs                     Args;                                              // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OutValue;                                          // 0x0058(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x005C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AutoPlayMacroSystem_GetValueAsFloat;

// Function AutoPlay.AutoPlayMacroSystem.GetValueAsObject
// 0x0068 (0x0068 - 0x0000)
struct AutoPlayMacroSystem_GetValueAsObject final
{
public:
	struct FAutoPlayEventArgs                     Args;                                              // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   Name_0;                                            // 0x0050(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                OutValue;                                          // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AutoPlayMacroSystem_GetValueAsObject;

// Function AutoPlay.AutoPlayService.GetOwnerTask
// 0x0008 (0x0008 - 0x0000)
struct AutoPlayService_GetOwnerTask final
{
public:
	class UAutoPlayTask*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayService_GetOwnerTask;

// Function AutoPlay.AutoPlayService_BlueprintBase.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct AutoPlayService_BlueprintBase_ReceiveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayService_BlueprintBase_ReceiveTick;

// Function AutoPlay.AutoPlayTask.AddService
// 0x0010 (0x0010 - 0x0000)
struct AutoPlayTask_AddService final
{
public:
	TSubclassOf<class UAutoPlayService>           ServiceClass;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AutoPlayTask_AddService;

// Function AutoPlay.AutoPlayTask.CreateChildTask
// 0x0010 (0x0010 - 0x0000)
struct AutoPlayTask_CreateChildTask final
{
public:
	TSubclassOf<class UAutoPlayTask>              TaskClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAutoPlayTask*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayTask_CreateChildTask;

// Function AutoPlay.AutoPlayTask.NotifyResult
// 0x0001 (0x0001 - 0x0000)
struct AutoPlayTask_NotifyResult final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayTask_NotifyResult;

// Function AutoPlay.AutoPlayTask.ReceiveInitByEvent
// 0x0058 (0x0058 - 0x0000)
struct AutoPlayTask_ReceiveInitByEvent final
{
public:
	class FName                                   Event;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAutoPlayEventArgs                     Args;                                              // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayTask_ReceiveInitByEvent;

// Function AutoPlay.AutoPlayTask.GetOwnerAgent
// 0x0008 (0x0008 - 0x0000)
struct AutoPlayTask_GetOwnerAgent final
{
public:
	class UAutoPlayAgent*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayTask_GetOwnerAgent;

// Function AutoPlay.AutoPlayTaskSystem.CreateTask
// 0x0018 (0x0018 - 0x0000)
struct AutoPlayTaskSystem_CreateTask final
{
public:
	TSubclassOf<class UAutoPlayTask>              TaskClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                TaskOwner;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAutoPlayTask*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayTaskSystem_CreateTask;

// Function AutoPlay.AutoPlayTask_BlueprintBase.K2_NotifyResult
// 0x0001 (0x0001 - 0x0000)
struct AutoPlayTask_BlueprintBase_K2_NotifyResult final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayTask_BlueprintBase_K2_NotifyResult;

// Function AutoPlay.AutoPlayTask_BlueprintBase.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct AutoPlayTask_BlueprintBase_ReceiveTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayTask_BlueprintBase_ReceiveTick;

// Function AutoPlay.AutoPlayTask_MoveCursor.SetGoalPosition
// 0x0010 (0x0010 - 0x0000)
struct AutoPlayTask_MoveCursor_SetGoalPosition final
{
public:
	struct FVector2D                              Position;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayTask_MoveCursor_SetGoalPosition;

// Function AutoPlay.AutoPlayTask_MoveCursor.SetImmediately
// 0x0001 (0x0001 - 0x0000)
struct AutoPlayTask_MoveCursor_SetImmediately final
{
public:
	bool                                          bInImmediately;                                    // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayTask_MoveCursor_SetImmediately;

// Function AutoPlay.AutoPlayTask_MoveCursor.SetSpeed
// 0x0004 (0x0004 - 0x0000)
struct AutoPlayTask_MoveCursor_SetSpeed final
{
public:
	float                                         InSpeed;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoPlayTask_MoveCursor_SetSpeed;

}

