#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BasicUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "CommonUI_classes.hpp"
#include "BasicUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Class BasicUI.AsyncTileHandler
// 0x0138 (0x0160 - 0x0028)
class UAsyncTileHandler final : public UObject
{
public:
	TWeakObjectPtr<class UCommonLazyImage>        ImageWidget;                                       // 0x0028(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>              TileTexture;                                       // 0x0030(0x0028)(Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         RowNumber;                                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ColumnNumber;                                      // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              TopLeftCoordinate;                                 // 0x0060(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              TileSize;                                          // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                            BrushUnloaded;                                     // 0x0080(0x00D0)(Protected, NativeAccessSpecifierProtected)
	float                                         TileAreaLeft;                                      // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TileAreaRight;                                     // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TileAreaTop;                                       // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TileAreaBottom;                                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTileHandler")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTileHandler")
	}
	static class UAsyncTileHandler* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTileHandler>();
	}
};
DUMPER7_ASSERTS_UAsyncTileHandler;

// Class BasicUI.AsyncTileMap
// 0x0148 (0x0310 - 0x01C8)
class UAsyncTileMap final : public UGridPanel
{
public:
	class FString                                 TileTextureFolderPath;                             // 0x01C8(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 TileTexturePrefix;                                 // 0x01D8(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAsyncTileRow>                  TileRows;                                          // 0x01E8(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         TileRowCount;                                      // 0x01F8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         TileColumnCount;                                   // 0x01FC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              TileSize;                                          // 0x0200(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSlateBrush                            BrushUnloaded;                                     // 0x0210(0x00D0)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                              MapSize;                                           // 0x02E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector2D                              DisplayAreaCenter;                                 // 0x02F0(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector2D                              DisplayAreaSize;                                   // 0x0300(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	bool BuildTileMap();
	void UpdateDisplayArea(const struct FVector2D& InAreaCenter, const struct FVector2D& InAreaSize);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTileMap")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTileMap")
	}
	static class UAsyncTileMap* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTileMap>();
	}
};
DUMPER7_ASSERTS_UAsyncTileMap;

// Class BasicUI.BasicUIFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UBasicUIFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool GetNormalizedMousePositionInGeometry(class UObject* InWorldContextObject, const struct FGeometry& InGeometry, struct FVector2D* OutPosition);
	static bool GetNormalizedPositionInGeometry(class UObject* InWorldContextObject, const struct FGeometry& InGeometry, const struct FVector2D& InPosition, struct FVector2D* OutPosition);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BasicUIFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BasicUIFunctionLibrary")
	}
	static class UBasicUIFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBasicUIFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UBasicUIFunctionLibrary;

// Class BasicUI.UIElementBase
// 0x0058 (0x04C0 - 0x0468)
class UUIElementBase : public UCommonActivatableWidget
{
public:
	class FName                                   FriendlyName;                                      // 0x0468(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Tags;                                              // 0x0470(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  DisplayFlags;                                      // 0x0480(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                          bEnableMouseEvent;                                 // 0x04A0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       ShowAnimation;                                     // 0x04A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       HideAnimation;                                     // 0x04B0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool AddTag(class FName TagName);
	bool ContainsAllTags(const TArray<class FName>& TagList);
	bool ContainsAnyTag(const TArray<class FName>& TagList);
	bool ContainsTag(class FName TagName);
	bool GetCenterCoordinate(struct FVector2D* CenterCoord);
	bool Hide(bool bBackupVisibility);
	bool IsEnableMouseEvent();
	void OnUpdateDisplayFlags(const struct FGameplayTagContainer& InDisplayFlags, bool bPlayAnimation, bool bForced);
	bool PlaySingleAnimation(class UWidgetAnimation* TargetAnimation, float StartAtTime, int32 NumLoopsToPlay, EUMGSequencePlayMode PlayMode, float PlaybackSpeed);
	bool PlaySingleAnimationByName(const class FName AnimationName, float StartAtTime, int32 NumLoopsToPlay, EUMGSequencePlayMode PlayMode, float PlaybackSpeed);
	bool Show(bool bRestoreVisibility);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIElementBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIElementBase")
	}
	static class UUIElementBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIElementBase>();
	}
};
DUMPER7_ASSERTS_UUIElementBase;

// Class BasicUI.MenuBase
// 0x00F8 (0x05B8 - 0x04C0)
class UMenuBase : public UUIElementBase
{
public:
	bool                                          bIsCursorRequired;                                 // 0x04C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoActivateOnOpen;                               // 0x04C1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoDeactivateOnClose;                            // 0x04C2(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C3[0x5];                                      // 0x04C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuContext                           MenuContext;                                       // 0x04C8(0x0038)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	EMenuBasicState                               BasicState;                                        // 0x0500(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_501[0x3];                                      // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MenuMode;                                          // 0x0504(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsAddTagOnOpen;                                   // 0x050C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_50D[0x3];                                      // 0x050D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  PlayerTagsOnOpen;                                  // 0x0510(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  PlayerTagsOnActivate;                              // 0x0530(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                          bFinishReserved;                                   // 0x0550(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_551[0x2F];                                     // 0x0551(0x002F)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NavigationTargetTag;                               // 0x0580(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       OpenAnimation;                                     // 0x0588(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWidgetAnimation*                       CloseAnimation;                                    // 0x0590(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              MenuOpenDelegate;                                  // 0x0598(0x0010)(ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void()>              MenuCloseDelegate;                                 // 0x05A8(0x0010)(ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	void BindMenuCloseEvent(TDelegate<void()> InDelegate);
	void BindMenuOpenEvent(TDelegate<void()> InDelegate);
	void ChangeMenuMode(const class FName& InNextMode);
	void ClearHighlightedMenuPiece(bool bPlayAnimation);
	void ClearNavigationTargetTag();
	void ClearSelectedMenuPiece(bool bPlayAnimation);
	bool Close();
	bool Finish();
	TArray<class UMenuPieceBase*> GetAllPieces();
	class UMenuPieceBase* GetHighlightedMenuPiece();
	const EMenuBasicState GetMenuBasicState();
	const class FName GetMenuMode();
	const class FName GetNavigationTargetsByTag();
	class UMenuPieceBase* GetPieceByName(class FName PieceName);
	TArray<class UMenuPieceBase*> GetPiecesByTag(class FName Tag);
	void OnClosed();
	void OnClosing();
	void OnFinishing();
	class UWidgetAnimation* OnGetCloseAnimation();
	class UWidgetAnimation* OnGetOpenAnimation();
	void OnInputDeviceChanged();
	void OnMenuInitialized();
	void OnMenuModeChanged(const class FName& InNextMode, const class FName& InPreviousMode);
	void OnMenuPieceDeselect(const class UMenuPieceBase* MenuPiece);
	void OnMenuPieceHighlight(const class UMenuPieceBase* MenuPiece);
	void OnMenuPieceSelect(const class UMenuPieceBase* MenuPiece);
	void OnMenuPieceUnhighlight(const class UMenuPieceBase* MenuPiece);
	void OnMouseButtonUpMenu();
	void OnMouseEnterMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeaveMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeftClickMenu();
	void OnMouseLeftClickMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseMiddleClickMenu();
	void OnMouseMiddleClickMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseRightClickMenu();
	void OnMouseRightClickMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseWheelDownMenu(int32 Level);
	void OnMouseWheelDownMenuPiece(class UMenuPieceBase* MenuPiece, int32 Level);
	void OnMouseWheelUpMenu(int32 Level);
	void OnMouseWheelUpMenuPiece(class UMenuPieceBase* MenuPiece, int32 Level);
	void OnOpened();
	void OnOpening();
	void OnUpdateDisplay();
	bool Open(const struct FMenuContext& InContext);
	void RegisterMenuPieceAdditionally(class UMenuPieceBase* MenuPiece);
	void RegisterMenuPieces();
	void SelectNextPieceByDirection(EDirectionKey Direction, bool* bOutIsNextSelectionSuccessful);
	void SetHighlightedMenuPiece(class UMenuPieceBase* MenuPiece, bool bPlayAnimation);
	void SetNavigationTargetsByTag(class FName Tag);
	void SetSelectedMenuPiece(class UMenuPieceBase* MenuPiece, bool bPlayAnimation);
	void UnbindAllMenuCloseEvent();
	void UnbindAllMenuOpenEvent();
	void UnbindMenuCloseEvent(TDelegate<void()> InDelegate);
	void UnbindMenuOpenEvent(TDelegate<void()> InDelegate);

	class UObject* GetCaller() const;
	const int32 GetDisplayPriority() const;
	const struct FMenuContext GetMenuContext() const;
	class UMenuBase* GetParentMenu() const;
	class UMenuPieceBase* GetSelectedMenuPiece() const;
	class UUIObjectBase* GetUIObject() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MenuBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MenuBase")
	}
	static class UMenuBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMenuBase>();
	}
};
DUMPER7_ASSERTS_UMenuBase;

// Class BasicUI.DialogBase
// 0x0068 (0x0620 - 0x05B8)
class UDialogBase : public UMenuBase
{
public:
	TMulticastInlineDelegate<void(uint8 DecideOptionNumber)> DecideDelegate;                         // 0x05B8(0x0010)(ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FDialogInfo                            DialogInfo;                                        // 0x05C8(0x0058)(Protected, NativeAccessSpecifierProtected)

public:
	void BindDialogDecideEvent(TDelegate<void(uint8 DecideOptionNumber)> InDelegate);
	void DecideDialogOption(const uint8 InDialogOption);
	void OnSetDialogInfo(const struct FDialogInfo& InDialogInfo);
	void SetDialogInfo(const struct FDialogInfo& InDialogInfo);
	void SetSelectOption(const uint8 InSelectOption);
	void UnbindDialogDecideEvent(TDelegate<void(uint8 DecideOptionNumber)> InDelegate);

	const struct FDialogInfo GetDialogInfo() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DialogBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DialogBase")
	}
	static class UDialogBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDialogBase>();
	}
};
DUMPER7_ASSERTS_UDialogBase;

// Class BasicUI.FloatHolderInterface
// 0x0000 (0x0000 - 0x0000)
class IFloatHolderInterface final
{
public:
	float GetFloat();
	bool SetFloat(const float Number);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FloatHolderInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FloatHolderInterface")
	}
	static class IFloatHolderInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFloatHolderInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFloatHolderInterface;

// Class BasicUI.EnhancedWidgetSwitcher
// 0x0028 (0x0280 - 0x0258)
class UEnhancedWidgetSwitcher final : public UCommonActivatableWidgetSwitcher
{
public:
	bool                                          bReflectOwningWidgetActiveState;                   // 0x0258(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bControlActivation;                                // 0x0259(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_25A[0x2];                                      // 0x025A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 ChildIndex, class UWidget* ChildWidget)> OnChildWidgetDisappearEvent;       // 0x025C(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TDelegate<void(int32 ChildIndex, class UWidget* ChildWidget)> OnChildWidgetAppearEvent;          // 0x026C(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSwitchingChild;                                   // 0x027C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_27D[0x3];                                      // 0x027D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsSwitchingChildWidget() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnhancedWidgetSwitcher")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnhancedWidgetSwitcher")
	}
	static class UEnhancedWidgetSwitcher* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnhancedWidgetSwitcher>();
	}
};
DUMPER7_ASSERTS_UEnhancedWidgetSwitcher;

// Class BasicUI.GridScroller
// 0x0020 (0x0D20 - 0x0D00)
class UGridScroller final : public UTileView
{
public:
	TSubclassOf<class UScrollerItem>              ScrollerItemClass;                                 // 0x0CF8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TDelegate<void(class UScrollerItem* ItemData, int32 ItemIndex)> OnPopulateScrollerItemEvent;     // 0x0D00(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowBuiltinNavigation;                           // 0x0D10(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_D11[0xF];                                      // 0x0D11(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BuildWidget(int32 ItemCount);
	void ClearList();
	const int32 GetItemCount();
	int32 GetNumItemsPerLine();
	int32 GetNumItemsScrollLine();
	class UObject* GetSelectedItem();
	class UUserWidget* GetSelectedWidget();
	int32 GetSelectionIndex();
	void Reflesh();
	void SelectBackItem();
	void SelectByDirection(EDirectionKey InDirection, bool* bOutIsNextSelectionSuccessful);
	void SelectByIndex(const int32 TargetIndex);
	void SelectNextItem();
	void SetEnableScrollAnimation(bool bInEnableScrollAnimation);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("GridScroller")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GridScroller")
	}
	static class UGridScroller* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGridScroller>();
	}
};
DUMPER7_ASSERTS_UGridScroller;

// Class BasicUI.ListScroller
// 0x0030 (0x0D00 - 0x0CD0)
class UListScroller final : public UListView
{
public:
	TSubclassOf<class UScrollerItem>              ScrollerItemClass;                                 // 0x0CD0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TDelegate<void(class UScrollerItem* ItemData, int32 ItemIndex)> OnPopulateScrollerItemEvent;     // 0x0CD8(0x0010)(Edit, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAllowBuiltinNavigation;                           // 0x0CE8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CE9[0x17];                                     // 0x0CE9(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BuildWidget(const int32 ItemCount);
	void ClearList();
	const int32 GetItemCount();
	class UObject* GetSelectedItem();
	class UUserWidget* GetSelectedWidget();
	int32 GetSelectionIndex();
	void Reflesh();
	void SelectByDirection(EDirectionKey InDirection, bool* bOutIsNextSelectionSuccessful);
	void SelectByIndex(const int32 TargetIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ListScroller")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ListScroller")
	}
	static class UListScroller* GetDefaultObj()
	{
		return GetDefaultObjImpl<UListScroller>();
	}
};
DUMPER7_ASSERTS_UListScroller;

// Class BasicUI.MenuPieceBase
// 0x0108 (0x05C8 - 0x04C0)
class UMenuPieceBase : public UUIElementBase
{
public:
	uint8                                         Pad_4C0[0xE0];                                     // 0x04C0(0x00E0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           FlagNames;                                         // 0x05A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class FName                                   TriggerMode;                                       // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PieceIndex;                                        // 0x05B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsVisuallyEnabledPiece;                           // 0x05BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSelectablePiece;                                // 0x05BD(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsHighlightablePiece;                             // 0x05BE(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsSelectableByMouseHover;                         // 0x05BF(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMouseEventNotifyMenu;                             // 0x05C0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMouseEventNotifyContainer;                        // 0x05C1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bConsumeMouseEvent;                                // 0x05C2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C3[0x5];                                      // 0x05C3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool OnMenuPieceDeselect(bool bPlayAnimation);
	bool OnMenuPieceFlagUpdate(class FName FlagName, bool FlagValue);
	bool OnMenuPieceHighlight(bool bPlayAnimation);
	bool OnMenuPieceSelect(bool bPlayAnimation);
	bool OnMenuPieceUnhighlight(bool bPlayAnimation);
	void OnMouseEnterSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeaveSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeftClickSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseMiddleClickSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseRightClickSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseWheelDownSubPiece(class UMenuPieceBase* MenuPiece, int32 Level);
	void OnMouseWheelUpSubPiece(class UMenuPieceBase* MenuPiece, int32 Level);
	void RegisterSubPieceAdditionally(class UMenuPieceBase* MenuPiece);
	void RegisterSubPieces();

	class UObject* GetCaller() const;
	class UMenuPieceBase* GetContainerPiece() const;
	class UMenuBase* GetOwnerMenu() const;
	class UUIObjectBase* GetUIObject() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MenuPieceBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MenuPieceBase")
	}
	static class UMenuPieceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMenuPieceBase>();
	}
};
DUMPER7_ASSERTS_UMenuPieceBase;

// Class BasicUI.UIManager
// 0x0100 (0x0130 - 0x0030)
class UUIManager : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0xB0];                                      // 0x0030(0x00B0)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUIObjectBase*>                  UIObjectList;                                      // 0x00E0(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  DisplayFlags;                                      // 0x00F0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(TSoftClassPtr<class UClass> UIObjectClass)> UIObjectCreateEventDelegate; // 0x0110(0x0010)(ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)
	TMulticastInlineDelegate<void(TSoftClassPtr<class UClass> UIObjectClass)> UIObjectRemoveEventDelegate; // 0x0120(0x0010)(ZeroConstructor, InstancedReference, Protected, NativeAccessSpecifierProtected)

public:
	static class UUIObjectBase* AddUIObjectBySoftClassPtr(const class UObject* InWorldContextObject, TSoftClassPtr<class UClass> InClassPtr, bool bOpenInstantly);
	static const struct FGameplayTagContainer GetDisplayFlags(const class UObject* InWorldContextObject);
	static void GetMenuLayerPriority(const EMenuLayer Layer, int32* BasePriority, int32* Range);
	static class UUIObjectBase* GetUIObjectByClass(const class UObject* InWorldContextObject, TSubclassOf<class UUIObjectBase> ComponentClass);
	static class UUIObjectBase* GetUIObjectBySoftClassPtr(const class UObject* InWorldContextObject, TSoftClassPtr<class UClass> InClassPtr);
	static bool RemoveUIObjectBySoftClassPtr(const class UObject* InWorldContextObject, TSoftClassPtr<class UClass> InClassPtr);
	static void SetDisplayFlags(const class UObject* InWorldContextObject, const struct FGameplayTagContainer& InDisplayFlags, bool bPlayAnimation, bool bForced);

	void BindUIObjectCreateEvent(TDelegate<void(TSoftClassPtr<class UClass> UIObjectClass)> InDelegate);
	void BindUIObjectRemoveEvent(TDelegate<void(TSoftClassPtr<class UClass> UIObjectClass)> InDelegate);
	void CloseAllMenus(bool InExcludeIndicators);
	bool CloseMenu(const class FName InMenuName);
	class UMenuBase* CreateMenu(const struct FMenuContext& InMenuContext);
	bool FinishMenu(const class FName InGroupName, const class FName InMenuName);
	bool FinishMenuGroup(const class FName InGroupName);
	TArray<class UMenuBase*> GetAllMenus(const EMenuLayer InMenuLayer);
	TArray<class UMenuBase*> GetMenuGroup(const class FName InGroupName);
	class UMenuBase* OpenMenu(const struct FMenuContext& InMenuContext);
	void UnbindUIObjectCreateEvent(TDelegate<void(TSoftClassPtr<class UClass> UIObjectClass)> InDelegate);
	void UnbindUIObjectRemoveEvent(TDelegate<void(TSoftClassPtr<class UClass> UIObjectClass)> InDelegate);

	class UMenuBase* GetMenu(const class FName TargetMenuName) const;
	bool IsMenuClosed(const class FName InMenuName) const;
	bool IsMenuOpen(const class FName InMenuName) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIManager")
	}
	static class UUIManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIManager>();
	}
};
DUMPER7_ASSERTS_UUIManager;

// Class BasicUI.MeterPieceBase
// 0x0020 (0x05E8 - 0x05C8)
class UMeterPieceBase : public UMenuPieceBase
{
public:
	uint8                                         Pad_5C8[0x8];                                      // 0x05C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MeterValue;                                        // 0x05D0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MeterValueStride;                                  // 0x05D4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MeterMaxValue;                                     // 0x05D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MeterMinValue;                                     // 0x05DC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DisplayNormalizeValue;                             // 0x05E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DisplayMultiplier;                                 // 0x05E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnMeterValueChanged(float MeterValueToNotify, float Percentage, float DisplayNumber, bool PlayAnimation_0);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeterPieceBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeterPieceBase")
	}
	static class UMeterPieceBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeterPieceBase>();
	}
};
DUMPER7_ASSERTS_UMeterPieceBase;

// Class BasicUI.ScrollerItem
// 0x0008 (0x0030 - 0x0028)
class UScrollerItem : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 GetElementIndex();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ScrollerItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ScrollerItem")
	}
	static class UScrollerItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScrollerItem>();
	}
};
DUMPER7_ASSERTS_UScrollerItem;

// Class BasicUI.CommunicatorInterface
// 0x0000 (0x0000 - 0x0000)
class ICommunicatorInterface final
{
public:
	bool SendMessage(class UObject* AnotherUI, const class FString& Message);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CommunicatorInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CommunicatorInterface")
	}
	static class ICommunicatorInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICommunicatorInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ICommunicatorInterface;

// Class BasicUI.EnableInterface
// 0x0000 (0x0000 - 0x0000)
class IEnableInterface final
{
public:
	bool Disable();
	bool Enable();
	bool IsEnabled();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnableInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnableInterface")
	}
	static class IEnableInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEnableInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IEnableInterface;

// Class BasicUI.ResetInterface
// 0x0000 (0x0000 - 0x0000)
class IResetInterface final
{
public:
	bool Reset();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ResetInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ResetInterface")
	}
	static class IResetInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IResetInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IResetInterface;

// Class BasicUI.SelectableInterface
// 0x0000 (0x0000 - 0x0000)
class ISelectableInterface final
{
public:
	bool Deselect(bool PlayAnimation);
	bool IsSelectable();
	bool IsSelected();
	bool Select(bool PlayAnimation);
	bool SetSelectProhibited(bool Prohibited);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SelectableInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SelectableInterface")
	}
	static class ISelectableInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ISelectableInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ISelectableInterface;

// Class BasicUI.HighlightableInterface
// 0x0000 (0x0000 - 0x0000)
class IHighlightableInterface final
{
public:
	bool Highlight(bool PlayAnimation);
	bool IsHighlightable();
	bool IsHighlighted();
	bool SetHighlightProhibited(bool Prohibited);
	bool Unhighlight(bool PlayAnimation);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HighlightableInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HighlightableInterface")
	}
	static class IHighlightableInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHighlightableInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IHighlightableInterface;

// Class BasicUI.UIObjectBase
// 0x0038 (0x0060 - 0x0028)
class UUIObjectBase : public UObject
{
public:
	struct FMenuContext                           TopMenuContext;                                    // 0x0028(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	bool Close();
	void Finish();
	bool Open();
	bool OpenWithMenu(const struct FMenuContext& InContext);

	class UMenuBase* GetTopMenu() const;
	bool IsClosed() const;
	bool IsOpen() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIObjectBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIObjectBase")
	}
	static class UUIObjectBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIObjectBase>();
	}
};
DUMPER7_ASSERTS_UUIObjectBase;

// Class BasicUI.MultipleFlagInterface
// 0x0000 (0x0000 - 0x0000)
class IMultipleFlagInterface final
{
public:
	bool GetFlag(class FName FlagName);
	bool SetFlag(class FName FlagName, bool FlagValue, bool bFireEvent);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MultipleFlagInterface")
	}
	static const class FName& StaticName()
	{
