#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BasicUI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BasicUI_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BasicUI.AsyncTileMap.BuildTileMap
// 0x0001 (0x0001 - 0x0000)
struct AsyncTileMap_BuildTileMap final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncTileMap_BuildTileMap;

// Function BasicUI.AsyncTileMap.UpdateDisplayArea
// 0x0020 (0x0020 - 0x0000)
struct AsyncTileMap_UpdateDisplayArea final
{
public:
	struct FVector2D                              InAreaCenter;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              InAreaSize;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncTileMap_UpdateDisplayArea;

// Function BasicUI.BasicUIFunctionLibrary.GetNormalizedMousePositionInGeometry
// 0x0058 (0x0058 - 0x0000)
struct BasicUIFunctionLibrary_GetNormalizedMousePositionInGeometry final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometry                              InGeometry;                                        // 0x0008(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              OutPosition;                                       // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BasicUIFunctionLibrary_GetNormalizedMousePositionInGeometry;

// Function BasicUI.BasicUIFunctionLibrary.GetNormalizedPositionInGeometry
// 0x0068 (0x0068 - 0x0000)
struct BasicUIFunctionLibrary_GetNormalizedPositionInGeometry final
{
public:
	class UObject*                                InWorldContextObject;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGeometry                              InGeometry;                                        // 0x0008(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              InPosition;                                        // 0x0040(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              OutPosition;                                       // 0x0050(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BasicUIFunctionLibrary_GetNormalizedPositionInGeometry;

// Function BasicUI.UIElementBase.AddTag
// 0x000C (0x000C - 0x0000)
struct UIElementBase_AddTag final
{
public:
	class FName                                   TagName;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UIElementBase_AddTag;

// Function BasicUI.UIElementBase.ContainsAllTags
// 0x0018 (0x0018 - 0x0000)
struct UIElementBase_ContainsAllTags final
{
public:
	TArray<class FName>                           TagList;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UIElementBase_ContainsAllTags;

// Function BasicUI.UIElementBase.ContainsAnyTag
// 0x0018 (0x0018 - 0x0000)
struct UIElementBase_ContainsAnyTag final
{
public:
	TArray<class FName>                           TagList;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UIElementBase_ContainsAnyTag;

// Function BasicUI.UIElementBase.ContainsTag
// 0x000C (0x000C - 0x0000)
struct UIElementBase_ContainsTag final
{
public:
	class FName                                   TagName;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UIElementBase_ContainsTag;

// Function BasicUI.UIElementBase.GetCenterCoordinate
// 0x0018 (0x0018 - 0x0000)
struct UIElementBase_GetCenterCoordinate final
{
public:
	struct FVector2D                              CenterCoord;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UIElementBase_GetCenterCoordinate;

// Function BasicUI.UIElementBase.Hide
// 0x0002 (0x0002 - 0x0000)
struct UIElementBase_Hide final
{
public:
	bool                                          bBackupVisibility;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIElementBase_Hide;

// Function BasicUI.UIElementBase.IsEnableMouseEvent
// 0x0001 (0x0001 - 0x0000)
struct UIElementBase_IsEnableMouseEvent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIElementBase_IsEnableMouseEvent;

// Function BasicUI.UIElementBase.OnUpdateDisplayFlags
// 0x0028 (0x0028 - 0x0000)
struct UIElementBase_OnUpdateDisplayFlags final
{
public:
	struct FGameplayTagContainer                  InDisplayFlags;                                    // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
	bool                                          bPlayAnimation;                                    // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForced;                                           // 0x0021(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UIElementBase_OnUpdateDisplayFlags;

// Function BasicUI.UIElementBase.PlaySingleAnimation
// 0x0020 (0x0020 - 0x0000)
struct UIElementBase_PlaySingleAnimation final
{
public:
	class UWidgetAnimation*                       TargetAnimation;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAtTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumLoopsToPlay;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackSpeed;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UIElementBase_PlaySingleAnimation;

// Function BasicUI.UIElementBase.PlaySingleAnimationByName
// 0x001C (0x001C - 0x0000)
struct UIElementBase_PlaySingleAnimationByName final
{
public:
	class FName                                   AnimationName;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartAtTime;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumLoopsToPlay;                                    // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUMGSequencePlayMode                          PlayMode;                                          // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PlaybackSpeed;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UIElementBase_PlaySingleAnimationByName;

// Function BasicUI.UIElementBase.Show
// 0x0002 (0x0002 - 0x0000)
struct UIElementBase_Show final
{
public:
	bool                                          bRestoreVisibility;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIElementBase_Show;

// Function BasicUI.MenuBase.BindMenuCloseEvent
// 0x0010 (0x0010 - 0x0000)
struct MenuBase_BindMenuCloseEvent final
{
public:
	TDelegate<void()>                             InDelegate;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_BindMenuCloseEvent;

// Function BasicUI.MenuBase.BindMenuOpenEvent
// 0x0010 (0x0010 - 0x0000)
struct MenuBase_BindMenuOpenEvent final
{
public:
	TDelegate<void()>                             InDelegate;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_BindMenuOpenEvent;

// Function BasicUI.MenuBase.ChangeMenuMode
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_ChangeMenuMode final
{
public:
	class FName                                   InNextMode;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_ChangeMenuMode;

// Function BasicUI.MenuBase.ClearHighlightedMenuPiece
// 0x0001 (0x0001 - 0x0000)
struct MenuBase_ClearHighlightedMenuPiece final
{
public:
	bool                                          bPlayAnimation;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_ClearHighlightedMenuPiece;

// Function BasicUI.MenuBase.ClearSelectedMenuPiece
// 0x0001 (0x0001 - 0x0000)
struct MenuBase_ClearSelectedMenuPiece final
{
public:
	bool                                          bPlayAnimation;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_ClearSelectedMenuPiece;

// Function BasicUI.MenuBase.Close
// 0x0001 (0x0001 - 0x0000)
struct MenuBase_Close final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_Close;

// Function BasicUI.MenuBase.Finish
// 0x0001 (0x0001 - 0x0000)
struct MenuBase_Finish final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_Finish;

// Function BasicUI.MenuBase.GetAllPieces
// 0x0010 (0x0010 - 0x0000)
struct MenuBase_GetAllPieces final
{
public:
	TArray<class UMenuPieceBase*>                 ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_GetAllPieces;

// Function BasicUI.MenuBase.GetHighlightedMenuPiece
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_GetHighlightedMenuPiece final
{
public:
	class UMenuPieceBase*                         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_GetHighlightedMenuPiece;

// Function BasicUI.MenuBase.GetMenuBasicState
// 0x0001 (0x0001 - 0x0000)
struct MenuBase_GetMenuBasicState final
{
public:
	EMenuBasicState                               ReturnValue;                                       // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_GetMenuBasicState;

// Function BasicUI.MenuBase.GetMenuMode
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_GetMenuMode final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_GetMenuMode;

// Function BasicUI.MenuBase.GetNavigationTargetsByTag
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_GetNavigationTargetsByTag final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_GetNavigationTargetsByTag;

// Function BasicUI.MenuBase.GetPieceByName
// 0x0010 (0x0010 - 0x0000)
struct MenuBase_GetPieceByName final
{
public:
	class FName                                   PieceName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMenuPieceBase*                         ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_GetPieceByName;

// Function BasicUI.MenuBase.GetPiecesByTag
// 0x0018 (0x0018 - 0x0000)
struct MenuBase_GetPiecesByTag final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMenuPieceBase*>                 ReturnValue;                                       // 0x0008(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_GetPiecesByTag;

// Function BasicUI.MenuBase.OnGetCloseAnimation
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_OnGetCloseAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_OnGetCloseAnimation;

// Function BasicUI.MenuBase.OnGetOpenAnimation
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_OnGetOpenAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_OnGetOpenAnimation;

// Function BasicUI.MenuBase.OnMenuModeChanged
// 0x0010 (0x0010 - 0x0000)
struct MenuBase_OnMenuModeChanged final
{
public:
	class FName                                   InNextMode;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InPreviousMode;                                    // 0x0008(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_OnMenuModeChanged;

// Function BasicUI.MenuBase.OnMenuPieceDeselect
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_OnMenuPieceDeselect final
{
public:
	const class UMenuPieceBase*                   MenuPiece;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_OnMenuPieceDeselect;

// Function BasicUI.MenuBase.OnMenuPieceHighlight
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_OnMenuPieceHighlight final
{
public:
	const class UMenuPieceBase*                   MenuPiece;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_OnMenuPieceHighlight;

// Function BasicUI.MenuBase.OnMenuPieceSelect
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_OnMenuPieceSelect final
{
public:
	const class UMenuPieceBase*                   MenuPiece;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_OnMenuPieceSelect;

// Function BasicUI.MenuBase.OnMenuPieceUnhighlight
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_OnMenuPieceUnhighlight final
{
public:
	const class UMenuPieceBase*                   MenuPiece;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_OnMenuPieceUnhighlight;

// Function BasicUI.MenuBase.OnMouseEnterMenuPiece
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_OnMouseEnterMenuPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_OnMouseEnterMenuPiece;

// Function BasicUI.MenuBase.OnMouseLeaveMenuPiece
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_OnMouseLeaveMenuPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_OnMouseLeaveMenuPiece;

// Function BasicUI.MenuBase.OnMouseLeftClickMenuPiece
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_OnMouseLeftClickMenuPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_OnMouseLeftClickMenuPiece;

// Function BasicUI.MenuBase.OnMouseMiddleClickMenuPiece
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_OnMouseMiddleClickMenuPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_OnMouseMiddleClickMenuPiece;

// Function BasicUI.MenuBase.OnMouseRightClickMenuPiece
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_OnMouseRightClickMenuPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_OnMouseRightClickMenuPiece;

// Function BasicUI.MenuBase.OnMouseWheelDownMenu
// 0x0004 (0x0004 - 0x0000)
struct MenuBase_OnMouseWheelDownMenu final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_OnMouseWheelDownMenu;

// Function BasicUI.MenuBase.OnMouseWheelDownMenuPiece
// 0x0010 (0x0010 - 0x0000)
struct MenuBase_OnMouseWheelDownMenuPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MenuBase_OnMouseWheelDownMenuPiece;

// Function BasicUI.MenuBase.OnMouseWheelUpMenu
// 0x0004 (0x0004 - 0x0000)
struct MenuBase_OnMouseWheelUpMenu final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_OnMouseWheelUpMenu;

// Function BasicUI.MenuBase.OnMouseWheelUpMenuPiece
// 0x0010 (0x0010 - 0x0000)
struct MenuBase_OnMouseWheelUpMenuPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MenuBase_OnMouseWheelUpMenuPiece;

// Function BasicUI.MenuBase.Open
// 0x0040 (0x0040 - 0x0000)
struct MenuBase_Open final
{
public:
	struct FMenuContext                           InContext;                                         // 0x0000(0x0038)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MenuBase_Open;

// Function BasicUI.MenuBase.RegisterMenuPieceAdditionally
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_RegisterMenuPieceAdditionally final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_RegisterMenuPieceAdditionally;

// Function BasicUI.MenuBase.SelectNextPieceByDirection
// 0x0002 (0x0002 - 0x0000)
struct MenuBase_SelectNextPieceByDirection final
{
public:
	EDirectionKey                                 Direction;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutIsNextSelectionSuccessful;                     // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_SelectNextPieceByDirection;

// Function BasicUI.MenuBase.SetHighlightedMenuPiece
// 0x0010 (0x0010 - 0x0000)
struct MenuBase_SetHighlightedMenuPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayAnimation;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MenuBase_SetHighlightedMenuPiece;

// Function BasicUI.MenuBase.SetNavigationTargetsByTag
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_SetNavigationTargetsByTag final
{
public:
	class FName                                   Tag;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_SetNavigationTargetsByTag;

// Function BasicUI.MenuBase.SetSelectedMenuPiece
// 0x0010 (0x0010 - 0x0000)
struct MenuBase_SetSelectedMenuPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayAnimation;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MenuBase_SetSelectedMenuPiece;

// Function BasicUI.MenuBase.UnbindMenuCloseEvent
// 0x0010 (0x0010 - 0x0000)
struct MenuBase_UnbindMenuCloseEvent final
{
public:
	TDelegate<void()>                             InDelegate;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_UnbindMenuCloseEvent;

// Function BasicUI.MenuBase.UnbindMenuOpenEvent
// 0x0010 (0x0010 - 0x0000)
struct MenuBase_UnbindMenuOpenEvent final
{
public:
	TDelegate<void()>                             InDelegate;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_UnbindMenuOpenEvent;

// Function BasicUI.MenuBase.GetCaller
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_GetCaller final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_GetCaller;

// Function BasicUI.MenuBase.GetDisplayPriority
// 0x0004 (0x0004 - 0x0000)
struct MenuBase_GetDisplayPriority final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_GetDisplayPriority;

// Function BasicUI.MenuBase.GetMenuContext
// 0x0038 (0x0038 - 0x0000)
struct MenuBase_GetMenuContext final
{
public:
	struct FMenuContext                           ReturnValue;                                       // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_GetMenuContext;

// Function BasicUI.MenuBase.GetParentMenu
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_GetParentMenu final
{
public:
	class UMenuBase*                              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_GetParentMenu;

// Function BasicUI.MenuBase.GetSelectedMenuPiece
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_GetSelectedMenuPiece final
{
public:
	class UMenuPieceBase*                         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_GetSelectedMenuPiece;

// Function BasicUI.MenuBase.GetUIObject
// 0x0008 (0x0008 - 0x0000)
struct MenuBase_GetUIObject final
{
public:
	class UUIObjectBase*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuBase_GetUIObject;

// Function BasicUI.DialogBase.BindDialogDecideEvent
// 0x0010 (0x0010 - 0x0000)
struct DialogBase_BindDialogDecideEvent final
{
public:
	TDelegate<void(uint8 DecideOptionNumber)>     InDelegate;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DialogBase_BindDialogDecideEvent;

// Function BasicUI.DialogBase.DecideDialogOption
// 0x0001 (0x0001 - 0x0000)
struct DialogBase_DecideDialogOption final
{
public:
	uint8                                         InDialogOption;                                    // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DialogBase_DecideDialogOption;

// Function BasicUI.DialogBase.OnSetDialogInfo
// 0x0058 (0x0058 - 0x0000)
struct DialogBase_OnSetDialogInfo final
{
public:
	struct FDialogInfo                            InDialogInfo;                                      // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DialogBase_OnSetDialogInfo;

// Function BasicUI.DialogBase.SetDialogInfo
// 0x0058 (0x0058 - 0x0000)
struct DialogBase_SetDialogInfo final
{
public:
	struct FDialogInfo                            InDialogInfo;                                      // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DialogBase_SetDialogInfo;

// Function BasicUI.DialogBase.SetSelectOption
// 0x0001 (0x0001 - 0x0000)
struct DialogBase_SetSelectOption final
{
public:
	uint8                                         InSelectOption;                                    // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DialogBase_SetSelectOption;

// Function BasicUI.DialogBase.UnbindDialogDecideEvent
// 0x0010 (0x0010 - 0x0000)
struct DialogBase_UnbindDialogDecideEvent final
{
public:
	TDelegate<void(uint8 DecideOptionNumber)>     InDelegate;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DialogBase_UnbindDialogDecideEvent;

// Function BasicUI.DialogBase.GetDialogInfo
// 0x0058 (0x0058 - 0x0000)
struct DialogBase_GetDialogInfo final
{
public:
	struct FDialogInfo                            ReturnValue;                                       // 0x0000(0x0058)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DialogBase_GetDialogInfo;

// Function BasicUI.FloatHolderInterface.GetFloat
// 0x0004 (0x0004 - 0x0000)
struct FloatHolderInterface_GetFloat final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FloatHolderInterface_GetFloat;

// Function BasicUI.FloatHolderInterface.SetFloat
// 0x0008 (0x0008 - 0x0000)
struct FloatHolderInterface_SetFloat final
{
public:
	float                                         Number;                                            // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FloatHolderInterface_SetFloat;

// Function BasicUI.EnhancedWidgetSwitcher.IsSwitchingChildWidget
// 0x0001 (0x0001 - 0x0000)
struct EnhancedWidgetSwitcher_IsSwitchingChildWidget final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EnhancedWidgetSwitcher_IsSwitchingChildWidget;

// Function BasicUI.GridScroller.BuildWidget
// 0x0004 (0x0004 - 0x0000)
struct GridScroller_BuildWidget final
{
public:
	int32                                         ItemCount;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GridScroller_BuildWidget;

// Function BasicUI.GridScroller.GetItemCount
// 0x0004 (0x0004 - 0x0000)
struct GridScroller_GetItemCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GridScroller_GetItemCount;

// Function BasicUI.GridScroller.GetNumItemsPerLine
// 0x0004 (0x0004 - 0x0000)
struct GridScroller_GetNumItemsPerLine final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GridScroller_GetNumItemsPerLine;

// Function BasicUI.GridScroller.GetNumItemsScrollLine
// 0x0004 (0x0004 - 0x0000)
struct GridScroller_GetNumItemsScrollLine final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GridScroller_GetNumItemsScrollLine;

// Function BasicUI.GridScroller.GetSelectedItem
// 0x0008 (0x0008 - 0x0000)
struct GridScroller_GetSelectedItem final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GridScroller_GetSelectedItem;

// Function BasicUI.GridScroller.GetSelectedWidget
// 0x0008 (0x0008 - 0x0000)
struct GridScroller_GetSelectedWidget final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GridScroller_GetSelectedWidget;

// Function BasicUI.GridScroller.GetSelectionIndex
// 0x0004 (0x0004 - 0x0000)
struct GridScroller_GetSelectionIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GridScroller_GetSelectionIndex;

// Function BasicUI.GridScroller.SelectByDirection
// 0x0002 (0x0002 - 0x0000)
struct GridScroller_SelectByDirection final
{
public:
	EDirectionKey                                 InDirection;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutIsNextSelectionSuccessful;                     // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GridScroller_SelectByDirection;

// Function BasicUI.GridScroller.SelectByIndex
// 0x0004 (0x0004 - 0x0000)
struct GridScroller_SelectByIndex final
{
public:
	int32                                         TargetIndex;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GridScroller_SelectByIndex;

// Function BasicUI.GridScroller.SetEnableScrollAnimation
// 0x0001 (0x0001 - 0x0000)
struct GridScroller_SetEnableScrollAnimation final
{
public:
	bool                                          bInEnableScrollAnimation;                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GridScroller_SetEnableScrollAnimation;

// Function BasicUI.ListScroller.BuildWidget
// 0x0004 (0x0004 - 0x0000)
struct ListScroller_BuildWidget final
{
public:
	int32                                         ItemCount;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ListScroller_BuildWidget;

// Function BasicUI.ListScroller.GetItemCount
// 0x0004 (0x0004 - 0x0000)
struct ListScroller_GetItemCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ListScroller_GetItemCount;

// Function BasicUI.ListScroller.GetSelectedItem
// 0x0008 (0x0008 - 0x0000)
struct ListScroller_GetSelectedItem final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ListScroller_GetSelectedItem;

// Function BasicUI.ListScroller.GetSelectedWidget
// 0x0008 (0x0008 - 0x0000)
struct ListScroller_GetSelectedWidget final
{
public:
	class UUserWidget*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ListScroller_GetSelectedWidget;

// Function BasicUI.ListScroller.GetSelectionIndex
// 0x0004 (0x0004 - 0x0000)
struct ListScroller_GetSelectionIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ListScroller_GetSelectionIndex;

// Function BasicUI.ListScroller.SelectByDirection
// 0x0002 (0x0002 - 0x0000)
struct ListScroller_SelectByDirection final
{
public:
	EDirectionKey                                 InDirection;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOutIsNextSelectionSuccessful;                     // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ListScroller_SelectByDirection;

// Function BasicUI.ListScroller.SelectByIndex
// 0x0004 (0x0004 - 0x0000)
struct ListScroller_SelectByIndex final
{
public:
	int32                                         TargetIndex;                                       // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ListScroller_SelectByIndex;

// Function BasicUI.MenuPieceBase.OnMenuPieceDeselect
// 0x0002 (0x0002 - 0x0000)
struct MenuPieceBase_OnMenuPieceDeselect final
{
public:
	bool                                          bPlayAnimation;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuPieceBase_OnMenuPieceDeselect;

// Function BasicUI.MenuPieceBase.OnMenuPieceFlagUpdate
// 0x000C (0x000C - 0x0000)
struct MenuPieceBase_OnMenuPieceFlagUpdate final
{
public:
	class FName                                   FlagName;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          FlagValue;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MenuPieceBase_OnMenuPieceFlagUpdate;

// Function BasicUI.MenuPieceBase.OnMenuPieceHighlight
// 0x0002 (0x0002 - 0x0000)
struct MenuPieceBase_OnMenuPieceHighlight final
{
public:
	bool                                          bPlayAnimation;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuPieceBase_OnMenuPieceHighlight;

// Function BasicUI.MenuPieceBase.OnMenuPieceSelect
// 0x0002 (0x0002 - 0x0000)
struct MenuPieceBase_OnMenuPieceSelect final
{
public:
	bool                                          bPlayAnimation;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuPieceBase_OnMenuPieceSelect;

// Function BasicUI.MenuPieceBase.OnMenuPieceUnhighlight
// 0x0002 (0x0002 - 0x0000)
struct MenuPieceBase_OnMenuPieceUnhighlight final
{
public:
	bool                                          bPlayAnimation;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuPieceBase_OnMenuPieceUnhighlight;

// Function BasicUI.MenuPieceBase.OnMouseEnterSubPiece
// 0x0008 (0x0008 - 0x0000)
struct MenuPieceBase_OnMouseEnterSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuPieceBase_OnMouseEnterSubPiece;

// Function BasicUI.MenuPieceBase.OnMouseLeaveSubPiece
// 0x0008 (0x0008 - 0x0000)
struct MenuPieceBase_OnMouseLeaveSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuPieceBase_OnMouseLeaveSubPiece;

// Function BasicUI.MenuPieceBase.OnMouseLeftClickSubPiece
// 0x0008 (0x0008 - 0x0000)
struct MenuPieceBase_OnMouseLeftClickSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuPieceBase_OnMouseLeftClickSubPiece;

// Function BasicUI.MenuPieceBase.OnMouseMiddleClickSubPiece
// 0x0008 (0x0008 - 0x0000)
struct MenuPieceBase_OnMouseMiddleClickSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuPieceBase_OnMouseMiddleClickSubPiece;

// Function BasicUI.MenuPieceBase.OnMouseRightClickSubPiece
// 0x0008 (0x0008 - 0x0000)
struct MenuPieceBase_OnMouseRightClickSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuPieceBase_OnMouseRightClickSubPiece;

// Function BasicUI.MenuPieceBase.OnMouseWheelDownSubPiece
// 0x0010 (0x0010 - 0x0000)
struct MenuPieceBase_OnMouseWheelDownSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MenuPieceBase_OnMouseWheelDownSubPiece;

// Function BasicUI.MenuPieceBase.OnMouseWheelUpSubPiece
// 0x0010 (0x0010 - 0x0000)
struct MenuPieceBase_OnMouseWheelUpSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Level;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MenuPieceBase_OnMouseWheelUpSubPiece;

// Function BasicUI.MenuPieceBase.RegisterSubPieceAdditionally
// 0x0008 (0x0008 - 0x0000)
struct MenuPieceBase_RegisterSubPieceAdditionally final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuPieceBase_RegisterSubPieceAdditionally;

// Function BasicUI.MenuPieceBase.GetCaller
// 0x0008 (0x0008 - 0x0000)
struct MenuPieceBase_GetCaller final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuPieceBase_GetCaller;

// Function BasicUI.MenuPieceBase.GetContainerPiece
// 0x0008 (0x0008 - 0x0000)
struct MenuPieceBase_GetContainerPiece final
{
public:
	class UMenuPieceBase*                         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuPieceBase_GetContainerPiece;

// Function BasicUI.MenuPieceBase.GetOwnerMenu
// 0x0008 (0x0008 - 0x0000)
struct MenuPieceBase_GetOwnerMenu final
{
public:
	class UMenuBase*                              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuPieceBase_GetOwnerMenu;

// Function BasicUI.MenuPieceBase.GetUIObject
// 0x0008 (0x0008 - 0x0000)
struct MenuPieceBase_GetUIObject final
{
public:
	class UUIObjectBase*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MenuPieceBase_GetUIObject;

// Function BasicUI.UIManager.AddUIObjectBySoftClassPtr
// 0x0040 (0x0040 - 0x0000)
struct UIManager_AddUIObjectBySoftClassPtr final
{
public:
	const class UObject*                          InWorldContextObject;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UClass>                   InClassPtr;                                        // 0x0008(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOpenInstantly;                                    // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIObjectBase*                          ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIManager_AddUIObjectBySoftClassPtr;

// Function BasicUI.UIManager.GetDisplayFlags
// 0x0028 (0x0028 - 0x0000)
struct UIManager_GetDisplayFlags final
{
public:
	const class UObject*                          InWorldContextObject;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIManager_GetDisplayFlags;

// Function BasicUI.UIManager.GetMenuLayerPriority
// 0x000C (0x000C - 0x0000)
struct UIManager_GetMenuLayerPriority final
{
public:
	EMenuLayer                                    Layer;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BasePriority;                                      // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Range;                                             // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIManager_GetMenuLayerPriority;

// Function BasicUI.UIManager.GetUIObjectByClass
// 0x0018 (0x0018 - 0x0000)
struct UIManager_GetUIObjectByClass final
{
public:
	const class UObject*                          InWorldContextObject;                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
