#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BFL_UserInterfaceUtility

#include "Basic.hpp"

#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function BFL_UserInterfaceUtility.BFL_UserInterfaceUtility_C.GetInvalidSaveSlotDialogText
// 0x00D8 (0x00D8 - 0x0000)
struct BFL_UserInterfaceUtility_C_GetInvalidSaveSlotDialogText final
{
public:
	EUISaveDataStatus                             InSlotStatus;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   StatusText;                                        // 0x0010(0x0010)(Parm, OutParm)
	TMap<EUISaveDataStatus, class FText>          InvalidSlotTextTable;                              // 0x0020(0x0050)(Edit, BlueprintVisible)
	TMap<EUISaveDataStatus, class FText>          K2Node_MakeVariable_MakeVariableOutput;            // 0x0070(0x0050)()
	class FText                                   CallFunc_Map_Find_Value;                           // 0x00C0(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BFL_UserInterfaceUtility_C_GetInvalidSaveSlotDialogText;

// Function BFL_UserInterfaceUtility.BFL_UserInterfaceUtility_C.GetDLCName
// 0x00D8 (0x00D8 - 0x0000)
struct BFL_UserInterfaceUtility_C_GetDLCName final
{
public:
	EDLCType                                      InDLCType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x0010(0x0010)(Parm, OutParm)
	TMap<EDLCType, class FText>                   DLCNameTable;                                      // 0x0020(0x0050)(Edit, BlueprintVisible)
	TMap<EDLCType, class FText>                   K2Node_MakeVariable_MakeVariableOutput;            // 0x0070(0x0050)()
	class FText                                   CallFunc_Map_Find_Value;                           // 0x00C0(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BFL_UserInterfaceUtility_C_GetDLCName;

}

