#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BloodFeedComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BloodFeedComponent.BP_BloodFeedComponent_C
// 0x0030 (0x0108 - 0x00D8)
class UBP_BloodFeedComponent_C final : public UBloodFeedEffectComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraSystem*                         BloodFeedEffect_Hit;                               // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         BloodFeedEffect_Scar;                              // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnd;                                              // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bProcess;                                          // 0x00F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UNiagaraComponent*>              NiagaraArray;                                      // 0x00F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void Execute();
	void ExecuteUbergraph_BP_BloodFeedComponent(int32 EntryPoint);
	void IsCutScenePlaying(bool* Result);
	void OnEnd(const struct FVector& Position);
	void OnTick(double DeltaSconds);
	void ReceiveBeginPlay();
	void ReceiveParticleData(const TArray<struct FBasicParticleData>& Data, class UNiagaraSystem* NiagaraSystem, const struct FVector& SimulationPositionOffset);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BloodFeedComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BloodFeedComponent_C")
	}
	static class UBP_BloodFeedComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_BloodFeedComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_BloodFeedComponent_C;

}

