#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BleedingAmountBullet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BleedingAmountBullet.BP_BleedingAmountBullet_C
// 0x0350 (0x15C0 - 0x1270)
class ABP_BleedingAmountBullet_C final : public AProjectileBullet
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        MiddleBleedingAmount;                              // 0x1278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HighBleedingAmount;                                // 0x1280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1288[0x8];                                     // 0x1288(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBulletSpawnInfo                       SmallLauncherParameter;                            // 0x1290(0x0110)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FBulletSpawnInfo                       MiddleLauncherParameter;                           // 0x13A0(0x0110)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FBulletSpawnInfo                       HighLauncherParameter;                             // 0x14B0(0x0110)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BP_BleedingAmountBullet(int32 EntryPoint);
	void OnCharacterHit(const struct FAttackCollisionResult& InHitResult);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BleedingAmountBullet_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BleedingAmountBullet_C")
	}
	static class ABP_BleedingAmountBullet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BleedingAmountBullet_C>();
	}
};
DUMPER7_ASSERTS_ABP_BleedingAmountBullet_C;

}

