#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BleedingAmountBullet

#include "Basic.hpp"

#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function BP_BleedingAmountBullet.BP_BleedingAmountBullet_C.ExecuteUbergraph_BP_BleedingAmountBullet
// 0x0004 (0x0004 - 0x0000)
struct BP_BleedingAmountBullet_C_ExecuteUbergraph_BP_BleedingAmountBullet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BleedingAmountBullet_C_ExecuteUbergraph_BP_BleedingAmountBullet;

// Function BP_BleedingAmountBullet.BP_BleedingAmountBullet_C.OnCharacterHit
// 0x01D0 (0x01D0 - 0x0000)
struct BP_BleedingAmountBullet_C_OnCharacterHit final
{
public:
	struct FAttackCollisionResult                 InHitResult;                                       // 0x0000(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x01B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B2[0x6];                                      // 0x01B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast;         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Less_DoubleDouble_A_ImplicitCast_1;       // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_BleedingAmountBullet_C_OnCharacterHit;

}

