#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConfigKeyAssignButtonEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "InputCore_structs.hpp"
#include "Extensions_structs.hpp"
#include "BP_ConfigKeyAssignEntryBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ConfigKeyAssignButtonEntry.BP_ConfigKeyAssignButtonEntry_C
// 0x0100 (0x01A8 - 0x00A8)
class UBP_ConfigKeyAssignButtonEntry_C final : public UBP_ConfigKeyAssignEntryBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_ConfigKeyAssignButtonEntry_C;    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FKey>                           DefaultGamePadKeyList;                             // 0x00B0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<struct FKey>                           DefaultKeyboardKeyList_Main;                       // 0x00C0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<struct FKey>                           DefaultKeyboardKeyList_Sub;                        // 0x00D0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<struct FKey>                           EditGamePadKeyList;                                // 0x00E0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<struct FKey>                           EditKeyboardKeyList_Main;                          // 0x00F0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<struct FKey>                           EditKeyboardKeyList_Sub;                           // 0x0100(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<struct FKey>                           ApplyGamePadKeyList;                               // 0x0110(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FKey>                           ApplyKeyboardKeyList_Main;                         // 0x0120(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FKey>                           ApplyKeyboardKeyList_Sub;                          // 0x0130(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           InputActionTag;                                    // 0x0140(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                   InputActionName;                                   // 0x0148(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          bIsTriggerAxisKey;                                 // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsDuplicationGamepad;                             // 0x0159(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDuplicationKeyboard_Main;                       // 0x015A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDuplicationKeyboard_Sub;                        // 0x015B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DescriptionText;                                   // 0x0160(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	TSoftObjectPtr<class UTexture2D>              DescriptionTexture;                                // 0x0170(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 DescriptionMoviePath;                              // 0x0198(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UpdateDisplay();
	void SetSelectKeyType(EConfigKeyType InKeyType);
	void SetIsDuplication(bool InIsDuplication, EConfigKeyType InKeyType);
	void SetEditKeyAssign(const TArray<struct FKey>& InKey, EConfigKeyType InKeyType);
	void SetDeselectKeyType();
	void OnKeyTypeChange(EConfigKeyType InKeyType);
	void Initialize();
	void GetItemName(class FText* OutInputActionName);
	void GetIsTriggerAxis(bool* OutIsTriggerAxis);
	void GetIsDuplication(EConfigKeyType InKeyType, bool* OutIsDuplication);
	void GetInputActionTag(struct FGameplayTag* OutTag);
	void GetEditKeyByKeyType(EConfigKeyType InKeyType, TArray<struct FKey>* OutKey);
	void GetEditKey(TArray<struct FKey>* InGamePadKey, TArray<struct FKey>* InKeyboardKey_Main, TArray<struct FKey>* InKeyboardKey_Sub);
	void GetDescriptionTexture(TSoftObjectPtr<class UTexture2D>* OutTexture, bool* OutIsValid);
	void GetDescriptionText(class FText* OutText);
	void GetDescriptionMoviePath(class FString* OutPath, bool* OutIsValid);
	void GetAssignEnableType(EConfigKeyAssignEnableType* OutFlag);
	void GetApplyKeyByKeyType(EConfigKeyType InKeyType, TArray<struct FKey>* OutKey);
	void GetApplyKey(TArray<struct FKey>* InGamePadKey, TArray<struct FKey>* InKeyboardKey_Main, TArray<struct FKey>* InKeyboardKey_Sub);
	void ExecuteUbergraph_BP_ConfigKeyAssignButtonEntry(int32 EntryPoint);
	void ClearKey(EConfigKeyType InKeyType, bool* IsSuccess);
	void CheckKeyMatch(TArray<struct FKey>& InKey1, TArray<struct FKey>& InKey2, bool* OutIsMatch);
	void CheckIsKeyDefault(bool* OutIsKeyDefault);
	void CheckIsKeyApply(bool* OutIsKeyApply);
	void ChangeShoulderToTriggerAxis(TArray<struct FKey>& InKeys);
	void ApplyKey();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ConfigKeyAssignButtonEntry_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ConfigKeyAssignButtonEntry_C")
	}
	static class UBP_ConfigKeyAssignButtonEntry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ConfigKeyAssignButtonEntry_C>();
	}
};
DUMPER7_ASSERTS_UBP_ConfigKeyAssignButtonEntry_C;

}

