#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharacterVisualControl_Implement

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "E_CharacterVisualControl_CharacterMode_structs.hpp"
#include "STR_BodyTrailEffectData_structs.hpp"
#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CharacterVisualControl_Implement.BP_CharacterVisualControl_Implement_C
// 0x0338 (0x0360 - 0x0028)
class UBP_CharacterVisualControl_Implement_C final : public UAppWorldObject
{
public:
	class UNiagaraSystem*                         VanishBodyEffect_Asset;                            // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_VanishBodyEffect_C*                 VanishBodyEffect;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_VanishBodyEffect_C*>         VanishWeaponEffectArray;                           // 0x0038(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCharacterVisualControlComponent*       CharacterVisualControl;                            // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMap<class FName, class UMeshComponent*>      OtherMeshMap;                                      // 0x0050(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UBP_VanishBodyEffect_C*>         VanishOtherEffectArray;                            // 0x00A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bUseEyeLight_Off;                                  // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEyeLight_Off;                                     // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        EyeLight_Off_Time;                                 // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EyeLight_Off_TimeRange;                            // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Vanish_Center_World;                               // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         VanishWeaponEffect_Asset;                          // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         VanishOtherEffect_Asset_SK;                        // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         VanishOtherEffect_Asset_SM;                        // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      SummonEffect;                                      // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      UnsummonEffect;                                    // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bBodyTrailEffect;                                  // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         BodyTrailEffect_FrameCount;                        // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              BodyTrailEffectArray;                              // 0x0100(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UNiagaraSystem*                         BodyTrailEffectAsset;                              // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         BodyTrailPoseableMesh_MaxCount;                    // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BodyTrailPoseableMesh_FrameStep;                   // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BodyTrailPoseableMesh_Lifetime;                    // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           BodyTrailCustomizePartNameArray;                   // 0x0128(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSTR_BodyTrailEffectData>       BodyTrailPoseableMeshDataArray;                    // 0x0138(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         BodyTrailPoseableMesh_CurrentIndex;                // 0x0148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BodyTrailPoseableMesh_ResetIndex;                  // 0x014C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BodyTrailPoseableMesh_ParameterName;               // 0x0150(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BodyTrailPoseableMesh_End;                         // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         VanishDeathEffect_Asset;                           // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UEffectData*                            EffectData;                                        // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bVanishDeathState;                                 // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WarpEffect_Active;                                 // 0x0171(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_172[0x6];                                      // 0x0172(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        WarpEffect_Total_Duration;                         // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WarpEffect_VanishTime;                             // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WarpEffect_AppearTime;                             // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WarpEffect_CurrentTime;                            // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WarpEffect_IsAppear;                               // 0x0198(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         InvaderWaveEffect_Asset;                           // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bSlowEffect;                                       // 0x01A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSlowEffect_EndNotice;                             // 0x01A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      SlowEffect_Loop;                                   // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        SlowEffect_Time;                                   // 0x01B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            SlowEffect_EndNoticeWeight;                        // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         SlowEffectAsset_Loop;                              // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         SlowEffectAsset_End;                               // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   SlowEffect_SocketName;                             // 0x01D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SlowEffect_EffectSize;                             // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SoulBody_Active;                                   // 0x01E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SoulBody_TotalDuration;                            // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SoulBody_CurrentTime;                              // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_CharacterVisualControl_CharacterMode        SoulBody_CharacterMode;                            // 0x0200(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     SoulBody_WeightCurve;                              // 0x0208(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              OnVanishBody_EffectFinished;                       // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        VanishMaterialParameter_VanishActorSize;           // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VanishMaterialParameter_VanishCenter;              // 0x02A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_VanishActorSize;                              // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_VanishCenter;                                 // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSet<class UNiagaraComponent*>                WarpEffect_ChildEffectSet;                         // 0x02D0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          BodyTrailPoseableMesh_UseColor;                    // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           BodyTrailPoseableMesh_EmissiveColorBegin;          // 0x0324(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BodyTrailPoseableMesh_EmissiveColorEnd;            // 0x0334(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BodyTrailPoseableMesh_EmiisveScale;                // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         WarpEffect_VanishEffect_Asset;                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         WarpEffect_AppearEffect_Asset;                     // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddOtherMesh(const class FName& MeshName, class UMeshComponent* Mesh);
	void AppearBody_Implement(double TotalDuration, bool bWeapon, bool Other, E_CharacterVisualControl_CharacterMode Mode, bool EnableEffect);
	void AppearBody_Process(double TotalDuration, bool bWeapon, bool Other, E_CharacterVisualControl_CharacterMode Mode, bool EnableEffect);
	void BeginBodyTrailEffect();
	void BodyTrailEffect_CheckRemainMeshZero(bool* Result);
	void BodyTrailEffect_CreatePoseableMesh();
	void BodyTrailEffect_CreatePoseableMesh_Element(class USkeletalMeshComponent* Mesh, class UPoseableMeshComponent** PoseableMesh);
	void BodyTrailEffect_Destroy();
	void BodyTrailEffect_DestroyPoseableMesh();
	void BodyTrailEffect_Initialize();
	void BodyTrailEffect_SetANSParameter(const class UANS_BodyTrailEffect_C* BodyTrailEffect);
	void BodyTrailEffect_SetEffect(class UNiagaraSystem* BodyTrailAsset);
	void BodyTrailEffect_SetMaterialParameter(const struct FSTR_BodyTrailEffectData& BodyTrailEffectData, double Value);
	void CheckOtherMesh(class UMeshComponent* Mesh, bool* Result);
	void CheckValidEffectMesh(bool* bResult);
	void ClearAllOtherMesh();
	void Destroy();
	void EndBodyTrailEffect();
	void FindOtherMesh(const class FName Name_0, class UMeshComponent** Mesh, bool* Result);
	void GeneralWarpEffect_Begin(double VanishTime);
	void GeneralWarpEffect_End(double AppearTime);
	void GetAllOtherMesh(TArray<class UMeshComponent*>* Result);
	void Initialize();
	void InitializeDynamicMaterialInstance(class UMeshComponent* Mesh);
	void InitializeEyeLight_Off();
	void InitializeVanishBody();
	void InitializeVanishOhter(bool VanishDeath);
	void InitializeVanishWeapon();
	void OnChangeCharacterMesh();
	void OnDying();
	void OnEdgeEmissive_SetParameter(class UMeshComponent* Mesh, const struct FEdgeEmissive_Parameter& Parameter, float Weight);
	void OnEdgeEmissiveBegin(class UAnimSequenceBase* InAnimSequence, const struct FEdgeEmissive_Parameter& InParameter, float InTotalDuration);
	void OnEdgeEmissiveEnd(class UAnimSequenceBase* InAnimSequence, const struct FEdgeEmissive_Parameter& InParameter);
	void OnEdgeEmissiveTick(class UAnimSequenceBase* InAnimSequence, const struct FEdgeEmissive_Parameter& InParameter, float InDeltaTime);
	void OnEyeLightTick(double DeltaSeconds);
	bool OnSimpleAnimNotify_Begin(class UObject* InAnimNotifyObject, class UAnimSequenceBase* InAnimSequence, const class FName& InMessage, float InTotalDuration);
	bool OnSimpleAnimNotify_End(class UObject* InAnimNotifyObject, class UAnimSequenceBase* InAnimSequence, const class FName& InMessage);
	bool OnSimpleAnimNotify_Tick(class UObject* InAnimNotifyObject, class UAnimSequenceBase* InAnimSequence, const class FName& InMessage, float InDeltaTime);
	void OnSlowEffectBegin(double EffectSize);
	void OnSlowEffectEnd();
	void OnSlowEffectEndNotice();
	void OnSlowEffectTick(double DeltaSeconds);
	void OnSummonTick(double DeltaSeconds);
	void OnTick(double DeltaSeconds);
	void OnVanishBegin(const struct FVanish_Parameter& Parameter, double TotalDuration);
	void OnVanishBegin_MeshType(const struct FVanish_Parameter& Parameter, double TotalDuration);
	void OnVanishBodyTick(double DeltaSeconds);
	void OnVanishEnd(const struct FVanish_Parameter& Parameter);
	void OnVanishEnd_MeshType(const struct FVanish_Parameter& Parameter);
	void OnVanishTick(const struct FVanish_Parameter& Parameter, double DeltaSeconds);
	void ResetAppearBody_Implement(E_CharacterVisualControl_CharacterMode Mode, bool Weapon);
	void ResetCharacterMaterial();
	void ResetOtherMeshMaterial();
	void ResetVanishBody_Implement(E_CharacterVisualControl_CharacterMode Mode, bool Weapon);
	void ResetVanishBody_Process(bool Reverse, bool VanishDeath, E_CharacterVisualControl_CharacterMode Mode, bool Weapon, bool Other, bool EnableEffect);
	void ResetVanishDeath_Implement(bool Reverse, E_CharacterVisualControl_CharacterMode Mode);
	void ResetVanishOhter_Implement(bool bReverse, bool VanishDeath, E_CharacterVisualControl_CharacterMode Mode, bool EnableEffect);
	void ResetVanishWeapon_Implement(bool bReverse, int32 WeaponIndex, E_CharacterVisualControl_CharacterMode Mode, bool EnableEffect);
	void ResetVanishWeight(bool Character, bool Weapon, bool Other);
	void ResetVanishWeight_Mesh(class UMeshComponent* Mesh);
	void ResetWeaponMaterial();
	void SetEyeLight_Off();
	void SetSoulBodyEffect_Implement(double Weight, E_CharacterVisualControl_CharacterMode Mode);
	void SetSoulBodyEffect_Mesh(class UMeshComponent* Mesh, float Weight, E_CharacterVisualControl_CharacterMode Mode);
	void SetUseEyeLight_Off(bool bUseEyeLight_Off_0);
	void SetVanishBodyMode(class UBP_VanishBodyEffect_C*& BodyEffect, E_CharacterVisualControl_CharacterMode Mode, bool bVanishDeath, bool EnableEffect);
	void SetVisibilityMesh(bool bVisibility, bool bCharacter, bool bWeapon, bool bOther);
	void SetVisiblityMaterialElement(class USkinnedMeshComponent* Meah, class FName MaterialElementName, bool bVisible);
	void SlowEffect_SetMaterialParameter(float Weight);
	void SoulBody_Begin(double TotalDuration, E_CharacterVisualControl_CharacterMode CharacterMode);
	void SoulBody_End();
	void SoulBody_Tick(double DeltaSeconds);
	void SummonBody();
	void TickBodyTrailEffect(double DeltaSeconds);
	void UnsummonBody();
	void VanishBody_End(bool bWeapon, bool Other);
	void VanishBody_Implement(double TotalDuration, bool bWeapon, bool Other, E_CharacterVisualControl_CharacterMode Mode, bool EnableEffect);
	void VanishBody_OnFinishEvent();
	void VanishBody_Process(double TotalDuration, bool bWeapon, bool Other, bool bDeath, E_CharacterVisualControl_CharacterMode Mode, bool EnableEffect);
	void VanishBody_SetVanishCenterWorld(bool bVanishCenterWorld);
	void VanishDeath_Implement(double TotalDuration, bool bWeapon, bool Other, bool EnableEffect);
	void VanishMaterialParameter_Begin(const class UANS_VanishMaterialParameter_C* ANS);
	void VanishMaterialParameter_End(const class UANS_VanishMaterialParameter_C* ANS);
	void VanishMaterialParameter_SetParameter(E_ANS_MeshType MeshType, bool bUseVanishActorSize, double VanishActorSize, bool bUseVanishCenter, const struct FVector& VanishCenter);
	void VanishOhter_End();
	void VanishOhter_Implement(bool bReverse, double Duration, bool VanishDeath, E_CharacterVisualControl_CharacterMode Mode, bool EnableEffect);
	void VanishWeapon_End();
	void VanishWeapon_Implement(bool bReverse, double Duration, int32 WeaponIndex, E_CharacterVisualControl_CharacterMode Mode, bool EnableEffect);
	void WarpEffect_ActiveChildEffect(class UMeshComponent* Mesh);
	void WarpEffect_Appear(double Duration);
	void WarpEffect_Begin(double TotalDuration, double VanishTime, double AppearTime);
	void WarpEffect_DeactiveChildEffect(class UMeshComponent* Mesh);
	void WarpEffect_End();
	void WarpEffect_Tick(double DeltaSeconds);
	void WarpEffect_Vanish(double Duration);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CharacterVisualControl_Implement_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CharacterVisualControl_Implement_C")
	}
	static class UBP_CharacterVisualControl_Implement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CharacterVisualControl_Implement_C>();
	}
};
DUMPER7_ASSERTS_UBP_CharacterVisualControl_Implement_C;

}

