#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConfigKeyAssignEntryBase

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ConfigKeyAssignEntryBase.BP_ConfigKeyAssignEntryBase_C
// 0x0080 (0x00A8 - 0x0028)
class UBP_ConfigKeyAssignEntryBase_C : public UObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   CategoryName;                                      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool InIsKeyDefault, bool InIsKeyApply)> OnChangeEditKeyAssign;    // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool InIsKeyApply)> OnApplyKeyAssign;                              // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool InIsDeplicationKey, EConfigKeyType InKeyType)> OnSetIsDuplication; // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	EConfigKeyAssignEnableType                    AssignEnableType;                                  // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(EConfigKeyType InKeyType)> OnSetSelectKeyType;                     // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnSetDeselectKeyType;                              // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UBP_ConfigKeyAssignEntryBase_C* InChangedEntry, EConfigKeyType InKeyType)> OnMouseKeyTypeChanged; // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   RowName;                                           // 0x00A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UpdateDisplay();
	void SetSelectKeyType(EConfigKeyType InKeyType);
	void SetIsExpansion(bool InFlag, bool* OutFlag);
	void SetIsDuplication(bool InIsDuplication, EConfigKeyType InKeyType);
	void SetEditKeyAssign(const TArray<struct FKey>& InKey, EConfigKeyType InKeyType);
	void SetDeselectKeyType();
	void OnKeyTypeChange(EConfigKeyType InKeyType);
	void Initialize();
	void GetRowName(class FName* NewParam);
	void GetItemName(class FText* OutInputActionName);
	void GetIsTriggerAxis(bool* OutIsTriggerAxis);
	void GetIsExpansion(bool* OutFlag);
	void GetIsDuplication(EConfigKeyType InKeyType, bool* OutIsDuplication);
	void GetIsCategoryEntry(bool* OutFlag);
	void GetInputActionTag(struct FGameplayTag* OutTag);
	void GetEditKeyByKeyType(EConfigKeyType InKeyType, TArray<struct FKey>* OutKey);
	void GetEditKey(TArray<struct FKey>* InGamePadKey, TArray<struct FKey>* InKeyboardKey_Main, TArray<struct FKey>* InKeyboardKey_Sub);
	void GetDescriptionTexture(TSoftObjectPtr<class UTexture2D>* OutTexture, bool* OutIsValid);
	void GetDescriptionText(class FText* OutText);
	void GetDescriptionMoviePath(class FString* OutPath, bool* OutIsValid);
	void GetCategoryName(class FName* OutCategoryName);
	void GetAssignEnableType(EConfigKeyAssignEnableType* OutFlag);
	void GetApplyKeyByKeyType(EConfigKeyType InKeyType, TArray<struct FKey>* OutKey);
	void GetApplyKey(TArray<struct FKey>* InGamePadKey, TArray<struct FKey>* InKeyboardKey_Main, TArray<struct FKey>* InKeyboardKey_Sub);
	void ExecuteUbergraph_BP_ConfigKeyAssignEntryBase(int32 EntryPoint);
	void ClearKey(EConfigKeyType InKeyType, bool* IsSuccess);
	void CheckIsKeyDefault(bool* OutIsKeyDefault);
	void CheckIsKeyApply(bool* OutIsKeyApply);
	void ChangeExpansion();
	void ApplyKey();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ConfigKeyAssignEntryBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ConfigKeyAssignEntryBase_C")
	}
	static class UBP_ConfigKeyAssignEntryBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_ConfigKeyAssignEntryBase_C>();
	}
};
DUMPER7_ASSERTS_UBP_ConfigKeyAssignEntryBase_C;

}

