#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConfigKeyAssignCategoryEntry

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_ConfigKeyAssignCategoryEntry.BP_ConfigKeyAssignCategoryEntry_C.SetIsExpansion
// 0x0002 (0x0002 - 0x0000)
struct BP_ConfigKeyAssignCategoryEntry_C_SetIsExpansion final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutFlag;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigKeyAssignCategoryEntry_C_SetIsExpansion;

// Function BP_ConfigKeyAssignCategoryEntry.BP_ConfigKeyAssignCategoryEntry_C.GetItemName
// 0x0010 (0x0010 - 0x0000)
struct BP_ConfigKeyAssignCategoryEntry_C_GetItemName final
{
public:
	class FText                                   OutInputActionName;                                // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_ConfigKeyAssignCategoryEntry_C_GetItemName;

// Function BP_ConfigKeyAssignCategoryEntry.BP_ConfigKeyAssignCategoryEntry_C.GetIsExpansion
// 0x0001 (0x0001 - 0x0000)
struct BP_ConfigKeyAssignCategoryEntry_C_GetIsExpansion final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigKeyAssignCategoryEntry_C_GetIsExpansion;

// Function BP_ConfigKeyAssignCategoryEntry.BP_ConfigKeyAssignCategoryEntry_C.GetIsDuplication
// 0x0002 (0x0002 - 0x0000)
struct BP_ConfigKeyAssignCategoryEntry_C_GetIsDuplication final
{
public:
	EConfigKeyType                                InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutIsDuplication;                                  // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigKeyAssignCategoryEntry_C_GetIsDuplication;

// Function BP_ConfigKeyAssignCategoryEntry.BP_ConfigKeyAssignCategoryEntry_C.GetIsCategoryEntry
// 0x0001 (0x0001 - 0x0000)
struct BP_ConfigKeyAssignCategoryEntry_C_GetIsCategoryEntry final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigKeyAssignCategoryEntry_C_GetIsCategoryEntry;

// Function BP_ConfigKeyAssignCategoryEntry.BP_ConfigKeyAssignCategoryEntry_C.GetInputActionTag
// 0x0008 (0x0008 - 0x0000)
struct BP_ConfigKeyAssignCategoryEntry_C_GetInputActionTag final
{
public:
	struct FGameplayTag                           OutTag;                                            // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigKeyAssignCategoryEntry_C_GetInputActionTag;

// Function BP_ConfigKeyAssignCategoryEntry.BP_ConfigKeyAssignCategoryEntry_C.GetAssignEnableType
// 0x0001 (0x0001 - 0x0000)
struct BP_ConfigKeyAssignCategoryEntry_C_GetAssignEnableType final
{
public:
	EConfigKeyAssignEnableType                    OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigKeyAssignCategoryEntry_C_GetAssignEnableType;

// Function BP_ConfigKeyAssignCategoryEntry.BP_ConfigKeyAssignCategoryEntry_C.ExecuteUbergraph_BP_ConfigKeyAssignCategoryEntry
// 0x0008 (0x0008 - 0x0000)
struct BP_ConfigKeyAssignCategoryEntry_C_ExecuteUbergraph_BP_ConfigKeyAssignCategoryEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigKeyAssignCategoryEntry_C_ExecuteUbergraph_BP_ConfigKeyAssignCategoryEntry;

// Function BP_ConfigKeyAssignCategoryEntry.BP_ConfigKeyAssignCategoryEntry_C.CheckIsKeyDefault
// 0x0001 (0x0001 - 0x0000)
struct BP_ConfigKeyAssignCategoryEntry_C_CheckIsKeyDefault final
{
public:
	bool                                          OutIsKeyDefault;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigKeyAssignCategoryEntry_C_CheckIsKeyDefault;

// Function BP_ConfigKeyAssignCategoryEntry.BP_ConfigKeyAssignCategoryEntry_C.CheckIsKeyApply
// 0x0001 (0x0001 - 0x0000)
struct BP_ConfigKeyAssignCategoryEntry_C_CheckIsKeyApply final
{
public:
	bool                                          OutIsKeyApply;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigKeyAssignCategoryEntry_C_CheckIsKeyApply;

}

