#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CampMenuUIObject

#include "Basic.hpp"

#include "BasicUI_structs.hpp"
#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.ExecuteUbergraph_BP_CampMenuUIObject
// 0x01F0 (0x01F0 - 0x0000)
struct BP_CampMenuUIObject_C_ExecuteUbergraph_BP_CampMenuUIObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_BuddyChangeMenu_C*                 CallFunc_GetChangeBuddyMenu_AsWDT_Buddy_Change_Menu; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTalkToLouTableRow                     K2Node_Event_InTalkInfo;                           // 0x0020(0x01B0)(ConstParm)
	class UWDT_RestMenu_C*                        CallFunc_GetRestMenu_OutRestMenu;                  // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventSystem_ReturnValue;              // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEventSystem_ReturnValue_1;            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InListIndex;                          // 0x01E4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_ExecuteUbergraph_BP_CampMenuUIObject;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.GetChangeBuddyMenu
// 0x0028 (0x0028 - 0x0000)
struct BP_CampMenuUIObject_C_GetChangeBuddyMenu final
{
public:
	class UWDT_BuddyChangeMenu_C*                 AsWDT_Buddy_Change_Menu;                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_BuddyChangeMenu_C*                 K2Node_DynamicCast_AsWDT_Buddy_Change_Menu;        // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_GetChangeBuddyMenu;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.GetRestMenu
// 0x0028 (0x0028 - 0x0000)
struct BP_CampMenuUIObject_C_GetRestMenu final
{
public:
	class UWDT_RestMenu_C*                        OutRestMenu;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_RestMenu_C*                        K2Node_DynamicCast_AsWDT_Rest_Menu;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_GetRestMenu;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.IsTalkingToLou
// 0x0001 (0x0001 - 0x0000)
struct BP_CampMenuUIObject_C_IsTalkingToLou final
{
public:
	bool                                          OutResult;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_IsTalkingToLou;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.NotifyBuddyChanged
// 0x0004 (0x0004 - 0x0000)
struct BP_CampMenuUIObject_C_NotifyBuddyChanged final
{
public:
	int32                                         InListIndex;                                       // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_NotifyBuddyChanged;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.OnChangeBuddyMenuClosed
// 0x0038 (0x0038 - 0x0000)
struct BP_CampMenuUIObject_C_OnChangeBuddyMenuClosed final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue_1;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_OnChangeBuddyMenuClosed;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.OnGadgetDuplicationMenuClosed
// 0x0038 (0x0038 - 0x0000)
struct BP_CampMenuUIObject_C_OnGadgetDuplicationMenuClosed final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue_1;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_OnGadgetDuplicationMenuClosed;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.OnLevelUpMenuClosed
// 0x0038 (0x0038 - 0x0000)
struct BP_CampMenuUIObject_C_OnLevelUpMenuClosed final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue_1;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_OnLevelUpMenuClosed;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.OnMapMenuClosed
// 0x0048 (0x0048 - 0x0000)
struct BP_CampMenuUIObject_C_OnMapMenuClosed final
{
public:
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Open_ReturnValue;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue_1;                    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_MapMenu_C*                         K2Node_DynamicCast_AsWDT_Map_Menu;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOpenSupportMenu_IsOpen;                 // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_OnMapMenuClosed;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.OnResilienceUpMenuClosed
// 0x0038 (0x0038 - 0x0000)
struct BP_CampMenuUIObject_C_OnResilienceUpMenuClosed final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue_1;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_OnResilienceUpMenuClosed;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.OnRestMenuClosed
// 0x0038 (0x0038 - 0x0000)
struct BP_CampMenuUIObject_C_OnRestMenuClosed final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue_1;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_OnRestMenuClosed;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.OnStorageMenuClosed
// 0x0038 (0x0038 - 0x0000)
struct BP_CampMenuUIObject_C_OnStorageMenuClosed final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue_1;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_OnStorageMenuClosed;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.OnWeaponGadgetChangeMenuClosed
// 0x0038 (0x0038 - 0x0000)
struct BP_CampMenuUIObject_C_OnWeaponGadgetChangeMenuClosed final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue_1;                    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_OnWeaponGadgetChangeMenuClosed;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.Open
// 0x01D0 (0x01D0 - 0x0000)
struct BP_CampMenuUIObject_C_Open final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Open_ReturnValue;                         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0xD];                                        // 0x0003(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTalkToLouTableRow                     CallFunc_GetAvailableTalkToLouInfoBP_OutInfo;      // 0x0010(0x01B0)()
	bool                                          CallFunc_GetAvailableTalkToLouInfoBP_ReturnValue;  // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Open_ReturnValue_1;                       // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_Open;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.OpenChangeBuddyMenu
// 0x0068 (0x0068 - 0x0000)
struct BP_CampMenuUIObject_C_OpenChangeBuddyMenu final
{
public:
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext;                     // 0x0008(0x0038)(NoDestructor)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_OpenChangeBuddyMenu;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.OpenGadgetDuplicationMenu
// 0x0068 (0x0068 - 0x0000)
struct BP_CampMenuUIObject_C_OpenGadgetDuplicationMenu final
{
public:
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext;                     // 0x0008(0x0038)(NoDestructor)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_OpenGadgetDuplicationMenu;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.OpenLevelUpMenu
// 0x0068 (0x0068 - 0x0000)
struct BP_CampMenuUIObject_C_OpenLevelUpMenu final
{
public:
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext;                     // 0x0010(0x0038)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_OpenLevelUpMenu;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.OpenMapMenu
// 0x0038 (0x0038 - 0x0000)
struct BP_CampMenuUIObject_C_OpenMapMenu final
{
public:
	class UUIObjectBase*                          L_MapMenuUIObject;                                 // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Open_ReturnValue;                         // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIObjectBase*                          CallFunc_GetUIObjectByClass_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Close_ReturnValue;                        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_OpenMapMenu;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.OpenResilienceUpMenu
// 0x0068 (0x0068 - 0x0000)
struct BP_CampMenuUIObject_C_OpenResilienceUpMenu final
{
public:
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext;                     // 0x0008(0x0038)(NoDestructor)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_OpenResilienceUpMenu;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.OpenRestMenu
// 0x0068 (0x0068 - 0x0000)
struct BP_CampMenuUIObject_C_OpenRestMenu final
{
public:
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext;                     // 0x0008(0x0038)(NoDestructor)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_OpenRestMenu;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.OpenStorageMenu
// 0x0068 (0x0068 - 0x0000)
struct BP_CampMenuUIObject_C_OpenStorageMenu final
{
public:
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext;                     // 0x0008(0x0038)(NoDestructor)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_OpenStorageMenu;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.OpenWeaponGadgetChangeMenu
// 0x0068 (0x0068 - 0x0000)
struct BP_CampMenuUIObject_C_OpenWeaponGadgetChangeMenu final
{
public:
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext;                     // 0x0008(0x0038)(NoDestructor)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_OpenWeaponGadgetChangeMenu;

// Function BP_CampMenuUIObject.BP_CampMenuUIObject_C.TalkToLouBP
// 0x01B0 (0x01B0 - 0x0000)
struct BP_CampMenuUIObject_C_TalkToLouBP final
{
public:
	struct FTalkToLouTableRow                     InTalkInfo;                                        // 0x0000(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_BP_CampMenuUIObject_C_TalkToLouBP;

}

