#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CampMenuUIObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BasicUI_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CampMenuUIObject.BP_CampMenuUIObject_C
// 0x01C8 (0x0658 - 0x0490)
class UBP_CampMenuUIObject_C final : public UCampMenuUIObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0490(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FMenuContext                           LevelUpMenuContext;                                // 0x0498(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           RestMenuContext;                                   // 0x04D0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          TalkingToLouFlag;                                  // 0x0508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_509[0x7];                                      // 0x0509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PlayerLocation;                                    // 0x0510(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               PlayerRotation;                                    // 0x0528(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMenuContext                           ResilienceUpMenuContext;                           // 0x0540(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           StorageMenuContext;                                // 0x0578(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           WeaponGadgetChangeMenuContext;                     // 0x05B0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           GadgetDuplicationMenu;                             // 0x05E8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           ChangeBuddyMenu;                                   // 0x0620(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BP_CampMenuUIObject(int32 EntryPoint);
	void GetChangeBuddyMenu(class UWDT_BuddyChangeMenu_C** AsWDT_Buddy_Change_Menu);
	void GetRestMenu(class UWDT_RestMenu_C** OutRestMenu);
	void IsTalkingToLou(bool* OutResult);
	void NotifyBuddyChanged(const int32 InListIndex);
	void NotifyCampRestEnded();
	void OnChangeBuddyMenuClosed();
	void OnFinishTalkToLouCinematicBP();
	void OnGadgetDuplicationMenuClosed();
	void OnLevelUpMenuClosed();
	void OnMapMenuClosed();
	void OnResilienceUpMenuClosed();
	void OnRestMenuClosed();
	void OnStartTalkToLouCinematicBP();
	void OnStorageMenuClosed();
	void OnWeaponGadgetChangeMenuClosed();
	bool Open();
	void OpenChangeBuddyMenu();
	void OpenGadgetDuplicationMenu();
	void OpenLevelUpMenu();
	void OpenMapMenu();
	void OpenResilienceUpMenu();
	void OpenRestMenu();
	void OpenStorageMenu();
	void OpenWeaponGadgetChangeMenu();
	void TalkToLouBP(const struct FTalkToLouTableRow& InTalkInfo);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CampMenuUIObject_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CampMenuUIObject_C")
	}
	static class UBP_CampMenuUIObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_CampMenuUIObject_C>();
	}
};
DUMPER7_ASSERTS_UBP_CampMenuUIObject_C;

}

