#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConfigurationUIObject

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Extensions_structs.hpp"
#include "BasicUI_structs.hpp"


namespace SDK::Params
{

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.CloseFieldMenu
// 0x0028 (0x0028 - 0x0000)
struct BP_ConfigurationUIObject_C_CloseFieldMenu final
{
public:
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_ConfigurationTopMenu_C*            K2Node_DynamicCast_AsWDT_Configuration_Top_Menu;   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIObjectBase*                          CallFunc_GetUIObjectByClass_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Close_ReturnValue;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Close_ReturnValue_1;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_CloseFieldMenu;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.ExecuteUbergraph_BP_ConfigurationUIObject
// 0x0570 (0x0570 - 0x0000)
struct BP_ConfigurationUIObject_C_ExecuteUbergraph_BP_ConfigurationUIObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInNoSelectReturnToTitle;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue_1;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_2;   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue_2;                   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_3;   // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue_3;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_4;   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue_4;                   // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_5;   // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWDT_ConfigConsentPage_C*               K2Node_DynamicCast_AsWDT_Config_Consent_Page;      // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue_5;                   // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_6;   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue_6;                   // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_7;   // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue_7;                   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue;                   // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext;                     // 0x00A0(0x0038)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue_1;                 // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext_1;                   // 0x0100(0x0038)(NoDestructor)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue_2;                 // 0x0138(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_8;   // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue_8;                   // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext_2;                   // 0x0160(0x0038)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext_3;                   // 0x01A8(0x0038)(NoDestructor)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue_3;                 // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x01E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext_4;                   // 0x01F8(0x0038)(NoDestructor)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_9;   // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0238(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue_9;                   // 0x0248(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext_5;                   // 0x0250(0x0038)(NoDestructor)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue_4;                 // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0290(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext_6;                   // 0x02A0(0x0038)(NoDestructor)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue_5;                 // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x02E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext_7;                   // 0x02F0(0x0038)(NoDestructor)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_10;  // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext_8;                   // 0x0330(0x0038)(NoDestructor)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue_10;                  // 0x0368(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0370(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue_6;                 // 0x0380(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x0388(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FConfigurationConsentTypeTags          K2Node_Event_InConsentTag;                         // 0x0398(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext_9;                   // 0x03A0(0x0038)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x03D8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext_10;                  // 0x03E8(0x0038)(NoDestructor)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_11;  // 0x0420(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue_11;                  // 0x0428(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_12;  // 0x0430(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue_12;                  // 0x0438(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue_7;                 // 0x0440(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_11;           // 0x0448(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext_11;                  // 0x0458(0x0038)(NoDestructor)
	EConfigDisplayType                            CallFunc_GetConfigDisplayType_ReturnValue;         // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_492[0x6];                                      // 0x0492(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_13;  // 0x0498(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_12;           // 0x04A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           K2Node_MakeStruct_MenuContext_12;                  // 0x04B0(0x0038)(NoDestructor)
	EConfigDisplayType                            CallFunc_GetConfigDisplayType_ReturnValue_1;       // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EA[0x2];                                      // 0x04EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_13;           // 0x04EC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuBase*                              CallFunc_OpenMenu_ReturnValue_13;                  // 0x0500(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue_8;                 // 0x0508(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_ConfigurationTopMenu_C*            K2Node_DynamicCast_AsWDT_Configuration_Top_Menu;   // 0x0510(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0518(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuContext                           K2Node_MakeStruct_MenuContext_13;                  // 0x0520(0x0038)(NoDestructor)
	bool                                          K2Node_Event_bSucceeded;                           // 0x0558(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_ConfigLanguagePage_C*              K2Node_DynamicCast_AsWDT_Config_Language_Page;     // 0x0560(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0568(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_ExecuteUbergraph_BP_ConfigurationUIObject;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.GetTransitType
// 0x0008 (0x0008 - 0x0000)
struct BP_ConfigurationUIObject_C_GetTransitType final
{
public:
	struct FGameplayTag                           TransitTypeTag_0;                                  // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_GetTransitType;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.OnAccessibilityPageClose
// 0x0028 (0x0028 - 0x0000)
struct BP_ConfigurationUIObject_C_OnAccessibilityPageClose final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_OnAccessibilityPageClose;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.OnAudioPageClosed
// 0x0028 (0x0028 - 0x0000)
struct BP_ConfigurationUIObject_C_OnAudioPageClosed final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_OnAudioPageClosed;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.OnBrightnessPageClose
// 0x0014 (0x0014 - 0x0000)
struct BP_ConfigurationUIObject_C_OnBrightnessPageClose final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_OnBrightnessPageClose;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.OnCameraPageClose
// 0x0014 (0x0014 - 0x0000)
struct BP_ConfigurationUIObject_C_OnCameraPageClose final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_OnCameraPageClose;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.OnConsentPageClose
// 0x0014 (0x0014 - 0x0000)
struct BP_ConfigurationUIObject_C_OnConsentPageClose final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_OnConsentPageClose;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.OnConsentSelectPageClose
// 0x0028 (0x0028 - 0x0000)
struct BP_ConfigurationUIObject_C_OnConsentSelectPageClose final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_OnConsentSelectPageClose;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.OnGamePageClosed
// 0x0028 (0x0028 - 0x0000)
struct BP_ConfigurationUIObject_C_OnGamePageClosed final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_OnGamePageClosed;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.OnGraphicPageClose
// 0x0028 (0x0028 - 0x0000)
struct BP_ConfigurationUIObject_C_OnGraphicPageClose final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_OnGraphicPageClose;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.OnKeyAssignPageClose
// 0x0014 (0x0014 - 0x0000)
struct BP_ConfigurationUIObject_C_OnKeyAssignPageClose final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_OnKeyAssignPageClose;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.OnLanguagePageClose
// 0x0028 (0x0028 - 0x0000)
struct BP_ConfigurationUIObject_C_OnLanguagePageClose final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_OnLanguagePageClose;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.OnNetworkPageClose
// 0x0028 (0x0028 - 0x0000)
struct BP_ConfigurationUIObject_C_OnNetworkPageClose final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_OnNetworkPageClose;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.OnNoSelectReturnToTitle
// 0x0001 (0x0001 - 0x0000)
struct BP_ConfigurationUIObject_C_OnNoSelectReturnToTitle final
{
public:
	bool                                          bInNoSelectReturnToTitle;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_OnNoSelectReturnToTitle;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.OnOperationTopPageClose
// 0x0028 (0x0028 - 0x0000)
struct BP_ConfigurationUIObject_C_OnOperationTopPageClose final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_OnOperationTopPageClose;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.OnSetCurrentAudioCultureCompleted
// 0x0001 (0x0001 - 0x0000)
struct BP_ConfigurationUIObject_C_OnSetCurrentAudioCultureCompleted final
{
public:
	bool                                          bSucceeded;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_OnSetCurrentAudioCultureCompleted;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.OpenConsentPage
// 0x0008 (0x0008 - 0x0000)
struct BP_ConfigurationUIObject_C_OpenConsentPage final
{
public:
	struct FConfigurationConsentTypeTags          InConsentTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_OpenConsentPage;

// Function BP_ConfigurationUIObject.BP_ConfigurationUIObject_C.SetTransitType
// 0x0008 (0x0008 - 0x0000)
struct BP_ConfigurationUIObject_C_SetTransitType final
{
public:
	struct FConfigurationTransitTypeTags          InTransitTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ConfigurationUIObject_C_SetTransitType;

}

