#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DrawScarElement_NiagaraScar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_DrawScarElement_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DrawScarElement_NiagaraScar.BP_DrawScarElement_NiagaraScar_C
// 0x00B8 (0x0128 - 0x0070)
class UBP_DrawScarElement_NiagaraScar_C final : public UBP_DrawScarElement_C
{
public:
	class UNiagaraSystem*                         NiagaraScarEffect_Asset;                           // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraScarEffect;                                 // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0098(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitDirection;                                      // 0x00B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScarSize;                                          // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               ScarTexture;                                       // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<int32, class UMaterialInstance*>         MaterialMap;                                       // 0x00D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddMaterialIndex(int32 MaterialIndex);
	void ClearMaterialIndex();
	void DestroyNiagaraScarEffect();
	void Hit(const struct FVector& HitLocation_0, const struct FVector& HitNormal_0, const struct FVector& HitDirection_0, double ScarSize_0, class UTexture* ScarTexture_0);
	void Hit_End();
	void Initialize(class AActor* Owner_0, class UMeshComponent* TargetMesh_0, int32 UVIndex_0, int32 CaptureIndex_0, double Effect_Spawn_Weight_0, class UTexture2D* Scar_Mask_Texture_0, class UTextureRenderTarget2D* RenderTarget_0);
	void OnDestroy();
	void OnDying();
	void OnInitialize();
	void Process(double ScarLifeTime_Substruct, double OldScarLifeTime_Substruct);
	void SetNiagaraScarParameter(double ScarLifetime, double OldScarLifetime, double ScarLifeTime_Substruct, double OldScarLifeTime_Substruct);
	void SpawnNiagaraScarEffect();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DrawScarElement_NiagaraScar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DrawScarElement_NiagaraScar_C")
	}
	static class UBP_DrawScarElement_NiagaraScar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DrawScarElement_NiagaraScar_C>();
	}
};
DUMPER7_ASSERTS_UBP_DrawScarElement_NiagaraScar_C;

}

