#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Damage_Screen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Damage_Screen.BP_Damage_Screen_C
// 0x0028 (0x00C8 - 0x00A0)
class UBP_Damage_Screen_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UBP_Damage_Screen_Element_C*>    ElementArray;                                      // 0x00A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MaxCount;                                          // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Draw();
	void End();
	void ExecuteUbergraph_BP_Damage_Screen(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void SetMaterial(class UMaterialInterface* Material_0);
	void Tick(double DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Damage_Screen_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Damage_Screen_C")
	}
	static class UBP_Damage_Screen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_Damage_Screen_C>();
	}
};
DUMPER7_ASSERTS_UBP_Damage_Screen_C;

}

