#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DrawScarElement

#include "Basic.hpp"

#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DrawScarElement.BP_DrawScarElement_C
// 0x0048 (0x0070 - 0x0028)
class UBP_DrawScarElement_C : public UDrawScarElement
{
public:
	class UNiagaraComponent*                      ScarEffectInstance;                                // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Owner;                                             // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMeshComponent*                         TargetMesh;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         UVIndex;                                           // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CaptureIndex;                                      // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         ScarEffect_Asset;                                  // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Scar_Mask_Texture;                                 // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Effect_Spawn_Weight;                               // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInitialize;                                       // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHit;                                             // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddMaterialIndex(int32 MaterialIndex);
	void ClearMaterialIndex();
	void DeactivateSplashEffect();
	void GetCaptureIndex(int32* CaptureIndex_0);
	void GetIsHit(bool* IsHit_0);
	void GetMeshSurfaceArea(double* Result);
	void GetUVIndex(int32* UVIndex_0);
	void Hit(const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& HitDirection, double ScarSize, class UTexture* ScarTexture);
	void Hit_End();
	void OnDestroy();
	void OnDestroyResource();
	void OnDying();
	void Post_Process();
	void Pre_Process(double CaptureSize, double ScarLifetime, double OldScarLifetime, const struct FVector& CaptureLocation);
	void Process(double ScarLifeTime_Substruct, double OldScarLifeTime_Substruct);
	void SpawnSplashEffect();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DrawScarElement_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DrawScarElement_C")
	}
	static class UBP_DrawScarElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DrawScarElement_C>();
	}
};
DUMPER7_ASSERTS_UBP_DrawScarElement_C;

}

