#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DescriptionListData

#include "Basic.hpp"

#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function BP_DescriptionListData.BP_DescriptionListData_C.SetListIndex
// 0x0004 (0x0004 - 0x0000)
struct BP_DescriptionListData_C_SetListIndex final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_DescriptionListData_C_SetListIndex;

// Function BP_DescriptionListData.BP_DescriptionListData_C.SetInstructionData
// 0x0048 (0x0048 - 0x0000)
struct BP_DescriptionListData_C_SetInstructionData final
{
public:
	struct FInstructionInfoTable                  InData;                                            // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_BP_DescriptionListData_C_SetInstructionData;

// Function BP_DescriptionListData.BP_DescriptionListData_C.SetDescriptionData
// 0x0038 (0x0038 - 0x0000)
struct BP_DescriptionListData_C_SetDescriptionData final
{
public:
	struct FDescriptionInfoTable                  InDescriptionData;                                 // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_BP_DescriptionListData_C_SetDescriptionData;

// Function BP_DescriptionListData.BP_DescriptionListData_C.IsDesctiptionData
// 0x0001 (0x0001 - 0x0000)
struct BP_DescriptionListData_C_IsDesctiptionData final
{
public:
	bool                                          OutResult;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_DescriptionListData_C_IsDesctiptionData;

// Function BP_DescriptionListData.BP_DescriptionListData_C.GetListIndex
// 0x0004 (0x0004 - 0x0000)
struct BP_DescriptionListData_C_GetListIndex final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_DescriptionListData_C_GetListIndex;

// Function BP_DescriptionListData.BP_DescriptionListData_C.GetInstructionData
// 0x0048 (0x0048 - 0x0000)
struct BP_DescriptionListData_C_GetInstructionData final
{
public:
	struct FInstructionInfoTable                  OutData;                                           // 0x0000(0x0048)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_DescriptionListData_C_GetInstructionData;

// Function BP_DescriptionListData.BP_DescriptionListData_C.GetDescriptionData
// 0x0038 (0x0038 - 0x0000)
struct BP_DescriptionListData_C_GetDescriptionData final
{
public:
	struct FDescriptionInfoTable                  OutData;                                           // 0x0000(0x0038)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_DescriptionListData_C_GetDescriptionData;

}

