#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DestructibleMeshActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"
#include "Chaos_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ST_DestructibleMeshActor_ResetTransformInfo_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DestructibleMeshActor.BP_DestructibleMeshActor_C
// 0x02E0 (0x0738 - 0x0458)
class ABP_DestructibleMeshActor_C final : public AAppDestructibleActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0458(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNavModifierComponent*                  NavModifier;                                       // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UObjectOpacityComponent*                ObjectOpacity_Vanish;                              // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URandomVector*                          RandomVector_Torque;                               // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         OperatorField_TorqueB;                             // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         OperatorField_TorqueA;                             // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUniformScalar*                         UniformScalar_Torque;                              // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUniformVector*                         UniformVector_Torque;                              // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialVector*                          RadialVector_Torque;                               // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCullingField*                          CullingField_Velocity;                             // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialFalloff*                         RadialFalloffRadial;                               // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialFalloff*                         RadialFalloffRadialMagnitude;                      // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialFalloff*                         RadialFalloffStain;                                // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFieldSystemComponent*                  FieldSystem;                                       // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOperatorField*                         OperatorField_Multiply;                            // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUniformInteger*                        UniformInteger;                                    // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UUniformVector*                         UniformVector_Velocity;                            // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCullingField*                          CullingField_Stain;                                // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialFalloff*                         RadialFalloffStainMagnitude;                       // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URadialVector*                          RadialVector_Velocity;                             // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bDestructed;                                       // 0x04F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WaitResetFrameCount;                               // 0x04FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGeometryCollectionComponent*           GCInstance;                                        // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        TimeToSleep;                                       // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FieldMagnitude_Radial;                             // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FieldMagnitude_Vector;                             // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAppDestructibleActorDamageInfo        Damage_Info;                                       // 0x0520(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	double                                        HitRadius_Stain;                                   // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HitRadius_Velocity;                                // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TorqueVector;                                      // 0x05A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TorqueScale;                                       // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UObject*>                        ExternalFields;                                    // 0x05C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                HitLocation;                                       // 0x05D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitDirection;                                      // 0x05E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class USkeletalMeshComponent*, struct FST_DestructibleMeshActor_ResetTransformInfo> ResetTransformInfoMap; // 0x0600(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class USkeletalMeshComponent*>         SkeletalMeshArray;                                 // 0x0650(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        TimeToVanishStart;                                 // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeToVanishEnd;                                   // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableNavModifier;                                // 0x0670(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_671[0x7];                                      // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class USkeletalMeshComponent*, bool>     ResetFirstMap;                                     // 0x0678(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class USkeletalMeshComponent*, class USkeletalMeshComponent*> NewSkeletalMeshMap;           // 0x06C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          bStaticMeshVisible;                                // 0x0718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_719[0x7];                                      // 0x0719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DestructTime;                                      // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VanishTime;                                        // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseOtherGCInstance;                               // 0x0730(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisableVanish;                                    // 0x0731(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddResetTransformInfoMap(class USkeletalMeshComponent* SkeletalMesh);
	void AddVanishOpacityAll();
	void CreateGeometryCollection(class UGeometryCollectionComponent** Result);
	void Destroy();
	void DestroyGeometryCollection();
	void DestructSelf();
	void ExecuteUbergraph_BP_DestructibleMeshActor(int32 EntryPoint);
	void Initialize();
	void IsDestructed(bool* bDestructed_0);
	void OnAttack(const struct FAppDestructibleActorDamageInfo& DamageInfo);
	void OnBeginResetDestruct();
	void OnDestructChaos(const struct FVector& Location, const struct FVector& Direction);
	void OnEndResetDestruct();
	void OnHit(const struct FAppDestructibleActorDamageInfo& InDamageInfo);
	void OnPhysicsCollision(const struct FChaosPhysicsCollisionInfo& CollisionInfo);
	void OnResetDestruct();
	void OnSetDestructed();
	void OnSpawnVFX();
	void OnTick(double DeltaSeconds);
	void OnTick_DestructState(double DeltaSeconds);
	void OnTick_DestructStateProcess(float InDeltaSeconds);
	void OnTick_ResetDestruct(double DeltaSeconds);
	void OnTick_ResetDestructProcess(float InDeltaSeconds);
	void OnTick_VanishState(double DeltaSeconds);
	void OnTick_VanishStateProcess(float InDeltaSeconds);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void SetDestructed();
	void SetExternalField();
	void SetForce(const struct FVector& Location, const struct FVector& Direction);
	void SetNavModifier(bool Visibility);
	void SetOtherGCInstance(class UGeometryCollectionComponent* GCInstance_0);
	void SetSkeletalMeshCoillisionClothPhysics(class USkeletalMeshComponent* SkeletalMesh, ECollisionEnabled CollisionEnabled, bool bCloth, bool bPhysics);
	void SetSkeletalMeshDestruct(bool bReset);
	void SetSkeletalMeshDestructed();
	void SetSkeletalMeshSleepCloth(class USkeletalMeshComponent* SkeletalMesh, bool Enable);
	void SetSleep();
	void SetSleepCloth(bool Enable);
	void SetStaticMeshVisibility(bool Visibility);
	void SetVanishOpacity(double Opacity);
	void UserConstructionScript();
	void VanishEnd();
	void VanishInitialize();
	void VanishReset();
	void VanishStart();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DestructibleMeshActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DestructibleMeshActor_C")
	}
	static class ABP_DestructibleMeshActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DestructibleMeshActor_C>();
	}
};
DUMPER7_ASSERTS_ABP_DestructibleMeshActor_C;

}

