#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DrawScar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ST_DrawScar_CaptureData_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DrawScar.BP_DrawScar_C
// 0x01D0 (0x02B0 - 0x00E0)
class UBP_DrawScar_C final : public UDrawScarComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        ResourceCreateDistance;                            // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ResourceDestroyDistance;                           // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, struct FST_DrawScar_CaptureData>  CaptureDataMap;                                    // 0x00F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UBP_DrawScarElement_C*>          ElementArray;                                      // 0x0148(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                HitLocation;                                       // 0x0158(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitNormal;                                         // 0x0170(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HitDirection;                                      // 0x0188(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HitScarSize;                                       // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture*                               ScarTexture;                                       // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture*>                       ScarTextureArray_Slash;                            // 0x01B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTexture*>                       ScarTextureArray_Pierce;                           // 0x01C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTexture*>                       ScarTextureArray_Blow;                             // 0x01D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTexture*>                       ScarTextureArray_Pile;                             // 0x01E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        CaptureSize;                                       // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BGMesh;                                            // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        ScarLifetime;                                      // 0x0200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OldScarLifetime;                                   // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScarLifeTime_Substruct;                            // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OldScarLifeTime_Substruct;                         // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPreProccess;                                      // 0x0220(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCaptureProcess;                                   // 0x0221(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPostProccess;                                     // 0x0222(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_223[0x5];                                      // 0x0223(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OldScar_EraseValue;                                // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CaptureHeight;                                     // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               BGMaterial;                                        // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ResourceInitializeCount;                           // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Bone_Name;                                         // 0x0244(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Stake_Duration;                                    // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stake_Duration_Vanish;                             // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBloodFeed_Process;                                // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         BloodFeedEffect_Scar;                              // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        EraseValueOnBloodFeed;                             // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         BloodFeedEffect_Hit;                               // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        BeedingToLifeTimeWeight;                           // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCaputuring;                                       // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Tolerance;                                         // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScarScale;                                         // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScarScale_Global;                                  // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bResourceCreated;                                  // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBGMeshCreated;                                    // 0x02A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterruptDrawScar;                                // 0x02A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A3[0x1];                                      // 0x02A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InterruptDrawScar_Count;                           // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NiagaraScar_Enable;                                // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableScar;                                       // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BloodFeed(const struct FVector& InHitLocation, class USkeletalMeshComponent* InAttacker);
	void CaptureProcess_CaptureData(int32 CaptureIndex, class USceneCaptureComponent2D* SceneCapture, class UTextureRenderTarget2D* RenderTarget);
	void ConstructCaptureData(int32 Index_0, bool* bFound);
	void ConstructRenderTarget(class UTextureRenderTarget2D** Result);
	void ConstructSceneCapture(class USceneCaptureComponent2D** Result);
	void CreateBGMesh();
	void CreateResource();
	void DestroyResource();
	void ExecuteUbergraph_BP_DrawScar(int32 EntryPoint);
	void GetElement(int32 Index_0, class UBP_DrawScarElement_C** Result);
	void GetElementCount(int32* Result);
	void Hit(const struct FVector& InLocation, const struct FVector& InNormal, const struct FVector& InDirection, const class FName& InBoneName, float InScarSize, EDrawScarType InScarType, float InBleedingDamage, float InBleedingAmount, float InMaxBleedingAmount);
	void Hit_Implement(const struct FVector& Location, const struct FVector& Normal, const struct FVector& Direction, class FName BoneName, double ScarSize, EDrawScarType ScarType, double BleedingDamage, double BleedingAmount, double MaxBleedingAmount);
	void Initialize(class USkeletalMeshComponent* InSkeletalMesh, class UDrawScarElementParameter* InDrawScarParameter);
	void InterruptDrawScar(int32 Count);
	void InterruptDrawScar_Tick(double DeltaSeconds);
	void IsCreatedResource(bool* Result);
	void IsElementValidIndex(int32 Index_0, bool* Result);
	void OnBloodFeed(const struct FVector& HitLocation_0, class USkeletalMeshComponent* Attacker);
	void OnBloodFeed_End(const struct FVector& Position);
	void OnDestroy();
	void OnDying();
	void OnUpdateBleedingAmountReduction(double PreBleedingAmount, double BleedingAmount);
	void Post_Process();
	void Post_Process_CaptureData(int32 CaptureIndex);
	void PreProcess();
	void PreProcess_CaptureData(int32 CaptureIndex, class USceneCaptureComponent2D* SceneCapture, class UTextureRenderTarget2D* RenderTarget);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveParticleData(const TArray<struct FBasicParticleData>& Data, class UNiagaraSystem* NiagaraSystem, const struct FVector& SimulationPositionOffset);
	void ReceiveTick(float DeltaSeconds);
	void ResourceProcess(double DeltaSeconds);
	void SetBloodFeedProcess();
	void SetCaptureSize(double CaptureSize_0);
	void SetEnableScar(bool bEnableScar_0);
	void SetNiagaraScar(bool bEnable);
	void SetScarScale(double ScarScale_0);
	void TickProcess(double DeltaSeconds);
	void UpdateBleedingAmountReduction(float InPreBleedingAmount, float InBleedingAmount);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DrawScar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DrawScar_C")
	}
	static class UBP_DrawScar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DrawScar_C>();
	}
};
DUMPER7_ASSERTS_UBP_DrawScar_C;

}

