#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DescriptionListData

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DescriptionListData.BP_DescriptionListData_C
// 0x0088 (0x00B0 - 0x0028)
class UBP_DescriptionListData_C final : public UObject
{
public:
	struct FDescriptionInfoTable                  DescriptionData;                                   // 0x0028(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FInstructionInfoTable                  InstructionData;                                   // 0x0060(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsDescription;                                     // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ListIndex;                                         // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetListIndex(int32 InIndex);
	void SetInstructionData(const struct FInstructionInfoTable& InData);
	void SetDescriptionData(const struct FDescriptionInfoTable& InDescriptionData);
	void IsDesctiptionData(bool* OutResult);
	void GetListIndex(int32* OutIndex);
	void GetInstructionData(struct FInstructionInfoTable* OutData);
	void GetDescriptionData(struct FDescriptionInfoTable* OutData);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DescriptionListData_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DescriptionListData_C")
	}
	static class UBP_DescriptionListData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_DescriptionListData_C>();
	}
};
DUMPER7_ASSERTS_UBP_DescriptionListData_C;

}

