#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ExplorationDialogUIObject

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ExplorationDialogUIObject.BP_ExplorationDialogUIObject_C.GetExplorationDialog
// 0x0020 (0x0020 - 0x0000)
struct BP_ExplorationDialogUIObject_C_GetExplorationDialog final
{
public:
	class UWDT_ExplorationDialog_C*               OutExplorationDialog;                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_ExplorationDialog_C*               K2Node_DynamicCast_AsWDT_Exploration_Dialog;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ExplorationDialogUIObject_C_GetExplorationDialog;

// Function BP_ExplorationDialogUIObject.BP_ExplorationDialogUIObject_C.HideExplorationDialog
// 0x0001 (0x0001 - 0x0000)
struct BP_ExplorationDialogUIObject_C_HideExplorationDialog final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ExplorationDialogUIObject_C_HideExplorationDialog;

// Function BP_ExplorationDialogUIObject.BP_ExplorationDialogUIObject_C.Open
// 0x0020 (0x0020 - 0x0000)
struct BP_ExplorationDialogUIObject_C_Open final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_ExplorationDialog_C*               K2Node_DynamicCast_AsWDT_Exploration_Dialog;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Open_ReturnValue;                         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ExplorationDialogUIObject_C_Open;

// Function BP_ExplorationDialogUIObject.BP_ExplorationDialogUIObject_C.ShowExplorationDialog
// 0x0030 (0x0030 - 0x0000)
struct BP_ExplorationDialogUIObject_C_ShowExplorationDialog final
{
public:
	class FText                                   InSpeaker;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   InStatement;                                       // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         InDuration;                                        // 0x0020(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ShowExplorationDialog_InDuration_ImplicitCast; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ExplorationDialogUIObject_C_ShowExplorationDialog;

}

