#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnemyVisualControl

#include "Basic.hpp"

#include "E_MortalSin_GhostRebirth_Type_structs.hpp"
#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"
#include "E_CharacterVisualControl_CharacterMode_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EnemyVisualControl.BP_EnemyVisualControl_C
// 0x00A0 (0x0380 - 0x02E0)
class alignas(0x10) UBP_EnemyVisualControl_C final : public UEnemyVisualControlComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UMaterialInstanceDynamic*>       CharacterMaterialArray;                            // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstanceDynamic*>       WeaponMaterialArray;                               // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bBloodThirstSign;                                  // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BloodThirstSign_Time;                              // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            BloodThirstSign_Curve;                             // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UVisualControlParameter*                VisualControlPalameter;                            // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterVisualControl_Implement_C* CharacterVisualControl_Implement;                  // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UEffectData*                            EffectData;                                        // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bInvaderWaveState;                                 // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InvaderWave_AppearTime;                            // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      EnvyEyes_Effect;                                   // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      RecoverHealthBegin_Effect;                         // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      GhostRebirth_Effect;                               // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         LODLevel;                                          // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      OilMiasmaEffect;                                   // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         GeneralVanishEffect_Asset;                         // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPoseableMeshComponent*                 GeneralVanishEffect_Mesh;                          // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AddOtherMesh(class FName InMeshName, class UMeshComponent* InMesh);
	void AppearBody(float InDuration);
	void AppearBody_Implement(double TotalDuration, bool bWeapon);
	void BeginBloodThirstSign();
	void BeginSoulBodyEffect();
	void BloodThirstSign_SetParameter(float Value);
	void DeacctivateSpecialEffectAlways();
	void DeactivateEnvyEyeEffect();
	void DeactivateGhostRebirthEffect();
	void DeactivateModalSinEffect();
	void Destroy();
	void EndBloodThirstSign();
	void EndSoulBodyEffect();
	void ExecuteUbergraph_BP_EnemyVisualControl(int32 EntryPoint);
	void GeneralWarpEffect_Begin(float InVanishTime);
	void GeneralWarpEffect_End(float InAppearTime);
	void Get_Draw_Scar_BP(class UBP_DrawScar_C** Result);
	void GetEnemyEffectSize(float* Result);
	void GetEnemySizeType(EEnemyAilmentEffectSizeType* Result);
	class UVisualControlParameter* GetVisualControlParameter();
	void Initialize();
	void InitializeDynamicMaterialInstanceAll();
	bool IsIntruderState();
	bool IsInvaderWaveState();
	void On_Enemy_Lod_Changed(int32 PrevLevel, int32 NextLevel);
	void OnBeginBloodThirstSign();
	void OnChangeCharacterMesh(class UVisualControlParameter* InVisualControlParameter, class USkeletalMeshComponent* InDrawScarMesh);
	bool OnDropWeapon();
	bool OnDying();
	bool OnEdgeEmissiveBegin(class UAnimSequenceBase* InAnimSequence, const struct FEdgeEmissive_Parameter& InParameter, float InTotalDuration);
	bool OnEdgeEmissiveEnd(class UAnimSequenceBase* InAnimSequence, const struct FEdgeEmissive_Parameter& InParameter);
	bool OnEdgeEmissiveTick(class UAnimSequenceBase* InAnimSequence, const struct FEdgeEmissive_Parameter& InParameter, float InDeltaTime);
	void OnEndBloodThirstSign();
	void OnInitializeVisualControl();
	void OnRecieveRecoverHealthEvent(class UNiagaraSystem* NiagaraSystem);
	bool OnSimpleAnimNotify_Begin(class UObject* InAnimNotifyObject, class UAnimSequenceBase* InAnimSequence, const class FName& InMessage, float InTotalDuration);
	bool OnSimpleAnimNotify_End(class UObject* InAnimNotifyObject, class UAnimSequenceBase* InAnimSequence, const class FName& InMessage);
	bool OnSimpleAnimNotify_Tick(class UObject* InAnimNotifyObject, class UAnimSequenceBase* InAnimSequence, const class FName& InMessage, float InDeltaTime);
	void OnSpawnEffectAlways(class UNiagaraComponent* InEffect, const class FName& InEffectName);
	void OnSpawnEffectRecoverHealth(class UNiagaraComponent* InEffect, const class FName& InEffectName);
	void OnTickBloodThirstSign(double DeltaSeconds);
	bool OnVanishBegin(class UAnimSequenceBase* InAnimSequence, const struct FVanish_Parameter& InParameter, float InTotalDuration);
	bool OnVanishEnd(class UAnimSequenceBase* InAnimSequence, const struct FVanish_Parameter& InParameter);
	void OnVanishMesh_Character_SetParameter(class UMaterialInstanceDynamic* Material, float Weight, class UMeshComponent* Mesh);
	void OnVanishMesh_Weapon_SetParameter(class UMaterialInstanceDynamic* Material, float Weight, class UMeshComponent* Mesh);
	bool OnVanishMeshBegin(class UAnimSequenceBase* InAnimSequence, const struct FVanishMesh_Parameter& InParameter, float InTotalDuration);
	bool OnVanishMeshEnd(class UAnimSequenceBase* InAnimSequence, const struct FVanishMesh_Parameter& InParameter);
	bool OnVanishMeshTick(class UAnimSequenceBase* InAnimSequence, const struct FVanishMesh_Parameter& InParameter, float InDeltaTime);
	bool OnVanishTick(class UAnimSequenceBase* InAnimSequence, const struct FVanish_Parameter& InParameter, float InDeltaTime);
	void OnWarpBegin();
	void OnWarpEnd();
	void OnWarpTick(double OpacityWeight);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveParticleData(const TArray<struct FBasicParticleData>& Data, class UNiagaraSystem* NiagaraSystem, const struct FVector& SimulationPositionOffset);
	void ReceiveTick(float DeltaSeconds);
	void ReinitializeVisualControl(class UVisualControlParameter* InVisualControlParameter);
	void ResetAppearBody();
	void ResetAppearBody_Implement();
	void ResetVanishBody();
	void ResetVanishBody_Implement();
	void ResetVanishDeath();
	void SetEffectSizeByEnemeySizeType(class UNiagaraComponent* InEffect);
	void SetGhostAlwaysVisibility(bool bVisibility, bool bEffect, bool bMesh);
	void SetIntruderState(bool bInEnable);
	void SetInvaderWaveState(bool bInEnable);
	void SlowEffect_Begin(float InEffectSize);
	void SlowEffect_End();
	void SlowEffect_EndNotice();
	void SlowEffect_Tick(float InDeltaTime);
	void SoulBodyEffect(double Weight, E_CharacterVisualControl_CharacterMode Mode);
	void SpawnEnvyEyeEffect();
	void SpawnGeneralVanishEffect();
	void SpawnGhostRebirthEffect(E_MortalSin_GhostRebirth_Type Type);
	void SpawnRecoverHealthEffect();
	void SpawnSpecialEffectAlways();
	void TickProcess(double DeltaSeconds);
	void VanishBody(float InDuration);
	void VanishBody_Implement(double TotalDuration, bool bWeapon);
	void VanishDeath(float InDuration);
	void VanishWeapon_Implement(bool bReverse, double Duration, int32 WeaponIndex);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_EnemyVisualControl_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_EnemyVisualControl_C")
	}
	static class UBP_EnemyVisualControl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_EnemyVisualControl_C>();
	}
};
DUMPER7_ASSERTS_UBP_EnemyVisualControl_C;

}

