#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FieldMenuUIObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicUI_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FieldMenuUIObject.BP_FieldMenuUIObject_C
// 0x03A8 (0x0C60 - 0x08B8)
class UBP_FieldMenuUIObject_C final : public UFieldMenuUIObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FMenuContext                           TutorialMenuContext;                               // 0x08C0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           KeywordMenuContext;                                // 0x08F8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           InventoryMenuContext;                              // 0x0930(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           StatusMenuContext;                                 // 0x0968(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           WeaponEquipmenMenuContext;                         // 0x09A0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           JailEquipmentMenuContext;                          // 0x09D8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           BloodCodeEquipmentMenuContext;                     // 0x0A10(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           BoosterEquipmentMenuContext;                       // 0x0A48(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           IndependentGadgetEquipmenMenuContext;              // 0x0A80(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           DefensiveGadgetEquipmenMenuContext;                // 0x0AB8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           ItemShortcutMenuContext;                           // 0x0AF0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           ConfigMenuContext;                                 // 0x0B28(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           ItemSyntheticMenuContext;                          // 0x0B60(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           SupportMenuContext;                                // 0x0B98(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UMenuBase*                              TutorialMenu;                                      // 0x0BD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              KeywordMenu;                                       // 0x0BD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              InventoryMenu;                                     // 0x0BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              StatusMenu;                                        // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              WeaponEquipmentMenu;                               // 0x0BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              JailEquipmentMenu;                                 // 0x0BF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              BloodCodeEquipmentMenu;                            // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              BoosterEquipmentMenu;                              // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              IndependentGadgetEquipmentMenu;                    // 0x0C10(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              DefensiveGadgetEquipmentMenu;                      // 0x0C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              ItemShortcutMenu;                                  // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              ConfigMenu;                                        // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              ItemSyntheticMenu;                                 // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              SupportMenu;                                       // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetWeaponSlotIndex;                             // 0x0C40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetBloodCodeSlotIndex;                          // 0x0C44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetBoosterSlotIndex;                            // 0x0C48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetItemShortcutSlotIndex;                       // 0x0C4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CurrentOpenMenu;                                   // 0x0C50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   LastSelectedFieldMenuPiece;                        // 0x0C58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FieldMenuUIObject(int32 EntryPoint);
	void GetLastSelectedPieceName(class FName* OutName);
	void GetTargetBloodCodeSlotIndex(int32* OutIndex);
	void GetTargetBoosterSlotIndex(int32* OutIndex);
	void GetTargetItemShortcutSlotIndex(int32* OutIndex);
	void GetTargetWeaponSlotIndex(int32* OutIndex);
	bool NotifyEquipmentEnabled(bool InEnabled);
	bool NotifyPlayerHealthUpdated(const float InCurrentHealth, const float InMaxHealth);
	bool NotifyPlayerStaminaUpdated(const int32 InCurrentStamina, const int32 InMaxStamina);
	bool NotifyPlayerStatusUpdated();
	void OnBloodCodeEquipmentMenuClosed();
	void OnBoosterEquipmentMenuClosed();
	void OnConfigurationMenuClosed();
	void OnDefensiveGadgetEquipmentMenuClosed();
	void OnIndependentGadgetEquipmentMenuClosed();
	void OnInventoryMenuClosed();
	void OnItemShortcutMenuClosed();
	void OnItemSyntheticMenuClosed();
	void OnJailEquipmentMenuClosed();
	void OnKeywordMenuClosed();
	void OnMatchingMenuClosed();
	void OnStatusMenuClosed();
	void OnSupportMenuClosed();
	void OnTutorialMenuClosed();
	void OnWeaponEquipmentMenuClosed();
	void OpenBloodCodeMenu(int32 InSlotIndex);
	void OpenBoosterMenu(int32 InSlotIndex);
	void OpenConfigurationMenu();
	void OpenDefensiveGadgetEquipmentMenu();
	void OpenIndependentGadgetEquipmentMenu();
	void OpenInventoryMenu();
	void OpenItemShortcutMenu(int32 InSlotIndex);
	void OpenItemSyntheticMenu();
	void OpenJailMenu();
	void OpenKeywordMenu();
	void OpenMatchingMenu();
	void OpenPhotoModeMenu();
	void OpenStatusMenu();
	void OpenSupportMenu();
	void OpenTutorialMenu();
	void OpenWeaponEquipmentMenu(int32 InSlotIndex);
	void SetLastSelectedPieceName(class FName InName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FieldMenuUIObject_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FieldMenuUIObject_C")
	}
	static class UBP_FieldMenuUIObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FieldMenuUIObject_C>();
	}
};
DUMPER7_ASSERTS_UBP_FieldMenuUIObject_C;

}

