#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MountVisualControl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MountVisualControl.BP_MountVisualControl_C
// 0x00B0 (0x03B0 - 0x0300)
#pragma pack(push, 0x1)
class alignas(0x10) UBP_MountVisualControl_C : public UMountVisualControlComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_CharacterVisualControl_Implement_C* CharacterVisualControl_Implement;                  // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bAppearMount;                                      // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AppearMount_CurrentTime;                           // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisappearMount;                                   // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DisappearMount_CurrentTime;                        // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AppearMount_TimeRange;                             // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DisappearMount_TimeRange;                          // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Vanish_Total_Duration;                             // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AppearMount_EffectTimeRange;                       // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         AppearMount_Line_EffectAsset;                      // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      AppearMount_Line_Effect;                           // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         AppearMount_Appear_EffectAsset;                    // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      AppearMount_Appear_Effect;                         // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        DisappearMount_EffectTimeRange;                    // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      DisppearMount_Line_Effect;                         // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bFourceFinishVanishBodyEvent;                      // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x3];                                      // 0x0381(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   TargetSocketName;                                  // 0x0384(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TargetHeadSocketName;                              // 0x038C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   RiderStartSocketName;                              // 0x0394(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUnsummonReason                               Reason;                                            // 0x039C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisappearMount_UseEffect;                         // 0x039D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39E[0x2];                                      // 0x039E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AppearMound_EffectCount;                           // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DisappearMount_EffectCount;                        // 0x03A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AppearBody(float InDuration);
	void AppearBody_Implement(double TotalDuration);
	void AppearMount();
	void DisappearMount(EUnsummonReason Reason_0);
	void ExecuteUbergraph_BP_MountVisualControl(int32 EntryPoint);
	void GetDriverCharacterSafe(class AActionHumanCharacter** Result);
	void Initialize();
	void OnAppearMound_EffectFinished(class UNiagaraComponent* PSystem);
	void OnAppearMount();
	void OnAppearMount_EffectEnd();
	void OnAppearMount_Tick(float DeltaSeconds);
	void OnDisappearMound_EffectFinished(class UNiagaraComponent* PSystem);
	void OnDisappearMound_VanishBody_EffectFinished();
	void OnDisappearMount(EUnsummonReason Reason_0);
	void OnDisappearMount_EffectEnd();
	void OnDisappearMount_Tick(float DeltaSeconds);
	void OnInitializeVisualControl();
	void ReceiveTick(float DeltaSeconds);
	void ResetAppearBody();
	void ResetAppearBody_Implement();
	void ResetVanishBody();
	void ResetVanishBody_Implement();
	void ResetVanishDeath();
	void SetAppearMountParameter(double Weight);
	void SetDIsppearMountParameter(double Weight);
	void TickProcess(float DeltaSeconds);
	void VanishBody(float InDuration);
	void VanishBody_Implement(double TotalDuration);
	void VanishDeath(float InDuration);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MountVisualControl_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MountVisualControl_C")
	}
	static class UBP_MountVisualControl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MountVisualControl_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UBP_MountVisualControl_C;

}

