#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapSystem

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"
#include "Engine_structs.hpp"
#include "STR_FeatureQuestList_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MapSystem.BP_MapSystem_C
// 0x0098 (0x0860 - 0x07C8)
class ABP_MapSystem_C final : public AMapSystem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x07C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TopLeftMapAreaTarget;                              // 0x07D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TopRightMapAreaTarget;                             // 0x07E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 BottomRightMapAreaTarget;                          // 0x07E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 BottomLeftMapAreaTarget;                           // 0x07F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          MapTargetsFound;                                   // 0x07F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F9[0x7];                                      // 0x07F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFieldTargetHandle>             UserMarkerFieldTargetHandleArray;                  // 0x0800(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<struct FGameplayTag, struct FSTR_FeatureQuestList> FeatureQuestMap;                         // 0x0810(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddUserMarkerFieldTarget(const struct FFieldTargetInfo& InFieldTargetInfo, struct FFieldTargetHandle* OutFieldTargetHandle, bool* OutSuccessful);
	void BuildFeatureLouDiaryMapData();
	void ClearFeatureQuestMap();
	void ExecuteUbergraph_BP_MapSystem(int32 EntryPoint);
	void FindMapAreaTargets(bool* Result);
	void Get3DLocation(const struct FVector2D& InLocation, struct FVector* OutLocation);
	void Get3Dto2DMapRatio(const struct FVector2D& In2DMapVector, struct FVector2D* OutMapVector);
	void GetCameraRotation2D(double* OutRotation);
	void GetInverted3DLocation(const struct FVector2D& InVector2D, struct FVector* OutVector3D);
	void GetInvertedMapLocation(const struct FVector& InLocation, struct FVector2D* OutLocation);
	TArray<class FName> GetLouDiaryIDByFeatureID(const struct FGameplayTag& InFeatureId);
	void GetMapHeight(double* OutHeight);
	void GetMapPosition2D(const struct FVector& InPos, const struct FVector2D& InMapSize2D, struct FVector2D* OutPos);
	void GetMapPosition3D(const struct FVector2D& InMapPositionUI, const struct FVector2D& InMapSize, struct FVector* OutVector3D);
	void GetMapWidth(double* OutHeight);
	void GetPlayerPosition2D(const struct FVector2D& InMapSize2D, struct FVector2D* OutPos);
	void GetPlayerRotation2D(double* OutRotation);
	void GetTopLeftOffsetLocation(const struct FVector& InLocation, struct FVector2D* OutLocation);
	void GetUserMarkerFieldTargetData(bool* bResult, TArray<struct FFieldTargetManageData>* OutFieldTargetInfo);
	void IsMapSystemReady(bool* OutReady);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void RemoveUserMarkerFieldTarget(const struct FFieldTargetHandle& InHandle);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MapSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MapSystem_C")
	}
	static class ABP_MapSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MapSystem_C>();
	}
};
DUMPER7_ASSERTS_ABP_MapSystem_C;

}

