#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Motorcycle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Motorcycle.BP_Motorcycle_C
// 0x0040 (0x0A70 - 0x0A30)
class ABP_Motorcycle_C final : public AAppWheeledVehiclePawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A30(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UJostleCapsuleComponent*                JostleCapsule1;                                    // 0x0A38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      VisibilityBlockCollision;                          // 0x0A40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UJostleCapsuleComponent*                JostleCapsule;                                     // 0x0A48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x0A50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           AkComponent_Engine;                                // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DM_Frame;                                          // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DM_Body;                                           // 0x0A68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__BP_Motorcycle_VehicleMovementComponent_K2Node_ComponentBoundEvent_3_OnStartDrift__DelegateSignature();
	void BndEvt__BP_Motorcycle_VehicleMovementComponent_K2Node_ComponentBoundEvent_4_OnEndDrift__DelegateSignature();
	void BndEvt__BP_Motorcycle_VehicleMovementComponent_K2Node_ComponentBoundEvent_5_OnJump__DelegateSignature();
	void BndEvt__BP_TestChaosWheelVehicle_VehicleMovementComponent_K2Node_ComponentBoundEvent_0_ChangeGlideInputSignature__DelegateSignature(bool InValue);
	void CheckOverlapWing(class UBoxComponent* WingCollision);
	void CheckOverlapWings();
	void ExecuteUbergraph_BP_Motorcycle(int32 EntryPoint);
	class UBoxComponent* GetWingLCollision();
	class UBoxComponent* GetWingRCollision();
	void OnCrashEvent();
	void OnDriverGettingOff(class AActionHumanCharacter* Driver);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UpdateSound();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Motorcycle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Motorcycle_C")
	}
	static class ABP_Motorcycle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Motorcycle_C>();
	}
};
DUMPER7_ASSERTS_ABP_Motorcycle_C;

}

