#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerEquipmentVisualControl_Weapon

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "STR_PEVC_AppearEquipment_Data_structs.hpp"
#include "BP_PlayerEquipmentVisualControl_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerEquipmentVisualControl_Weapon.BP_PlayerEquipmentVisualControl_Weapon_C
// 0x02A0 (0x04D8 - 0x0238)
class UBP_PlayerEquipmentVisualControl_Weapon_C final : public UBP_PlayerEquipmentVisualControl_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class USkeletalMeshComponent*, struct FSTR_PEVC_AppearEquipment_Data> AppearEquipment_DataMap; // 0x0240(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	double                                        AppearEquipment_TotalDuration;                     // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEffectData*                            EffectData;                                        // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         WeaponAppearEffect_Asset;                          // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         WeaponDisappearEffect_Asset;                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          AppearEquipment_SpawnEffect;                       // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class USkeletalMeshComponent*, class UBP_VanishBodyEffect_C*> AppearEquipment_VanishBodyEffectMap_0; // 0x02B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class USkeletalMeshComponent*, class UNiagaraComponent*> Enchant_EffectMap;                 // 0x0308(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class USkeletalMeshComponent*, struct FGameplayCueParameters> Enchant_GCMap;                // 0x0358(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TSet<class UNiagaraComponent*>                AppearEquipment_ChildEffectSet;                    // 0x03A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FGameplayCueParameters                 Enchant_GC;                                        // 0x03F8(0x00D8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          AppearEquipment_IsDisappear;                       // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AppearEquipment_SummonInitialize;                  // 0x04D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBuddy;                                           // 0x04D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AppearEquipment(class USkeletalMeshComponent* InMesh);
	void AppearEquipment_ActiveChildEffect(class USkeletalMeshComponent* EquipmentMesh);
	void AppearEquipment_AddChildEffect(class UNiagaraComponent* Effect);
	void AppearEquipment_AllMesh();
	void AppearEquipment_CheckVisibility(bool Appear, class USkeletalMeshComponent* EquipmentMesh, bool* Result);
	void AppearEquipment_DeactiveChildEffect(class USkeletalMeshComponent* EquipmentMesh);
	void AppearEquipment_GetData(class USkeletalMeshComponent* EquipmentMesh, struct FSTR_PEVC_AppearEquipment_Data* Data, bool* bResult);
	void AppearEquipment_GetState(class USkeletalMeshComponent* EquipmentMesh, bool* bAppear, bool* bDisappear);
	void AppearEquipment_OnFinish(class UBP_VanishBodyEffect_C* Instance);
	void AppearEquipment_OnSummonInitializeBegin();
	void AppearEquipment_OnSummonInitializeEnd();
	void AppearEquipment_OnTick(double DeltaSeconds);
	void AppearEquipment_RemoveChildEffect(class UNiagaraComponent* Effect);
	void DisappearEquipment(class USkeletalMeshComponent* InMesh);
	void DisappearEquipment_AllMesh();
	void Enchant_DeactivateEffect(const class USkeletalMeshComponent*& WeaponMesh);
	void Enchant_SpawnEffect(E_EnchantEffect_Type Type, class USkeletalMeshComponent* WeaponMesh);
	void EnchantEffect(E_EnchantEffect_Type InType, bool bInEnable, class USkeletalMeshComponent* InWeaponMesh);
	void EnchantEffectAllMeshByGCTag(const struct FGameplayTag& InGCTag, bool bInEnable);
	void EnchantEffectByGCTag(const struct FGameplayTag& InGCTag, bool bInEnable, class USkeletalMeshComponent* InWeaponMesh);
	void ExecuteUbergraph_BP_PlayerEquipmentVisualControl_Weapon(int32 EntryPoint);
	void GetAppearEquipmentData(class USkeletalMeshComponent* EquipmentMesh, struct FSTR_PEVC_AppearEquipment_Data* Data, bool* Result);
	void GetAttachInfoByName(class FName EffectName, bool* Result, class USkeletalMeshComponent** AttachComponent, class FName* AttachSocketName);
	void GetAttachMeshArray(bool* Result, TArray<class USkeletalMeshComponent*>* MeshArray);
	void GetEffectAssetByName(class FName EffectName, bool* Result, class UNiagaraSystem** EffectAsset);
	void InitializeAppearEquipment(bool bAppear);
	void OnDeactivateEffect(class UNiagaraComponent* Effect);
	void OnDestroy();
	bool OnFinishCinematicEvent();
	void OnInitializeVisualControl();
	void OnSpawnEffect(class UNiagaraComponent* Effect);
	bool OnStartCinematicEvent();
	void OnTick(double DeltaSeconds);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveTick(float DeltaSeconds);
	void ResetAppearEquipment(class USkeletalMeshComponent* InMesh);
	void ResetDisappearEquipment(class USkeletalMeshComponent* InMesh);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PlayerEquipmentVisualControl_Weapon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PlayerEquipmentVisualControl_Weapon_C")
	}
	static class UBP_PlayerEquipmentVisualControl_Weapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerEquipmentVisualControl_Weapon_C>();
	}
};
DUMPER7_ASSERTS_UBP_PlayerEquipmentVisualControl_Weapon_C;

}

