#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlayerVisualControl

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"
#include "E_CharacterVisualControl_CharacterMode_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlayerVisualControl.BP_PlayerVisualControl_C
// 0x0250 (0x0590 - 0x0340)
class UBP_PlayerVisualControl_C final : public UPlayerVisualControlComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_Damage_Screen_C*                    Damage_Screen_Component;                           // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bDrawSuperArmerHitEffect_Process;                  // 0x0350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DrawSuperArmerHitEffect_Time;                      // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DrawSuperArmerHitEffect_Duration;                  // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            DrawSuperArmerHitEffect_Curve;                     // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             BloodMovement_Enemy;                               // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          BloodMovement_ToPlayer;                            // 0x0378(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          BloodMovement_AudioEvent;                          // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_InteractionCollisionComponent_C*    BP_InteractionCollision;                           // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_Damage_Screen_C*                    BloodSuck_Screen_Component;                        // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Damage_Screen_Material;                            // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     BloodSuck_Screen_Material;                         // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 BloodVessel_Mesh;                                  // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          BloodVessel_EnableOpacityBegin;                    // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          BloodVessel_Enable;                                // 0x03B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBuddyPossessProcess;                              // 0x03B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B3[0x5];                                      // 0x03B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeletalMeshComponent*>         AdditionalCustomStencilMeshArray;                  // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UNiagaraComponent*                      BuddyPossessEffect;                                // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterVisualControl_Implement_C* CharacterVisualControl_Implement;                  // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_StatusEffect_Rinne_C*               StatusEffect_Rinne;                                // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          BodyTrailEffect_EnableNotify;                      // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             CharacterMaterialLoopArray;                        // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInterface*>             WeaponMaterialLoopArray;                           // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInterface*>             OtherMeshMaterialLoopArray;                        // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          BloodVessel_EnableOpacityEnd;                      // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BloodVessel_OpacityBeginDuration;                  // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BloodVessel_OpacityEndDuration;                    // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BloodVessel_OpacityCurrentTime;                    // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bGuestState;                                       // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GuestState_AppearTime;                             // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMatchingState;                                    // 0x0448(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x3];                                      // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeTravelFastTravel_Duration;                     // 0x044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TimeTravelFastTravel_Enable;                       // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      TimeTravelFastTravel_Effect;                       // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        TimeTravelFastTravel_CurrentTime;                  // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TimeTravelFastTravel_EnablePP;                     // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDynamicPostProcessHandle              TimeTravelFastTravel_PPHandle;                     // 0x0470(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UMaterialInterface*                     TimeTravelFastTravel_Material_Asset;               // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        TimeTravelFastTravel_PPTiming;                     // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRuntimeFloatCurve                     TimeTravelFastTravel_PPCurve;                      // 0x0488(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        SeeThroughDistance;                                // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBuddy;                                           // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_519[0x7];                                      // 0x0519(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DisplayMoveHistory3D_C*             BP_DisplayMoveHistory3D;                           // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        MoveHistory3D_DeactivateTimeRange;                 // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MoveHistory3D_Middle_History_Index;                // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        GiftHeal_BloodVessel_AppearTime;                   // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GiftHeal_BloodVessel_VanishTime;                   // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GiftHeal_BloodVessel_EmissiveColor;                // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Budy_BloodVessel_AppearTime;                       // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Budy_BloodVessel_VanishTime;                       // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Budy_BloodVessel_EmissiveColor;                    // 0x0568(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CustomizeShadowMeshArray;                          // 0x0578(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void AddAdditionalCustomStencilMesh(const class USkeletalMeshComponent*& Mesh);
	void AddOtherMesh(class FName InMeshName, class UMeshComponent* InMesh);
	void AppearBody(float InDuration);
	void AppearBody_Implement(double TotalDuration, bool bWeapon);
	void BeginBodyTrailEffect();
	void BeginBuddyPossessProcess();
	void BeginSoulBodyEffect();
	void Blood_Vessel_Tick(double DeltaSeconds);
	void BloodVessel_Initialize();
	void BloodVessel_SetMode(bool bGiftHeel);
	void BloodVessel_SetOpacityWeight(float Weight);
	void BodyTrailEffect_SetEffect(class UNiagaraSystem* BodyTrailAsset);
	void BodyTrailEffect_SetEnableNotify(bool bEnable);
	void BodyTrailEffect_SetMaxCount(const class UANS_BodyTrailEffect_C* BodyTrailEffect);
	void ClearAllOtherMesh();
	void DeactivateDisplayMoveHistory3D();
	void Destroy();
	void DestroyDisplayMoveHistory3D();
	void DisplayMoveHistory3D_SetDeactivateTimer(bool bEnable, double TimeRange);
	void DisplayMoveHistory3D_SetMIddleHistoryIndex(int32 MiddleHistoryIndex);
	void DrawBloodMovement_HitEvent(const struct FVector& Position);
	void DrawBloodMovement_Implement(class ACharacter* Enemy, bool ToPlayer, int32 EffectCount);
	void DrawBloodMovementEnemyToPlayer(class ACharacter* InEnemy, int32 EffectCount);
	void DrawBloodMovementPlayerToEnemy(class ACharacter* InEnemy, int32 EffectCount);
	void DrawBloodSuckHitScreenEffect();
	void DrawDamageScreenEffect();
	void DrawSuperArmerHitEffect();
	void DrawSuperArmerHitEffect_Implement();
	void EndBodyTrailEffect();
	void EndBuddyPossessProcess();
	void EndSoulBodyEffect();
	void ExecuteUbergraph_BP_PlayerVisualControl(int32 EntryPoint);
	TArray<class UMeshComponent*> GetAllOtherMesh();
	void Initialize();
	void IsActiveDisplayMoveHistory3D(bool* Result);
	void IsCurveExists(class USkeletalMeshComponent* Mesh, class FName CurveName, bool* Result);
	bool IsGuestState();
	bool IsMatchingState();
	void MoveHistory3D_Deactivate();
	bool MoveHistory3D_IsActive();
	void MoveHistory3D_SetDeactivateTime(bool bInEnable, float InTimeRange);
	void MoveHistory3D_SetMiddleHistoryIndex(int32 InMiddleHistoryIndex);
	void MoveHistory3D_SetVisibility(bool Visibility);
	void MoveHistory3D_Spawn();
	bool OnBeginBuff(EPlayerBuffType InBuffType);
	void OnChangeWeaponType(EPlayerWeaponType InNextType);
	void OnChangeWeaponType_Implement(EPlayerWeaponType NextType);
	bool OnCharacterCustomizeFinishedEvent();
	void OnDrawBloodSuckHitScreenEffect();
	void OnDrawDamageScreenEffect();
	bool OnEdgeEmissiveBegin(class UAnimSequenceBase* InAnimSequence, const struct FEdgeEmissive_Parameter& InParameter, float InTotalDuration);
	bool OnEdgeEmissiveEnd(class UAnimSequenceBase* InAnimSequence, const struct FEdgeEmissive_Parameter& InParameter);
	bool OnEdgeEmissiveTick(class UAnimSequenceBase* InAnimSequence, const struct FEdgeEmissive_Parameter& InParameter, float InDeltaTime);
	bool OnEndBuff(EPlayerBuffType InBuffType);
	bool OnFinishCinematicEvent();
	bool OnFinishPhotoModeEvent();
	void OnGiftHealAppliedEvent();
	void OnInitializeVisualControl();
	void OnReadyToConsumeGiftHealEvent();
	bool OnResetCurveValueEnd(E_ANS_MeshType InMeshType, class FName CurveName, E_ANS_CurveWeightEndBehavior EndBehavior, float ResetValue);
	bool OnSimpleAnimNotify_Begin(class UObject* InAnimNotifyObject, class UAnimSequenceBase* InAnimSequence, const class FName& InMessage, float InTotalDuration);
	bool OnSimpleAnimNotify_End(class UObject* InAnimNotifyObject, class UAnimSequenceBase* InAnimSequence, const class FName& InMessage);
	bool OnSimpleAnimNotify_Tick(class UObject* InAnimNotifyObject, class UAnimSequenceBase* InAnimSequence, const class FName& InMessage, float InDeltaTime);
	bool OnStartCinematicEvent();
	bool OnStartPhotoModeEvent();
	bool OnVanishBegin(class UAnimSequenceBase* InAnimSequence, const struct FVanish_Parameter& InParameter, float InTotalDuration);
	bool OnVanishEnd(class UAnimSequenceBase* InAnimSequence, const struct FVanish_Parameter& InParameter);
	void OnVanishMesh_Character_SetParameter(class UMaterialInstanceDynamic* Material, float Weight, class UMeshComponent* Mesh);
	void OnVanishMesh_Weapon_SetParameter(class UMaterialInstanceDynamic* Material, float Weight, class UMeshComponent* Mesh);
	bool OnVanishMeshBegin(class UAnimSequenceBase* InAnimSequence, const struct FVanishMesh_Parameter& InParameter, float InTotalDuration);
	bool OnVanishMeshEnd(class UAnimSequenceBase* InAnimSequence, const struct FVanishMesh_Parameter& InParameter);
	bool OnVanishMeshTick(class UAnimSequenceBase* InAnimSequence, const struct FVanishMesh_Parameter& InParameter, float InDeltaTime);
	bool OnVanishTick(class UAnimSequenceBase* InAnimSequence, const struct FVanish_Parameter& InParameter, float InDeltaTime);
	void ReceiveBeginPlay();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveParticleData(const TArray<struct FBasicParticleData>& Data, class UNiagaraSystem* NiagaraSystem, const struct FVector& SimulationPositionOffset);
	void ReceiveTick(float DeltaSeconds);
	void ResetAppearBody();
	void ResetAppearBody_Implement(bool Weapon);
	void ResetCharacter(const ECharacterResetType InType);
	void ResetVanishBody();
	void ResetVanishBody_Implement(bool Weapon);
	void ResetVanishDeath();
	void ResetVanishWeapon(bool bReverse, int32 InWeaponIndex);
	void ResetVanishWeapon_Implement(bool bReverse, int32 WeaponIndex);
	void SeeThrough_SetCustomDepth(class UMeshComponent* Mesh, bool bEnable, bool DrawMainPass);
	void SeeThrough_SetCustomDepth_All(bool NearCamera);
	void SeeThrough_SetSeeThroughDistance(double SeeThroughDistance_0);
	void SeeThroughNearCamera();
	void Set_Super_Armer_Hit_Effect_Scale(double Value);
	void SetGuestState(bool bInEnable);
	void SetMatchingState(bool bInEnable);
	void SetPlayerCustomStencil();
	void SetStatusEffect_Rinne(bool bEnable);
	void SetVisibilityMesh(bool bVisibility, bool bCharacter, bool bWeapon, bool bOther);
	void SlowEffect_Begin(float InEffectSize);
	void SlowEffect_End();
	void SlowEffect_EndNotice();
	void SlowEffect_Tick(float InDeltaTime);
	void SoulBodyEffect(double Weight, E_CharacterVisualControl_CharacterMode Mode);
	void SpawnDisplayMoveHistory3D();
	void StatusEffect_Tick(double DeltaSeconds);
	void SummonBody();
	void SummonBody_Begin_FromSequence();
	void SummonBody_FromSequence();
	void TickProcess(double DeltaSeconds);
	void TimeTravelFastTravel_CreatePostProcess();
	void TimeTravelFastTravel_DestroyPostProcess();
	void TimeTravelFastTravel_End();
	void TimeTravelFastTravel_Tick(double DeltaSeconds);
	void TimeTravelFastTravelEvent(float InDuration);
	void UnsummonBody();
	void UnsummonBody_FromSequence();
	void VanishBody(float InDuration);
	void VanishBody_Implement(double TotalDuration, bool bWeapon);
	void VanishDeath(float InDuration);
	void VanishWeapon(bool bReverse, float InDuration, int32 InWeaponIndex);
	void VanishWeapon_Implement(bool bReverse, double Duration, int32 WeaponIndex);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PlayerVisualControl_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PlayerVisualControl_C")
	}
	static class UBP_PlayerVisualControl_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_PlayerVisualControl_C>();
	}
};
DUMPER7_ASSERTS_UBP_PlayerVisualControl_C;

}

