#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SupportMenuDescriptionItemData

#include "Basic.hpp"

#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function BP_SupportMenuDescriptionItemData.BP_SupportMenuDescriptionItemData_C.SetInstructionData
// 0x0048 (0x0048 - 0x0000)
struct BP_SupportMenuDescriptionItemData_C_SetInstructionData final
{
public:
	struct FInstructionInfoTable                  InData;                                            // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_BP_SupportMenuDescriptionItemData_C_SetInstructionData;

// Function BP_SupportMenuDescriptionItemData.BP_SupportMenuDescriptionItemData_C.SetDescriptionData
// 0x0038 (0x0038 - 0x0000)
struct BP_SupportMenuDescriptionItemData_C_SetDescriptionData final
{
public:
	struct FDescriptionInfoTable                  InDescriptionData;                                 // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_BP_SupportMenuDescriptionItemData_C_SetDescriptionData;

// Function BP_SupportMenuDescriptionItemData.BP_SupportMenuDescriptionItemData_C.GetTitleText
// 0x0010 (0x0010 - 0x0000)
struct BP_SupportMenuDescriptionItemData_C_GetTitleText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuDescriptionItemData_C_GetTitleText;

// Function BP_SupportMenuDescriptionItemData.BP_SupportMenuDescriptionItemData_C.GetTexture
// 0x0028 (0x0028 - 0x0000)
struct BP_SupportMenuDescriptionItemData_C_GetTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              OutTexture;                                        // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuDescriptionItemData_C_GetTexture;

// Function BP_SupportMenuDescriptionItemData.BP_SupportMenuDescriptionItemData_C.GetIsDesctiptionData
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuDescriptionItemData_C_GetIsDesctiptionData final
{
public:
	bool                                          OutResult;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuDescriptionItemData_C_GetIsDesctiptionData;

// Function BP_SupportMenuDescriptionItemData.BP_SupportMenuDescriptionItemData_C.GetInstructionData
// 0x0048 (0x0048 - 0x0000)
struct BP_SupportMenuDescriptionItemData_C_GetInstructionData final
{
public:
	struct FInstructionInfoTable                  OutData;                                           // 0x0000(0x0048)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuDescriptionItemData_C_GetInstructionData;

// Function BP_SupportMenuDescriptionItemData.BP_SupportMenuDescriptionItemData_C.GetDescriptionText
// 0x0010 (0x0010 - 0x0000)
struct BP_SupportMenuDescriptionItemData_C_GetDescriptionText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuDescriptionItemData_C_GetDescriptionText;

// Function BP_SupportMenuDescriptionItemData.BP_SupportMenuDescriptionItemData_C.GetDescriptionData
// 0x0038 (0x0038 - 0x0000)
struct BP_SupportMenuDescriptionItemData_C_GetDescriptionData final
{
public:
	struct FDescriptionInfoTable                  OutData;                                           // 0x0000(0x0038)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuDescriptionItemData_C_GetDescriptionData;

// Function BP_SupportMenuDescriptionItemData.BP_SupportMenuDescriptionItemData_C.GetCategoryKeyList
// 0x0010 (0x0010 - 0x0000)
struct BP_SupportMenuDescriptionItemData_C_GetCategoryKeyList final
{
public:
	TArray<class FName>                           OutCategoryList;                                   // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuDescriptionItemData_C_GetCategoryKeyList;

}

