#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StatusEffect_Rinne

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StatusEffect_Rinne.BP_StatusEffect_Rinne_C
// 0x0158 (0x0180 - 0x0028)
class UBP_StatusEffect_Rinne_C final : public UAppWorldObject
{
public:
	bool                                          bEffectBegin;                                      // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        EffectBegin_Time;                                  // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EffectBegin_TimeRange;                             // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRuntimeFloatCurve                     EffectBegin_Curve_Weight;                          // 0x0040(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bEffectEnd;                                        // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        EffectEnd_Time;                                    // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EffectEnd_TimeRange;                               // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRuntimeFloatCurve                     EffectEnd_Curve_Weight;                            // 0x00E0(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMeshComponent*>                 MeshArray;                                         // 0x0168(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         MaterialLayerIndex;                                // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActiveEffect();
	void DeactiveEffect();
	void InitializeEffect(class AActor* TargetActor);
	void OnTick(float Delta_Seconds);
	void SetMaterialParameter(const float Weight);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_StatusEffect_Rinne_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_StatusEffect_Rinne_C")
	}
	static class UBP_StatusEffect_Rinne_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_StatusEffect_Rinne_C>();
	}
};
DUMPER7_ASSERTS_UBP_StatusEffect_Rinne_C;

}

