#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SmallScenario_Valentin_Yadorigi

#include "Basic.hpp"

#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function BP_SmallScenario_Valentin_Yadorigi.BP_SmallScenario_Valentin_Yadorigi_C.ExecuteUbergraph_BP_SmallScenario_Valentin_Yadorigi
// 0x0018 (0x0018 - 0x0000)
struct BP_SmallScenario_Valentin_Yadorigi_C_ExecuteUbergraph_BP_SmallScenario_Valentin_Yadorigi final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ASmallScenarioBase>         CallFunc_SelectSmallScenario_ScenarioClass;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_SelectSmallScenario_NoChoises;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESmallScenarioResult                          CallFunc_PlayInternalSmallScenario_Result;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SmallScenario_Valentin_Yadorigi_C_ExecuteUbergraph_BP_SmallScenario_Valentin_Yadorigi;

}

