#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SupportMenuUIObject

#include "Basic.hpp"

#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function BP_SupportMenuUIObject.BP_SupportMenuUIObject_C.ExecuteUbergraph_BP_SupportMenuUIObject
// 0x0030 (0x0030 - 0x0000)
struct BP_SupportMenuUIObject_C_ExecuteUbergraph_BP_SupportMenuUIObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuBase*                              CallFunc_GetMenu_ReturnValue;                      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_SupportMenu_C*                     K2Node_DynamicCast_AsWDT_Support_Menu;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESupportMenuControlType                       K2Node_Event_InType;                               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuUIObject_C_ExecuteUbergraph_BP_SupportMenuUIObject;

// Function BP_SupportMenuUIObject.BP_SupportMenuUIObject_C.OnChangeSupportMenuControlType
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuUIObject_C_OnChangeSupportMenuControlType final
{
public:
	ESupportMenuControlType                       InType;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuUIObject_C_OnChangeSupportMenuControlType;

// Function BP_SupportMenuUIObject.BP_SupportMenuUIObject_C.SetSelectToItemID
// 0x0020 (0x0020 - 0x0000)
struct BP_SupportMenuUIObject_C_SetSelectToItemID final
{
public:
	class FName                                   InID;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_SupportMenu_C*                     K2Node_DynamicCast_AsWDT_Support_Menu;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuUIObject_C_SetSelectToItemID;

}

