#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SupportMenuLouDiarydItemData

#include "Basic.hpp"

#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function BP_SupportMenuLouDiarydItemData.BP_SupportMenuLouDiarydItemData_C.SetLouDiaryData
// 0x00D0 (0x00D0 - 0x0000)
struct BP_SupportMenuLouDiarydItemData_C_SetLouDiaryData final
{
public:
	struct FLouDiaryDataTableRow                  InLouDiaryData;                                    // 0x0000(0x00D0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_BP_SupportMenuLouDiarydItemData_C_SetLouDiaryData;

// Function BP_SupportMenuLouDiarydItemData.BP_SupportMenuLouDiarydItemData_C.GetTitleText
// 0x0010 (0x0010 - 0x0000)
struct BP_SupportMenuLouDiarydItemData_C_GetTitleText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuLouDiarydItemData_C_GetTitleText;

// Function BP_SupportMenuLouDiarydItemData.BP_SupportMenuLouDiarydItemData_C.GetTexture
// 0x0028 (0x0028 - 0x0000)
struct BP_SupportMenuLouDiarydItemData_C_GetTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              OutTexture;                                        // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuLouDiarydItemData_C_GetTexture;

// Function BP_SupportMenuLouDiarydItemData.BP_SupportMenuLouDiarydItemData_C.GetLouDiaryData
// 0x00D0 (0x00D0 - 0x0000)
struct BP_SupportMenuLouDiarydItemData_C_GetLouDiaryData final
{
public:
	struct FLouDiaryDataTableRow                  OutLouDiaryData;                                   // 0x0000(0x00D0)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuLouDiarydItemData_C_GetLouDiaryData;

// Function BP_SupportMenuLouDiarydItemData.BP_SupportMenuLouDiarydItemData_C.GetDescriptionTextFinished
// 0x0018 (0x0018 - 0x0000)
struct BP_SupportMenuLouDiarydItemData_C_GetDescriptionTextFinished final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0010)(Parm, OutParm)
	bool                                          CallFunc_GetIsQuestDeactivate_bOutIsQuestDisable;  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuLouDiarydItemData_C_GetDescriptionTextFinished;

// Function BP_SupportMenuLouDiarydItemData.BP_SupportMenuLouDiarydItemData_C.GetDescriptionText
// 0x0010 (0x0010 - 0x0000)
struct BP_SupportMenuLouDiarydItemData_C_GetDescriptionText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuLouDiarydItemData_C_GetDescriptionText;

// Function BP_SupportMenuLouDiarydItemData.BP_SupportMenuLouDiarydItemData_C.GetCategoryKeyList
// 0x0010 (0x0010 - 0x0000)
struct BP_SupportMenuLouDiarydItemData_C_GetCategoryKeyList final
{
public:
	TArray<class FName>                           OutCategoryList;                                   // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuLouDiarydItemData_C_GetCategoryKeyList;

}

