#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SmallScenario_Lyle_Yadorigi

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_SmallScenarioBase_classes.hpp"
#include "Extensions_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SmallScenario_Lyle_Yadorigi.BP_SmallScenario_Lyle_Yadorigi_C
// 0x0080 (0x0410 - 0x0390)
class ABP_SmallScenario_Lyle_Yadorigi_C final : public ABP_SmallScenarioBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SmallScenario_Lyle_Yadorigi_C;   // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           Buddy;                                             // 0x0398(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class UClass*>              PresentScenarioMap;                                // 0x03A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UDataTable*                             CharaEpSelectorData;                               // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             GreetingSelectorData;                              // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             PresentResponseDT;                                 // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             FarewellSelectorData;                              // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Abort();
	void Complete();
	void End();
	void ExecuteUbergraph_BP_SmallScenario_Lyle_Yadorigi(int32 EntryPoint);
	void Start();
	void StartScenario();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SmallScenario_Lyle_Yadorigi_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SmallScenario_Lyle_Yadorigi_C")
	}
	static class ABP_SmallScenario_Lyle_Yadorigi_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SmallScenario_Lyle_Yadorigi_C>();
	}
};
DUMPER7_ASSERTS_ABP_SmallScenario_Lyle_Yadorigi_C;

}

