#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SupportMenuItemDataBase

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C
// 0x0038 (0x0060 - 0x0028)
class UBP_SupportMenuItemDataBase_C : public UObject
{
public:
	TMulticastInlineDelegate<void(bool InIsExpansion)> OnChangeExpansion;                            // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsCategory;                                       // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bIsExpansion;                                      // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ItemKeyName;                                       // 0x003C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          DisplayNewFlag;                                    // 0x0044(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool InIsNew)>  OnChangeNewFlag;                                   // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsQuestClear;                                      // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFeatureIconVisibility;                            // 0x0059(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFeatureIconGrayOut;                               // 0x005A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFeatureReleased;                                // 0x005B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsQuestDeactivate;                                // 0x005C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetIsQuestDeactivate(bool bInIsQuestDisable);
	void SetIsQuestClear(bool IsEnable);
	void SetIsFeatureReleased(bool bInIsFeatureReleased);
	void SetIsFeatureIconVisibility(bool InVisible);
	void SetIsFeatureIconGrayOut(bool InGrayOut);
	void SetIsExpansion(bool InFlag);
	void SetDisplayNewFlag(bool InFlag);
	void GetTitleText(class FText* OutText);
	void GetTexture(TSoftObjectPtr<class UTexture2D>* OutTexture);
	void GetItemKeyName(class FName* OutKeyName);
	void GetIsQuestDeactivate(bool* bOutIsQuestDisable);
	void GetIsQuestClear(bool* IsEnable);
	void GetIsFeatureReleased(bool* OutIsFeatureReleased);
	void GetIsFeatureIconVisibility(bool* OutVisibility);
	void GetIsFeatureIconGrayOut(bool* OutGrayOut);
	void GetIsExpansion(bool* OutFlag);
	void GetIsCategory(bool* OutIsCategory);
	void GetDisplayNewFlag(bool* OutFlag);
	void GetDescriptionTextFinished(class FText* OutText);
	void GetDescriptionText(class FText* OutText);
	void GetCategoryKeyList(TArray<class FName>* OutCategoryList);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SupportMenuItemDataBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SupportMenuItemDataBase_C")
	}
	static class UBP_SupportMenuItemDataBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SupportMenuItemDataBase_C>();
	}
};
DUMPER7_ASSERTS_UBP_SupportMenuItemDataBase_C;

}

