#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScreenMaskUIObject

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ScreenMaskUIObject.BP_ScreenMaskUIObject_C.ExecuteUbergraph_BP_ScreenMaskUIObject
// 0x0020 (0x0020 - 0x0000)
struct BP_ScreenMaskUIObject_C_ExecuteUbergraph_BP_ScreenMaskUIObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_ScreenMask_C*                      CallFunc_GetScreenMask_OutIndicator;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_InVisible;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_ScreenMask_C*                      CallFunc_GetScreenMask_OutIndicator_1;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ScreenMaskUIObject_C_ExecuteUbergraph_BP_ScreenMaskUIObject;

// Function BP_ScreenMaskUIObject.BP_ScreenMaskUIObject_C.GetScreenMask
// 0x0020 (0x0020 - 0x0000)
struct BP_ScreenMaskUIObject_C_GetScreenMask final
{
public:
	class UWDT_ScreenMask_C*                      OutIndicator;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_ScreenMask_C*                      K2Node_DynamicCast_AsWDT_Screen_Mask;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ScreenMaskUIObject_C_GetScreenMask;

// Function BP_ScreenMaskUIObject.BP_ScreenMaskUIObject_C.HideScreenMaskBP
// 0x0020 (0x0020 - 0x0000)
struct BP_ScreenMaskUIObject_C_HideScreenMaskBP final
{
public:
	float                                         InHideTime;                                        // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EScreenMaskEffectType                         InEffectType;                                      // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_ScreenMask_C*                      CallFunc_GetScreenMask_OutIndicator;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_HideScreenMask_InHideTime_ImplicitCast;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ScreenMaskUIObject_C_HideScreenMaskBP;

// Function BP_ScreenMaskUIObject.BP_ScreenMaskUIObject_C.HideTipsBP
// 0x0018 (0x0018 - 0x0000)
struct BP_ScreenMaskUIObject_C_HideTipsBP final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_ScreenMask_C*                      CallFunc_GetScreenMask_OutIndicator;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ScreenMaskUIObject_C_HideTipsBP;

// Function BP_ScreenMaskUIObject.BP_ScreenMaskUIObject_C.SetScreenMaskVisibilityForcibly
// 0x0001 (0x0001 - 0x0000)
struct BP_ScreenMaskUIObject_C_SetScreenMaskVisibilityForcibly final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ScreenMaskUIObject_C_SetScreenMaskVisibilityForcibly;

// Function BP_ScreenMaskUIObject.BP_ScreenMaskUIObject_C.ShowScreenMaskBP
// 0x0030 (0x0030 - 0x0000)
struct BP_ScreenMaskUIObject_C_ShowScreenMaskBP final
{
public:
	struct FLinearColor                           InColor;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InMaskTime;                                        // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EScreenMaskEffectType                         InEffectType;                                      // 0x0014(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0015(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_ScreenMask_C*                      CallFunc_GetScreenMask_OutIndicator;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_ShowScreenMask_InMaskTime_ImplicitCast;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ScreenMaskUIObject_C_ShowScreenMaskBP;

// Function BP_ScreenMaskUIObject.BP_ScreenMaskUIObject_C.ShowTipsBP
// 0x0038 (0x0038 - 0x0000)
struct BP_ScreenMaskUIObject_C_ShowTipsBP final
{
public:
	class FText                                   InTitleText;                                       // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   InContentsText;                                    // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_ScreenMask_C*                      CallFunc_GetScreenMask_OutIndicator;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_ScreenMaskUIObject_C_ShowTipsBP;

}

