#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SupportMenuKeywordItemData

#include "Basic.hpp"

#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function BP_SupportMenuKeywordItemData.BP_SupportMenuKeywordItemData_C.SetKeywordData
// 0x0068 (0x0068 - 0x0000)
struct BP_SupportMenuKeywordItemData_C_SetKeywordData final
{
public:
	struct FKeywordDataTableRow                   InKeywordData;                                     // 0x0000(0x0068)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_BP_SupportMenuKeywordItemData_C_SetKeywordData;

// Function BP_SupportMenuKeywordItemData.BP_SupportMenuKeywordItemData_C.GetTitleText
// 0x0010 (0x0010 - 0x0000)
struct BP_SupportMenuKeywordItemData_C_GetTitleText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuKeywordItemData_C_GetTitleText;

// Function BP_SupportMenuKeywordItemData.BP_SupportMenuKeywordItemData_C.GetTexture
// 0x0028 (0x0028 - 0x0000)
struct BP_SupportMenuKeywordItemData_C_GetTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              OutTexture;                                        // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuKeywordItemData_C_GetTexture;

// Function BP_SupportMenuKeywordItemData.BP_SupportMenuKeywordItemData_C.GetKeywordData
// 0x0068 (0x0068 - 0x0000)
struct BP_SupportMenuKeywordItemData_C_GetKeywordData final
{
public:
	struct FKeywordDataTableRow                   OutKeywordData;                                    // 0x0000(0x0068)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuKeywordItemData_C_GetKeywordData;

// Function BP_SupportMenuKeywordItemData.BP_SupportMenuKeywordItemData_C.GetDescriptionText
// 0x0010 (0x0010 - 0x0000)
struct BP_SupportMenuKeywordItemData_C_GetDescriptionText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuKeywordItemData_C_GetDescriptionText;

// Function BP_SupportMenuKeywordItemData.BP_SupportMenuKeywordItemData_C.GetCategoryKeyList
// 0x0010 (0x0010 - 0x0000)
struct BP_SupportMenuKeywordItemData_C_GetCategoryKeyList final
{
public:
	TArray<class FName>                           OutCategoryList;                                   // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuKeywordItemData_C_GetCategoryKeyList;

}

