#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StatusIndicatorUIObject

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.ExecuteUbergraph_BP_StatusIndicatorUIObject
// 0x0058 (0x0058 - 0x0000)
struct BP_StatusIndicatorUIObject_C_ExecuteUbergraph_BP_StatusIndicatorUIObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_ExpPanel_C*                        CallFunc_GetExpPanel_OutPanel;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_Event_InTag_1;                              // 0x0024(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InCount_1;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator_1;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_ExpPanel_C*                        CallFunc_GetExpPanel_OutPanel_1;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Event_InTag;                                // 0x0048(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InCount;                              // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_ExecuteUbergraph_BP_StatusIndicatorUIObject;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.Get Resource Percent LP
// 0x0020 (0x0020 - 0x0000)
struct BP_StatusIndicatorUIObject_C_Get_Resource_Percent_LP final
{
public:
	double                                        OutPercent;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_BarrierGauge_C*                    CallFunc_GetBarrierGauge_OutBarrierGauge;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetResourcePercent_OutPercent;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_Get_Resource_Percent_LP;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.GetHealthGaugeLength
// 0x0028 (0x0028 - 0x0000)
struct BP_StatusIndicatorUIObject_C_GetHealthGaugeLength final
{
public:
	bool                                          OutResult;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        OutLengthram;                                      // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetHealthGaugeLength_OutLength;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_GetHealthGaugeLength;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.GetIsBackGaugeMoving
// 0x0001 (0x0001 - 0x0000)
struct BP_StatusIndicatorUIObject_C_GetIsBackGaugeMoving final
{
public:
	bool                                          OutIsBackGaugeMoving;                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_GetIsBackGaugeMoving;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.GetResourcePercent_HP
// 0x0020 (0x0020 - 0x0000)
struct BP_StatusIndicatorUIObject_C_GetResourcePercent_HP final
{
public:
	double                                        OutPercent;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_HealthGauge_C*                     CallFunc_GetHealthGauge_OutGauge;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetResourcePercent_OutPercent;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_GetResourcePercent_HP;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.GetStatusIndicator
// 0x0020 (0x0020 - 0x0000)
struct BP_StatusIndicatorUIObject_C_GetStatusIndicator final
{
public:
	class UWDT_StatusIndicator_C*                 OutIndicator;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuBase*                              CallFunc_GetTopMenu_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 K2Node_DynamicCast_AsWDT_Status_Indicator;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_GetStatusIndicator;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.InitializeIndicator
// 0x00D0 (0x00D0 - 0x0000)
struct BP_StatusIndicatorUIObject_C_InitializeIndicator final
{
public:
	float                                         InCurrentHealth;                                   // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InMaxHealth;                                       // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InCurrentStamina;                                  // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InMaxStamina;                                      // 0x000C(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCurrentHaze;                                     // 0x0010(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool InIsVisible)>             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool InIsVisible)>             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator_1;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_BarrierGauge_C*                    CallFunc_GetBarrierGauge_OutBarrierGauge;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_HealthGauge_C*                     CallFunc_GetHealthGauge_OutGauge;                  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(double InLength)>              K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator_2;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_ExpPanel_C*                        CallFunc_GetExpPanel_OutPanel;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator_3;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator_4;        // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_HealthGauge_C*                     CallFunc_GetHealthGauge_OutGauge_1;                // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_StaminaGauge_C*                    CallFunc_GetStaminaGauge_OutGauge;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IHealthGaugeInterface> CallFunc_SetHealth_self_CastInput;                 // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetHealth_ReturnValue;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetHealthGaugeLength_InMaxHealth_ImplicitCast; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetStamina_InCurrentStamina_ImplicitCast; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetStamina_InMaxStamina_ImplicitCast;     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetStaminaGaugeLength_InMaxStamina_ImplicitCast; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_InitializeIndicator;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.NotifyExpChanged
// 0x0018 (0x0018 - 0x0000)
struct BP_StatusIndicatorUIObject_C_NotifyExpChanged final
{
public:
	int32                                         InCurrentExp;                                      // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EResourceChangeFactor                         InChangeFactor;                                    // 0x0004(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_ExpPanel_C*                        CallFunc_GetExpPanel_OutPanel;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_NotifyExpChanged;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.NotifyHealthChanged
// 0x0040 (0x0040 - 0x0000)
struct BP_StatusIndicatorUIObject_C_NotifyHealthChanged final
{
public:
	float                                         InCurrentHealth;                                   // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InMaxHealth;                                       // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EResourceChangeFactor                         InChangeFactor;                                    // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_HealthGauge_C*                     CallFunc_GetHealthGauge_OutGauge;                  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IHealthGaugeInterface> CallFunc_SetHealth_self_CastInput;                 // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetHealth_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SetHealthGaugeLength_InMaxHealth_ImplicitCast; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_NotifyHealthChanged;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.NotifyStaminaChanged
// 0x0038 (0x0038 - 0x0000)
struct BP_StatusIndicatorUIObject_C_NotifyStaminaChanged final
{
public:
	float                                         InCurrentStamina;                                  // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InMaxStamina;                                      // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EResourceChangeFactor                         InChangeFactor;                                    // 0x0008(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_StaminaGauge_C*                    CallFunc_GetStaminaGauge_OutGauge;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetStamina_InCurrentStamina_ImplicitCast; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetStamina_InMaxStamina_ImplicitCast;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetStaminaGaugeLength_InMaxStamina_ImplicitCast; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_NotifyStaminaChanged;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.NotifyStatusDownEffectApplied
// 0x0038 (0x0038 - 0x0000)
struct BP_StatusIndicatorUIObject_C_NotifyStatusDownEffectApplied final
{
public:
	EStatusDownEffectIconType                     InType;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatusEffectFrameType                        InFrame;                                           // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectIconHandle                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FStatusEffectIconHandle                L_Handle;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectIconHandle                CallFunc_MakeStatusEffectIconHandle_ReturnValue;   // 0x0028(0x0008)(NoDestructor)
	class UWDT_StatusEffectPanel_C*               CallFunc_GetStatusEffectPanel_OutPanel;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_NotifyStatusDownEffectApplied;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.NotifyStatusEffectRemoved
// 0x0020 (0x0020 - 0x0000)
struct BP_StatusIndicatorUIObject_C_NotifyStatusEffectRemoved final
{
public:
	struct FStatusEffectIconHandle                InHandle;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusEffectPanel_C*               CallFunc_GetStatusEffectPanel_OutPanel;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_NotifyStatusEffectRemoved;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.NotifyStatusEffectTimeElapsed
// 0x0038 (0x0038 - 0x0000)
struct BP_StatusIndicatorUIObject_C_NotifyStatusEffectTimeElapsed final
{
public:
	struct FStatusEffectIconHandle                InHandle;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         InRemainingTime;                                   // 0x0008(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InTotalTime;                                       // 0x000C(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusEffectPanel_C*               CallFunc_GetStatusEffectPanel_OutPanel;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotifyStatusEffectTimeElapsed_InRemainingTime_ImplicitCast; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NotifyStatusEffectTimeElapsed_InTotalTime_ImplicitCast; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_NotifyStatusEffectTimeElapsed;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.NotifyStatusUpEffectApplied
// 0x0038 (0x0038 - 0x0000)
struct BP_StatusIndicatorUIObject_C_NotifyStatusUpEffectApplied final
{
public:
	EStatusUpEffectIconType                       InType;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatusEffectFrameType                        InFrame;                                           // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectIconHandle                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor)
	struct FStatusEffectIconHandle                L_Handle;                                          // 0x0010(0x0008)(Edit, BlueprintVisible, NoDestructor)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectIconHandle                CallFunc_MakeStatusEffectIconHandle_ReturnValue;   // 0x0028(0x0008)(NoDestructor)
	class UWDT_StatusEffectPanel_C*               CallFunc_GetStatusEffectPanel_OutPanel;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_NotifyStatusUpEffectApplied;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.NotifyStatusUpEffectAppliedEx
// 0x0030 (0x0030 - 0x0000)
struct BP_StatusIndicatorUIObject_C_NotifyStatusUpEffectAppliedEx final
{
public:
	EStatusUpEffectIconTypeEx                     InType;                                            // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatusEffectFrameType                        InFrame;                                           // 0x0001(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStatusEffectIconHandle                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectIconHandle                CallFunc_MakeStatusEffectIconHandle_ReturnValue;   // 0x0020(0x0008)(NoDestructor)
	class UWDT_StatusEffectPanel_C*               CallFunc_GetStatusEffectPanel_OutPanel;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_NotifyStatusUpEffectAppliedEx;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.OnBattleState_HPLP
// 0x0080 (0x0080 - 0x0000)
struct BP_StatusIndicatorUIObject_C_OnBattleState_HPLP final
{
public:
	bool                                          InIsVisible;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHUDAutoHideEnabled_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_HealthGauge_C*                     CallFunc_GetHealthGauge_OutGauge;                  // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator_1;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetResourcePercent_OutPercent;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWDT_BarrierGauge_C*                    CallFunc_GetBarrierGauge_OutBarrierGauge;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_GetResourcePercent_OutPercent_1;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator_2;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator_3;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator_4;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_HealthGauge_C*                     CallFunc_GetHealthGauge_OutGauge_1;                // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_BarrierGauge_C*                    CallFunc_GetBarrierGauge_OutBarrierGauge_1;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_OnBattleState_HPLP;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.OnBattleStateChanged
// 0x0048 (0x0048 - 0x0000)
struct BP_StatusIndicatorUIObject_C_OnBattleStateChanged final
{
public:
	bool                                          InBattleState;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHUDAutoHideEnabled_ReturnValue;         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_ExpPanel_C*                        CallFunc_GetExpPanel_OutPanel;                     // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_StaminaGauge_C*                    CallFunc_GetStaminaGauge_OutGauge;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator_1;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_BarrierGauge_C*                    CallFunc_GetBarrierGauge_OutBarrierGauge;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_HealthGauge_C*                     CallFunc_GetHealthGauge_OutGauge;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_OnBattleStateChanged;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.OnHarmonyMoon
// 0x000C (0x000C - 0x0000)
struct BP_StatusIndicatorUIObject_C_OnHarmonyMoon final
{
public:
	struct FGameplayTag                           InTag;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         InCount;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_OnHarmonyMoon;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.OnHotSpring
// 0x000C (0x000C - 0x0000)
struct BP_StatusIndicatorUIObject_C_OnHotSpring final
{
public:
	struct FGameplayTag                           InTag;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         InCount;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_OnHotSpring;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.OnNotifyHealthGaugeLengthChanged
// 0x0020 (0x0020 - 0x0000)
struct BP_StatusIndicatorUIObject_C_OnNotifyHealthGaugeLengthChanged final
{
public:
	double                                        InLength;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUIObjectBase*                          CallFunc_GetUIObjectBySoftClassPtr_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BuddyIndicatorUIObject_C*           K2Node_DynamicCast_AsBP_Buddy_Indicator_UIObject;  // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_OnNotifyHealthGaugeLengthChanged;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.SetBackGaugeMovingTimer
// 0x0010 (0x0010 - 0x0000)
struct BP_StatusIndicatorUIObject_C_SetBackGaugeMovingTimer final
{
public:
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_SetBackGaugeMovingTimer;

// Function BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C.UpdateAccumulateStateValue
// 0x0120 (0x0120 - 0x0000)
struct BP_StatusIndicatorUIObject_C_UpdateAccumulateStateValue final
{
public:
	struct FAccumulateGaugeInfo                   InGaugeInfo;                                       // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm)
	struct FAccumulateAttributeUIInfo             InAttributeInfo;                                   // 0x00E0(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	bool                                          ReturnValue;                                       // 0x00F0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_StatusIndicator_C*                 CallFunc_GetStatusIndicator_OutIndicator;          // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IAccumulateAttributeWidgetInterface> K2Node_DynamicCast_AsAccumulate_Attribute_Widget_Interface; // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateAccumulateStateValue_ReturnValue;   // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_StatusIndicatorUIObject_C_UpdateAccumulateStateValue;

}

