#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SmallScenarioGainBloodCodeBase

#include "Basic.hpp"

#include "StoryFlagSystem_structs.hpp"
#include "Extensions_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_SmallScenarioBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SmallScenarioGainBloodCodeBase.BP_SmallScenarioGainBloodCodeBase_C
// 0x0038 (0x03C8 - 0x0390)
class ABP_SmallScenarioGainBloodCodeBase_C : public ABP_SmallScenarioBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_SmallScenarioGainBloodCodeBase_C; // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FArticleBulkInfo                       ArticleBulkInfo;                                   // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FStoryFlagLabel                        FlagLabel;                                         // 0x03A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           FlagValueBeforeGain;                               // 0x03B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           FlagValueAfterGain;                                // 0x03B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FStoryFlagLabel                        FlagAfterLabelOverride;                            // 0x03C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SmallScenarioGainBloodCodeBase(int32 EntryPoint);
	void GainBloodCode();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SmallScenarioGainBloodCodeBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SmallScenarioGainBloodCodeBase_C")
	}
	static class ABP_SmallScenarioGainBloodCodeBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SmallScenarioGainBloodCodeBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_SmallScenarioGainBloodCodeBase_C;

}

