#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SupportMenuItemDataBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.SetIsQuestDeactivate
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuItemDataBase_C_SetIsQuestDeactivate final
{
public:
	bool                                          bInIsQuestDisable;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_SetIsQuestDeactivate;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.SetIsQuestClear
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuItemDataBase_C_SetIsQuestClear final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_SetIsQuestClear;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.SetIsFeatureReleased
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuItemDataBase_C_SetIsFeatureReleased final
{
public:
	bool                                          bInIsFeatureReleased;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_SetIsFeatureReleased;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.SetIsFeatureIconVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuItemDataBase_C_SetIsFeatureIconVisibility final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_SetIsFeatureIconVisibility;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.SetIsFeatureIconGrayOut
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuItemDataBase_C_SetIsFeatureIconGrayOut final
{
public:
	bool                                          InGrayOut;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_SetIsFeatureIconGrayOut;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.SetIsExpansion
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuItemDataBase_C_SetIsExpansion final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_SetIsExpansion;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.SetDisplayNewFlag
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuItemDataBase_C_SetDisplayNewFlag final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_SetDisplayNewFlag;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.GetTitleText
// 0x0010 (0x0010 - 0x0000)
struct BP_SupportMenuItemDataBase_C_GetTitleText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_GetTitleText;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.GetTexture
// 0x0028 (0x0028 - 0x0000)
struct BP_SupportMenuItemDataBase_C_GetTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              OutTexture;                                        // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_GetTexture;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.GetItemKeyName
// 0x0008 (0x0008 - 0x0000)
struct BP_SupportMenuItemDataBase_C_GetItemKeyName final
{
public:
	class FName                                   OutKeyName;                                        // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_GetItemKeyName;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.GetIsQuestDeactivate
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuItemDataBase_C_GetIsQuestDeactivate final
{
public:
	bool                                          bOutIsQuestDisable;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_GetIsQuestDeactivate;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.GetIsQuestClear
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuItemDataBase_C_GetIsQuestClear final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_GetIsQuestClear;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.GetIsFeatureReleased
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuItemDataBase_C_GetIsFeatureReleased final
{
public:
	bool                                          OutIsFeatureReleased;                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_GetIsFeatureReleased;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.GetIsFeatureIconVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuItemDataBase_C_GetIsFeatureIconVisibility final
{
public:
	bool                                          OutVisibility;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_GetIsFeatureIconVisibility;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.GetIsFeatureIconGrayOut
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuItemDataBase_C_GetIsFeatureIconGrayOut final
{
public:
	bool                                          OutGrayOut;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_GetIsFeatureIconGrayOut;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.GetIsExpansion
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuItemDataBase_C_GetIsExpansion final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_GetIsExpansion;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.GetIsCategory
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuItemDataBase_C_GetIsCategory final
{
public:
	bool                                          OutIsCategory;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_GetIsCategory;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.GetDisplayNewFlag
// 0x0001 (0x0001 - 0x0000)
struct BP_SupportMenuItemDataBase_C_GetDisplayNewFlag final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_GetDisplayNewFlag;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.GetDescriptionTextFinished
// 0x0010 (0x0010 - 0x0000)
struct BP_SupportMenuItemDataBase_C_GetDescriptionTextFinished final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_GetDescriptionTextFinished;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.GetDescriptionText
// 0x0010 (0x0010 - 0x0000)
struct BP_SupportMenuItemDataBase_C_GetDescriptionText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_GetDescriptionText;

// Function BP_SupportMenuItemDataBase.BP_SupportMenuItemDataBase_C.GetCategoryKeyList
// 0x0010 (0x0010 - 0x0000)
struct BP_SupportMenuItemDataBase_C_GetCategoryKeyList final
{
public:
	TArray<class FName>                           OutCategoryList;                                   // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_BP_SupportMenuItemDataBase_C_GetCategoryKeyList;

}

