#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StatusIndicatorUIObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StatusIndicatorUIObject.BP_StatusIndicatorUIObject_C
// 0x0028 (0x00A0 - 0x0078)
class UBP_StatusIndicatorUIObject_C final : public UStatusIndicatorUIObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0078(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTimerHandle                           BackGaugeKickTimer;                                // 0x0080(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        BackGaugeSpeed;                                    // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BackGaugeKickTime;                                 // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBackGaugeMoving;                                 // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_StatusIndicatorUIObject(int32 EntryPoint);
	void Get_Resource_Percent_LP(double* OutPercent);
	void GetHealthGaugeLength(bool* OutResult, double* OutLengthram);
	void GetIsBackGaugeMoving(bool* OutIsBackGaugeMoving);
	void GetResourcePercent_HP(double* OutPercent);
	void GetStatusIndicator(class UWDT_StatusIndicator_C** OutIndicator);
	bool InitializeIndicator(const float InCurrentHealth, const float InMaxHealth, const float InCurrentStamina, const float InMaxStamina, const int32 InCurrentHaze);
	bool NotifyExpChanged(const int32 InCurrentExp, const EResourceChangeFactor InChangeFactor);
	bool NotifyHealthChanged(const float InCurrentHealth, const float InMaxHealth, const EResourceChangeFactor InChangeFactor);
	bool NotifyStaminaChanged(const float InCurrentStamina, const float InMaxStamina, const EResourceChangeFactor InChangeFactor);
	struct FStatusEffectIconHandle NotifyStatusDownEffectApplied(const EStatusDownEffectIconType InType, const EStatusEffectFrameType InFrame);
	bool NotifyStatusEffectRemoved(const struct FStatusEffectIconHandle& InHandle);
	bool NotifyStatusEffectTimeElapsed(const struct FStatusEffectIconHandle& InHandle, const float InRemainingTime, const float InTotalTime);
	struct FStatusEffectIconHandle NotifyStatusUpEffectApplied(const EStatusUpEffectIconType InType, const EStatusEffectFrameType InFrame);
	struct FStatusEffectIconHandle NotifyStatusUpEffectAppliedEx(const EStatusUpEffectIconTypeEx InType, const EStatusEffectFrameType InFrame);
	void OnBattleState_HPLP(bool InIsVisible);
	bool OnBattleStateChanged(bool InBattleState);
	void OnHarmonyMoon(const struct FGameplayTag& InTag, int32 InCount);
	void OnHotSpring(const struct FGameplayTag& InTag, int32 InCount);
	void OnNotifyHealthGaugeLengthChanged(double InLength);
	void SetBackGaugeMovingTimer();
	void StartBackGaugeMoving();
	void StopBackGaugeMoving();
	bool UpdateAccumulateStateValue(const struct FAccumulateGaugeInfo& InGaugeInfo, const struct FAccumulateAttributeUIInfo& InAttributeInfo);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_StatusIndicatorUIObject_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_StatusIndicatorUIObject_C")
	}
	static class UBP_StatusIndicatorUIObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_StatusIndicatorUIObject_C>();
	}
};
DUMPER7_ASSERTS_UBP_StatusIndicatorUIObject_C;

}

