#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TitleMenuUIObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"
#include "BasicUI_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TitleMenuUIObject.BP_TitleMenuUIObject_C
// 0x0170 (0x0210 - 0x00A0)
class UBP_TitleMenuUIObject_C final : public UTitleMenuUIObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ETitleMenuStep                                TitleMenuStep;                                     // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   LastSelectedMenuName;                              // 0x00AC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuContext                           ConfigurationTopMenuContext;                       // 0x00B8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           LicenseMenuContext;                                // 0x00F0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           SaveDataSelectContext;                             // 0x0128(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bIsMatchingRegionSelected;                         // 0x0160(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsBrightnessSettingSelected;                      // 0x0161(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Playing_BGMID;                                     // 0x0164(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<ETitleProgressType, class UAkAudioEvent*> BGMMap;                                           // 0x0168(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<ETitleProgressType, class UAkAudioEvent*> BGMOutroMap;                                      // 0x01B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsGameStart;                                       // 0x0208(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Clear();
	void ContinueLastGame();
	void ExecuteUbergraph_BP_TitleMenuUIObject(int32 EntryPoint);
	void GetContinueSaveName(class FString* SaveName);
	void IsAbleToContinue(bool* EnableContinue);
	void OnChangeTestCharacterView(bool bIsInEnable);
	void OnChangeTitleProgress(ETitleProgressType Progress);
	void OnOtherMenuClosed();
	void OnSaveDataSelect(int32 InIndex);
	void OnTitleMenuClosed();
	bool Open();
	void OpenConfig();
	void OpenLicense();
	void OpenSaveDataSelectMenu(EUISaveDataGroup InSaveDataGroup);
	void RequestPlayBGM(const ETitleProgressType& InProgress, bool ForcePlay);
	void RequestStopBGM(ETitleProgressType Progress);
	void SetGameStartFromOther();
	void SetNewGameStoryFlag();
	void StartNewGame(bool IsFemale);
	void TransitToMainWorld();
	void TransitToOtherMenu();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_TitleMenuUIObject_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_TitleMenuUIObject_C")
	}
	static class UBP_TitleMenuUIObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TitleMenuUIObject_C>();
	}
};
DUMPER7_ASSERTS_UBP_TitleMenuUIObject_C;

}

