#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VisualEffectManager

#include "Basic.hpp"

#include "STR_SeethroughActor_structs.hpp"
#include "Engine_structs.hpp"
#include "STR_SeethroughObject_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VisualEffectManager.BP_VisualEffectManager_C
// 0x0160 (0x01D0 - 0x0070)
class UBP_VisualEffectManager_C final : public UVisualEffectManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0070(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        DeltaTime;                                         // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Position;                                          // 0x0080(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PositionDelay;                                     // 0x0098(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PositionGround;                                    // 0x00B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PositionPre;                                       // 0x00C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Direction;                                         // 0x00E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DirectionDelay;                                    // 0x00F8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Velocity;                                          // 0x0110(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DelayPositionTension;                              // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DelayDirectionTension;                             // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DelayMaxDistance;                                  // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DelayMaxAngle;                                     // 0x0140(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraPosition;                                    // 0x0148(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraDirection;                                   // 0x0160(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PlayerToCameraDirection;                           // 0x0178(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PlayerToCameraDistance;                            // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTR_SeethroughObject>          SeeThroughObjects;                                 // 0x0198(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UCurveFloat*                            SeeThroughObjects_OpacityDistanceCurve;            // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            SeeThroughObjects_OpacityFadeCurve;                // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTR_SeethroughActor>           SeeThroughActors;                                  // 0x01B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          InCinematicScene;                                  // 0x01C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InPhotoMode;                                       // 0x01C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BeginSeeThroughActor(class AActor* Actor, double DistanceToCamera);
	void BeginSeeThroughObject(const class UPrimitiveComponent*& Object, double DistanceToCamera, class AActor* Actor);
	void Check_Actor_Can_Modify_Visibility(class AActor* Actor, bool* Result);
	void CheckDependentMaterial(class UMaterialInterface* Material, class UMaterialInterface* TestMaterial, bool* Result);
	void DuplicateStaticMesh(class UStaticMeshComponent* StaticMeshComponent, class AActor* Actor, class UStaticMeshComponent** Result);
	void EndSeeThroughActor(const struct FSTR_SeethroughActor& Object, int32 Index_0);
	void EndSeeThroughObject(const struct FSTR_SeethroughObject& Object, int32 Index_0);
	void ExecuteUbergraph_BP_VisualEffectManager(int32 EntryPoint);
	void Find_See_Through_Mesh_Component(class AActor* Actor, class UStaticMesh* StaticMesh, class UStaticMeshComponent** AsStatic_Mesh_Component);
	void FindSeeThroughActor(class AActor* Actor, int32* Result);
	void FindSeeThroughObject(class UPrimitiveComponent* InObject, int32* Result);
	void ReceiveBeginPlay();
	void ReceiveEndPhotoMode();
	void ReceiveEndPlay();
	void ReceiveStartPhotoMode();
	void ReceiveTick(float InDeltaTime);
	void ReplaceMaterials(class AActor* Actor, class UPrimitiveComponent* Component, TArray<class UMaterialInterface*>* Result);
	void ScanSeeThroughActor();
	void ScanSeeThroughObject();
	void SetCustomDepth(class UPrimitiveComponent* Component, bool Enable);
	void TickProcess(double DeltaTime_0);
	void TickSeeThroughActor(const struct FSTR_SeethroughActor& Object, int32 Index_0, double DeltaTime_0);
	void TickSeeThroughObject(const struct FSTR_SeethroughObject& Object, double FadeWeight);
	void UpdatePlayerPosition();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_VisualEffectManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_VisualEffectManager_C")
	}
	static class UBP_VisualEffectManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VisualEffectManager_C>();
	}
};
DUMPER7_ASSERTS_UBP_VisualEffectManager_C;

}

