#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VanishBodyEffect

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VanishBodyEffect.BP_VanishBodyEffect_C
// 0x0160 (0x0188 - 0x0028)
class UBP_VanishBodyEffect_C final : public UAppWorldObject
{
public:
	bool                                          bInProgress;                                       // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReverse;                                          // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSE_AudioEvent;                                    // 0x002A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraSystem*                         Effect;                                            // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     OverrideMaterial;                                  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            WeightCurve;                                       // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          SE_AudioEvent;                                     // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        SE_DelayTime;                                      // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TotalDuration;                                     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DurationRev;                                       // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Age;                                               // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        NormalizedAge;                                     // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayTime;                                         // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bVanishCenterWorld;                                // 0x007C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMeshComponent*                         Mesh;                                              // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      EffectInstance;                                    // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        VanishCenterHeight;                                // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                VanishCenter;                                      // 0x0098(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        VanishActorSize;                                   // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           VanishColor;                                       // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VanishIntensity;                                   // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bVanishReverse;                                    // 0x00CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableFinishVisibility;                           // 0x00CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnFinishEvent;                                     // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UBP_VanishBodyEffect_C* Instance)> OnFinishEventWithInstance; // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bFinishVisibility;                                 // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFinishVisibility_Children;                        // 0x00F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFinishEvent;                                      // 0x00F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F3[0x1];                                       // 0x00F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   VanishWeightParameterName;                         // 0x00F4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   VanishColorParameterName;                          // 0x00FC(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   VanishIntensityParameterName;                      // 0x0104(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAttachParent;                                     // 0x010C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   VanishCenterSocketName;                            // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EffectVanishCenterOffset;                          // 0x0118(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 ExcludeMaterialIndex;                              // 0x0130(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 IncludeMaterialIndex;                              // 0x0140(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bUseOtherMaterialParameter;                        // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseEnableMaterial;                                 // 0x0151(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_152[0x6];                                      // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           EnableMaterialSlotNames;                           // 0x0158(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Effect_SpawnRatio;                                 // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Effect_SpawnRadiusRange;                           // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseDestroyEffectInTime;                           // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DestroyEffectInTime;                               // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Effect_ActorSize;                                  // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddExcludeMaterialIndex(const int32 MaterialIndex);
	void AddExcludeMaterialIndexArray(const TArray<int32>& MaterialIndex);
	void AddIncludeMaterialIndex(const int32 MaterialIndex);
	void Begin(double TotalDuration_0, bool Reverse);
	void BeginEffect();
	void CheckEnableMaterial(class UMaterialInterface* Material, bool* Result);
	void CheckExcludeMaterialIndex(const int32 MaterialIndex, bool* Result);
	void CheckIncludeMaterialIndex(const int32 MaterialIndex, bool* Result);
	void CheckMesh(class UMeshComponent* Mesh_0, bool* Result);
	void Destroy();
	void End();
	void EndEffect();
	void GetAge(double* Age_0);
	void GetEffectInstance(class UNiagaraComponent** EffectInstance_0);
	void GetMaterial(int32 ElementIndex, class UMaterialInstanceDynamic** Result);
	void GetMaterialCount(int32* Result);
	void GetMesh(class UMeshComponent** Mesh_0);
	void GetNormalizedAge(double* Result);
	void GetTotalDuration(double* Total_Duration);
	void GetVanishCenterWorldTransform(struct FTransform* Result);
	void Initialize(class UMeshComponent* Mesh_0, class UNiagaraSystem* Effect_0, class UMaterialInterface* OverrideMaterial_0, class UCurveFloat* WeightCurve_0, class UAkAudioEvent* SE_AudioEvent_0, double SE_DelayTime_0, bool bVanishCenterWorld_0);
	void IsInProgress(bool* Result);
	void IsReverse(bool* Result);
	void OnFinishEffect(class UNiagaraComponent* PSystem);
	void OnProcess(bool bEffectDeactive);
	void Reset(bool bReverse_0);
	void Set_Vanish_Center_World(bool bVanishCenterWorld_0);
	void SetAge(double Age_0);
	void SetAttachParent(bool bAttachParent_0);
	void SetDelayTime(float DelayTime_0);
	void SetDestroyEffectInTime(bool bUseDestroyInTime, double DestroyInTime);
	void SetEffect(class UNiagaraSystem* Effect_0);
	void SetEffect_SpawnRadiusRange(float Effect_SpawnRadiusRange_0);
	void SetEffect_SpawnRatio(float Effect_SpawnRatio_0);
	void SetEffectVanishCenterOffset(const struct FVector& EffectVanishCenterOffset_0);
	void SetEnableFinishVisiblity(bool bEnableFinishVisibility_0, bool bFinishVisibility_0, bool bFinishVisibility_Children_0);
	void SetEnableMaterial(bool UseEnableMaterial_0, TArray<class FName>& EnableMaterialSlotNames_0);
	void SetUseOtherMaterialParameter(bool bUseOtherMaterialParameter_0);
	void SetVanishActorSize(double VanishActorSize_0);
	void SetVanishCenter(const struct FVector& VanishCenter_0);
	void SetVanishCenterSocketName(class FName VanishCenterSocketName_0);
	void SetVanishColor(const struct FLinearColor& VanishColor_0, float VanishIntensity_0);
	void SetVanishColorParameterName(class FName VanishColorParameterName_0);
	void SetVanishIntensityParameterName(class FName VanishIntensityParameterName_0);
	void SetVanishReverse(bool bVanishReverse_0);
	void SetVanishWeightParameterName(class FName VanishWeightParameterName_0);
	void Tick(double DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_VanishBodyEffect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_VanishBodyEffect_C")
	}
	static class UBP_VanishBodyEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VanishBodyEffect_C>();
	}
};
DUMPER7_ASSERTS_UBP_VanishBodyEffect_C;

}

