#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VanishGadgetEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VanishGadgetEffect.BP_VanishGadgetEffect_C
// 0x0198 (0x01C0 - 0x0028)
class UBP_VanishGadgetEffect_C final : public UAppWorldObject
{
public:
	class USkeletalMeshComponent*                 GadgetMesh;                                        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UNiagaraSystem*                         Effect;                                            // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Override_Material;                                 // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Disappear_Mesh;                                // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Owner_Actor;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 DisappearMesh;                                     // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      Effect_Disappear;                                  // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          bInProgress;                                       // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DisappearTime;                                     // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DisappearWeight;                                   // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DisappearTimeSpan;                                 // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DisappearActorSize;                                // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UNiagaraComponent* PSystem)> OnEffectFinished;               // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FName>                           EnableMaterialSlotNames;                           // 0x0090(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          UseEnableMaterial;                                 // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCenterWorld;                                    // 0x00A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   GadgetCenterSocket;                                // 0x00A4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRuntimeFloatCurve                     GdgetVanishColorWeight_Curve;                      // 0x00B0(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRuntimeFloatCurve                     GdgetVanishWeight_Curve;                           // 0x0138(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Begin(double TotalDuration);
	void CheckEnableMaterial(class UMaterialInterface* Material, bool* Result);
	void Destroy();
	void End();
	void Initialize(class USkeletalMeshComponent* Mesh, class UNiagaraSystem* Effect_0, class UMaterialInterface* OverrideMaterial, bool bUseDisappearMesh, class AActor* OwnerActor);
	void IsInProgress(bool* Result);
	void OnDisappearEffectFinished(class UNiagaraComponent* PSystem);
	void OnDisappearMesh();
	void ResetBegin();
	void ResetEnd();
	void SetEffectDisappearParameter(const struct FVector& CenterLocation);
	void SetEnableCenterWoirld(bool UseCenterWorld_0, class FName GadgetCenterSocket_0);
	void SetEnableMaterial(bool UseEnableMaterial_0, TArray<class FName>& EnableMaterialSlotNames_0);
	void SpawnDisappearEffect();
	void Tick(double DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_VanishGadgetEffect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_VanishGadgetEffect_C")
	}
	static class UBP_VanishGadgetEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VanishGadgetEffect_C>();
	}
};
DUMPER7_ASSERTS_UBP_VanishGadgetEffect_C;

}

