#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CodeVeinAssets

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CodeVeinAssets_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CodeVeinAssets.Mig_AnimInstance.GetBodyShapeScale
// 0x0020 (0x0020 - 0x0000)
struct Mig_AnimInstance_GetBodyShapeScale final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Mig_AnimInstance_GetBodyShapeScale;

// Function CodeVeinAssets.Mig_AnimInstance.SetIkParam
// 0x0008 (0x0008 - 0x0000)
struct Mig_AnimInstance_SetIkParam final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Mig_AnimInstance_SetIkParam;

// Function CodeVeinAssets.Mig_IkHelperComponent.GetIkHelperComponent
// 0x0010 (0x0010 - 0x0000)
struct Mig_IkHelperComponent_GetIkHelperComponent final
{
public:
	const class USkeletalMeshComponent*           SkMeshCompo;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMig_IkHelperComponent*                 ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Mig_IkHelperComponent_GetIkHelperComponent;

// Function CodeVeinAssets.Mig_IkHelperComponent.GetTwoBoneIkParameter
// 0x00C8 (0x00C8 - 0x0000)
struct Mig_IkHelperComponent_GetTwoBoneIkParameter final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMig_TwoBoneIkParameter                TwoBoneIkParameter;                                // 0x0008(0x0058)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	class UAnimInstance*                          AnimInstance;                                      // 0x0060(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0068(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMig_TwoBoneIkParameter                Current;                                           // 0x0070(0x0058)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Mig_IkHelperComponent_GetTwoBoneIkParameter;

// Function CodeVeinAssets.Mig_IkHelperComponent.SetAllIkHelperEffective
// 0x0010 (0x0010 - 0x0000)
struct Mig_IkHelperComponent_SetAllIkHelperEffective final
{
public:
	class AActor*                                 InActor;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InShrink;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InChain;                                           // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_Mig_IkHelperComponent_SetAllIkHelperEffective;

// Function CodeVeinAssets.Mig_IkHelperComponent.ClearEndEffector
// 0x000C (0x000C - 0x0000)
struct Mig_IkHelperComponent_ClearEndEffector final
{
public:
	bool                                          ClearSceneCompo;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ClearSocketName;                                   // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ChainName;                                         // 0x0004(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Mig_IkHelperComponent_ClearEndEffector;

// Function CodeVeinAssets.Mig_IkHelperComponent.GetEndEffectors
// 0x0018 (0x0018 - 0x0000)
struct Mig_IkHelperComponent_GetEndEffectors final
{
public:
	class FName                                   ChainName;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMig_EffectorInfo>              ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Mig_IkHelperComponent_GetEndEffectors;

// Function CodeVeinAssets.Mig_IkHelperComponent.SetCapsuleComponent
// 0x0008 (0x0008 - 0x0000)
struct Mig_IkHelperComponent_SetCapsuleComponent final
{
public:
	class UCapsuleComponent*                      CapsuleCompo;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Mig_IkHelperComponent_SetCapsuleComponent;

// Function CodeVeinAssets.Mig_IkHelperComponent.SetCapsuleHalfHeightWithIk
// 0x0004 (0x0004 - 0x0000)
struct Mig_IkHelperComponent_SetCapsuleHalfHeightWithIk final
{
public:
	float                                         InHalfHeight;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Mig_IkHelperComponent_SetCapsuleHalfHeightWithIk;

// Function CodeVeinAssets.Mig_IkHelperComponent.SetCapsuleRadiusWithIk
// 0x0004 (0x0004 - 0x0000)
struct Mig_IkHelperComponent_SetCapsuleRadiusWithIk final
{
public:
	float                                         InRadius;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Mig_IkHelperComponent_SetCapsuleRadiusWithIk;

// Function CodeVeinAssets.Mig_IkHelperComponent.SetCapsuleSizeWithIk
// 0x0008 (0x0008 - 0x0000)
struct Mig_IkHelperComponent_SetCapsuleSizeWithIk final
{
public:
	float                                         InRadius;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InHalfHeight;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Mig_IkHelperComponent_SetCapsuleSizeWithIk;

// Function CodeVeinAssets.Mig_IkHelperComponent.SetChainActiveness
// 0x000C (0x000C - 0x0000)
struct Mig_IkHelperComponent_SetChainActiveness final
{
public:
	bool                                          IsActive_0;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ChainName;                                         // 0x0004(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Mig_IkHelperComponent_SetChainActiveness;

// Function CodeVeinAssets.Mig_IkHelperComponent.SetEndEffector
// 0x0018 (0x0018 - 0x0000)
struct Mig_IkHelperComponent_SetEndEffector final
{
public:
	class USceneComponent*                        NewSceneCompo;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NewSocketName;                                     // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ChainName;                                         // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Mig_IkHelperComponent_SetEndEffector;

// Function CodeVeinAssets.Mig_IkHelperComponent.GetHitResultOfLatestTouchedChain
// 0x0100 (0x0100 - 0x0000)
struct Mig_IkHelperComponent_GetHitResultOfLatestTouchedChain final
{
public:
	EMig_IkChainWithLineTrace                     ChainType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             HitResult;                                         // 0x0008(0x00F8)(Parm, OutParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Mig_IkHelperComponent_GetHitResultOfLatestTouchedChain;

// Function CodeVeinAssets.Mig_IkHelperComponent.GetTargetBoneNameOfLatestTouchedChain
// 0x000C (0x000C - 0x0000)
struct Mig_IkHelperComponent_GetTargetBoneNameOfLatestTouchedChain final
{
public:
	EMig_IkChainWithLineTrace                     ChainType;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Mig_IkHelperComponent_GetTargetBoneNameOfLatestTouchedChain;

}

