#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DebugMenu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "ImGuiWrapper_classes.hpp"


namespace SDK
{

// Class DebugMenu.DebugMenuBase
// 0x0028 (0x0050 - 0x0028)
class UDebugMenuBase : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsTearOff;                                        // 0x0048(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DebugMenuBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DebugMenuBase")
	}
	static class UDebugMenuBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDebugMenuBase>();
	}
};
DUMPER7_ASSERTS_UDebugMenuBase;

// Class DebugMenu.DebugMenuManager
// 0x0128 (0x0170 - 0x0048)
class UDebugMenuManager : public UImGuiWrapperSubsystem
{
public:
	TMulticastInlineDelegate<void(class FName InItemName, bool bValue)> OnChangeParamBoolDelegate;   // 0x0048(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_58[0x38];                                      // 0x0058(0x0038)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class UDebugMenuBase*>      Menus;                                             // 0x0090(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	uint8                                         Pad_E0[0x90];                                      // 0x00E0(0x0090)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UDebugMenuBase* K2_GetMenu(class FName InLabel);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DebugMenuManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DebugMenuManager")
	}
	static class UDebugMenuManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDebugMenuManager>();
	}
};
DUMPER7_ASSERTS_UDebugMenuManager;

// Class DebugMenu.DebugMenuSettings
// 0x0020 (0x0048 - 0x0028)
class UDebugMenuSettings final : public UObject
{
public:
	struct FSoftClassPath                         CursorWidgetForConsole;                            // 0x0028(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DebugMenuSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DebugMenuSettings")
	}
	static class UDebugMenuSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDebugMenuSettings>();
	}
};
DUMPER7_ASSERTS_UDebugMenuSettings;

// Class DebugMenu.DefaultDebugMenu
// 0x0008 (0x0058 - 0x0050)
class UDefaultDebugMenu final : public UDebugMenuBase
{
public:
	bool                                          StartEnableDebugMenu;                              // 0x0050(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DefaultDebugMenu")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DefaultDebugMenu")
	}
	static class UDefaultDebugMenu* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultDebugMenu>();
	}
};
DUMPER7_ASSERTS_UDefaultDebugMenu;

}

