#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FAvoidChooserInput

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct FAvoidChooserInput.FAvoidChooserInput
// 0x0010 (0x0010 - 0x0000)
struct FFAvoidChooserInput final
{
public:
	bool                                          IsFemale_1_E64D25B84B741B3063941BB0792A5B68;       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsBattle_3_7537EA3A48874A87A1ECAC91E55E3845;       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRight_11_44357AB24F8A3CEA117F02BD62149823;       // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BetweenAngle_8_ECC04CDA41BB871931C630A87883A5E6;   // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FFAvoidChooserInput;

}

