#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ChangeBattleState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ChangeBattleState.GA_ChangeBattleState_C
// 0x0020 (0x0560 - 0x0540)
class UGA_ChangeBattleState_C : public UActionHumanGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          AlreadyAnimClassLinkingProcessed;                  // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsToBattle;                                        // 0x0549(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54A[0x6];                                      // 0x054A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           SelectedMontage;                                   // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          WasIdle;                                           // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_ChangeBattleState(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void LinkOrUnlinkAnimClassOnce();
	void OnBlendOut_6B3595C446D4F9E065B422978752515D();
	void OnCancelled_6B3595C446D4F9E065B422978752515D();
	void OnCompleted_6B3595C446D4F9E065B422978752515D();
	void OnInterrupted_6B3595C446D4F9E065B422978752515D();
	void OnMontageBlendOut();
	void OnMontageNotifyBegin_6B3595C446D4F9E065B422978752515D(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_6B3595C446D4F9E065B422978752515D(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnTaskDestroyed_6B3595C446D4F9E065B422978752515D();
	void OnTotalDurationExpiredOrTaskDestroyed_6B3595C446D4F9E065B422978752515D();
	void UpdateWeaponAppearance();

	const class UBattleStateSettings* GetSettings() const;
	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;
	class UAnimMontage* PickMontage() const;
	bool ShouldPlayMontage() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_ChangeBattleState_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_ChangeBattleState_C")
	}
	static class UGA_ChangeBattleState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ChangeBattleState_C>();
	}
};
DUMPER7_ASSERTS_UGA_ChangeBattleState_C;

}

