#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Dodge_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Dodge_Base.GA_Dodge_Base_C
// 0x0060 (0x05C8 - 0x0568)
class UGA_Dodge_Base_C : public UGA_Dodge
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0568(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        TimeCanBeCancelByMoveNotifyBegun;                  // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasDodgeFront;                                     // 0x0578(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_579[0x7];                                      // 0x0579(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           DodgeAnim_F;                                       // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           DodgeAnim_FR;                                      // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           DodgeAnim_R;                                       // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           DodgeAnim_BR;                                      // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           DodgeAnim_B;                                       // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           DodgeAnim_BL;                                      // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           DodgeAnim_L;                                       // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           DodgeAnim_FL;                                      // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipLocoStart_AnyTime;                             // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipLocoStart_OnlyWhileSprint;                     // 0x05C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Dodge_Base(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnAbilityCancelledBy(const class UGameplayAbility* InAbility);
	void OnBlendOut_83362D5D40A255EE477E69A6B4CE726D();
	void OnCancelled_83362D5D40A255EE477E69A6B4CE726D();
	void OnCompleted_83362D5D40A255EE477E69A6B4CE726D();
	void OnInterrupted_83362D5D40A255EE477E69A6B4CE726D();
	void OnMontageNotifyBegin_83362D5D40A255EE477E69A6B4CE726D(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_83362D5D40A255EE477E69A6B4CE726D(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnTaskDestroyed_83362D5D40A255EE477E69A6B4CE726D();
	void OnTotalDurationExpiredOrTaskDestroyed_83362D5D40A255EE477E69A6B4CE726D();
	void PickDodgeAnimAndFindSlack(double DodgeDirectionInRad, bool* IsFront, class UAnimMontage** PickedAnim, float* SlackInRad);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Dodge_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Dodge_Base_C")
	}
	static class UGA_Dodge_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Dodge_Base_C>();
	}
};
DUMPER7_ASSERTS_UGA_Dodge_Base_C;

}

