#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DeathReaction

#include "Basic.hpp"

#include "GA_DeathReaction_Base_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_DeathReaction.GA_DeathReaction_C
// 0x0040 (0x05A0 - 0x0560)
class UGA_DeathReaction_C final : public UGA_DeathReaction_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_DeathReaction_C;                 // 0x0560(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UAnimMontage*>                   montage_stand;                                     // 0x0568(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   montage_down;                                      // 0x0578(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimMontage*                           montage_non_battle;                                // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage_FallIntoAbyss;                             // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage_LandOnAbyss;                               // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Abyss();
	void Down();
	void ExecuteUbergraph_GA_DeathReaction(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void NonBattle();
	void OnBlendOut_828AA705474A108BC7B02D8C3311BA48();
	void OnBlendOut_828AA705474A108BC7B02D8C9318BBF9();
	void OnBlendOut_828AA705474A108BC7B02D8C9F4D96DA();
	void OnBlendOut_828AA705474A108BC7B02D8CAC7EC898();
	void OnBlendOut_828AA705474A108BC7B02D8CD54BDCD5();
	void OnCancelled_828AA705474A108BC7B02D8C3311BA48();
	void OnCancelled_828AA705474A108BC7B02D8C9318BBF9();
	void OnCancelled_828AA705474A108BC7B02D8C9F4D96DA();
	void OnCancelled_828AA705474A108BC7B02D8CAC7EC898();
	void OnCancelled_828AA705474A108BC7B02D8CD54BDCD5();
	void OnCompleted_828AA705474A108BC7B02D8C3311BA48();
	void OnCompleted_828AA705474A108BC7B02D8C9318BBF9();
	void OnCompleted_828AA705474A108BC7B02D8C9F4D96DA();
	void OnCompleted_828AA705474A108BC7B02D8CAC7EC898();
	void OnCompleted_828AA705474A108BC7B02D8CD54BDCD5();
	void OnInterrupted_828AA705474A108BC7B02D8C3311BA48();
	void OnInterrupted_828AA705474A108BC7B02D8C9318BBF9();
	void OnInterrupted_828AA705474A108BC7B02D8C9F4D96DA();
	void OnInterrupted_828AA705474A108BC7B02D8CAC7EC898();
	void OnInterrupted_828AA705474A108BC7B02D8CD54BDCD5();
	void OnMontageNotifyBegin_828AA705474A108BC7B02D8C3311BA48(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyBegin_828AA705474A108BC7B02D8C9318BBF9(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyBegin_828AA705474A108BC7B02D8C9F4D96DA(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyBegin_828AA705474A108BC7B02D8CAC7EC898(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyBegin_828AA705474A108BC7B02D8CD54BDCD5(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_828AA705474A108BC7B02D8C3311BA48(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_828AA705474A108BC7B02D8C9318BBF9(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_828AA705474A108BC7B02D8C9F4D96DA(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_828AA705474A108BC7B02D8CAC7EC898(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_828AA705474A108BC7B02D8CD54BDCD5(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnTaskDestroyed_828AA705474A108BC7B02D8C3311BA48();
	void OnTaskDestroyed_828AA705474A108BC7B02D8C9318BBF9();
	void OnTaskDestroyed_828AA705474A108BC7B02D8C9F4D96DA();
	void OnTaskDestroyed_828AA705474A108BC7B02D8CAC7EC898();
	void OnTaskDestroyed_828AA705474A108BC7B02D8CD54BDCD5();
	void OnTotalDurationExpiredOrTaskDestroyed_828AA705474A108BC7B02D8C3311BA48();
	void OnTotalDurationExpiredOrTaskDestroyed_828AA705474A108BC7B02D8C9318BBF9();
	void OnTotalDurationExpiredOrTaskDestroyed_828AA705474A108BC7B02D8C9F4D96DA();
	void OnTotalDurationExpiredOrTaskDestroyed_828AA705474A108BC7B02D8CAC7EC898();
	void OnTotalDurationExpiredOrTaskDestroyed_828AA705474A108BC7B02D8CD54BDCD5();
	void Stand();

	void OnGrounded(bool* Grounded) const;
	void PickAnim(TArray<class UAnimMontage*>& InAnims, class UAnimMontage** Output) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_DeathReaction_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_DeathReaction_C")
	}
	static class UGA_DeathReaction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DeathReaction_C>();
	}
};
DUMPER7_ASSERTS_UGA_DeathReaction_C;

}

