#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DamageReaction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_DamageReaction.GA_DamageReaction_C
// 0x0188 (0x06D0 - 0x0548)
class UGA_DamageReaction_C final : public UDamageReactionAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0548(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<class UAnimMontage*>                   montage_stagger_small;                             // 0x0550(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   montage_stagger_large;                             // 0x0560(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   montage_strike;                                    // 0x0570(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   montage_getup;                                     // 0x0580(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   montage_blowoff;                                   // 0x0590(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimMontage*                           montage_upper;                                     // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           montage_land_upper;                                // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   montage_land_air_blowoff;                          // 0x05B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   montage_air_blowoff;                               // 0x05C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimMontage*                           montage_land_NBT;                                  // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   montage_mount_blowoff;                             // 0x05D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayEventData                     Temp_EventData;                                    // 0x05E8(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Temp_TimeWaitForLand;                              // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_ReactionEndedProperly;                        // 0x06A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_CanceledByDamageReaction;                     // 0x06A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A2[0x6];                                      // 0x06A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           montage_land_BTL;                                  // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Temp_TimeWaitForDeferredDeath;                     // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           montage_gift_heal;                                 // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           montage_gift_heal_NBT;                             // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bWasBattle;                                        // 0x06C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Abyss();
	void AirBlowOff();
	void ApplyExStateTag();
	void BlowOff();
	void EndReactionProperly(bool Invert, bool ForceBack);
	void ExecuteUbergraph_GA_DamageReaction(int32 EntryPoint);
	void GetDamageReaction(struct FGameplayTag* Tag);
	void GetUp(bool Invert, bool ForceBack);
	void GiftHeal();
	void GiftHeal_Consume();
	void GiftHeal_GetReady();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void Land();
	void Launch();
	void Mark_Wait_for_Land_Started();
	void Mark_Was_Battle();
	void MarkWaitForDeferredDeathStarted();
	void MountBlowOff();
	void OnAbilityCancelledBy(const class UGameplayAbility* InAbility);
	void OnBlendOut_C306438A448E634CC040BEA832A72D1B();
	void OnBlendOut_C306438A448E634CC040BEA85B3B2F85();
	void OnBlendOut_C306438A448E634CC040BEA85DE4560B();
	void OnBlendOut_C306438A448E634CC040BEA86630F705();
	void OnBlendOut_C306438A448E634CC040BEA86B7985C3();
	void OnBlendOut_C306438A448E634CC040BEA87FA4507F();
	void OnBlendOut_C306438A448E634CC040BEA88D6C6865();
	void OnBlendOut_C306438A448E634CC040BEA8A8EFBFB1();
	void OnBlendOut_C306438A448E634CC040BEA8B6190186();
	void OnBlendOut_C306438A448E634CC040BEA8BAB77E21();
	void OnBlendOut_C306438A448E634CC040BEA8EBD83823();
	void OnBlendOut_C306438A448E634CC040BEA8F663EA70();
	void OnCancelled_C306438A448E634CC040BEA832A72D1B();
	void OnCancelled_C306438A448E634CC040BEA85B3B2F85();
	void OnCancelled_C306438A448E634CC040BEA85DE4560B();
	void OnCancelled_C306438A448E634CC040BEA86630F705();
	void OnCancelled_C306438A448E634CC040BEA86B7985C3();
	void OnCancelled_C306438A448E634CC040BEA87FA4507F();
	void OnCancelled_C306438A448E634CC040BEA88D6C6865();
	void OnCancelled_C306438A448E634CC040BEA8A8EFBFB1();
	void OnCancelled_C306438A448E634CC040BEA8B6190186();
	void OnCancelled_C306438A448E634CC040BEA8BAB77E21();
	void OnCancelled_C306438A448E634CC040BEA8EBD83823();
	void OnCancelled_C306438A448E634CC040BEA8F663EA70();
	void OnCompleted_C306438A448E634CC040BEA832A72D1B();
	void OnCompleted_C306438A448E634CC040BEA85B3B2F85();
	void OnCompleted_C306438A448E634CC040BEA85DE4560B();
	void OnCompleted_C306438A448E634CC040BEA86630F705();
	void OnCompleted_C306438A448E634CC040BEA86B7985C3();
	void OnCompleted_C306438A448E634CC040BEA87FA4507F();
	void OnCompleted_C306438A448E634CC040BEA88D6C6865();
	void OnCompleted_C306438A448E634CC040BEA8A8EFBFB1();
	void OnCompleted_C306438A448E634CC040BEA8B6190186();
	void OnCompleted_C306438A448E634CC040BEA8BAB77E21();
	void OnCompleted_C306438A448E634CC040BEA8EBD83823();
	void OnCompleted_C306438A448E634CC040BEA8F663EA70();
	void OnInterrupted_C306438A448E634CC040BEA832A72D1B();
	void OnInterrupted_C306438A448E634CC040BEA85B3B2F85();
	void OnInterrupted_C306438A448E634CC040BEA85DE4560B();
	void OnInterrupted_C306438A448E634CC040BEA86630F705();
	void OnInterrupted_C306438A448E634CC040BEA86B7985C3();
	void OnInterrupted_C306438A448E634CC040BEA87FA4507F();
	void OnInterrupted_C306438A448E634CC040BEA88D6C6865();
	void OnInterrupted_C306438A448E634CC040BEA8A8EFBFB1();
	void OnInterrupted_C306438A448E634CC040BEA8B6190186();
	void OnInterrupted_C306438A448E634CC040BEA8BAB77E21();
	void OnInterrupted_C306438A448E634CC040BEA8EBD83823();
	void OnInterrupted_C306438A448E634CC040BEA8F663EA70();
	void OnMontageNotifyBegin_C306438A448E634CC040BEA832A72D1B(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyBegin_C306438A448E634CC040BEA85B3B2F85(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyBegin_C306438A448E634CC040BEA85DE4560B(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyBegin_C306438A448E634CC040BEA86630F705(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyBegin_C306438A448E634CC040BEA86B7985C3(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyBegin_C306438A448E634CC040BEA87FA4507F(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyBegin_C306438A448E634CC040BEA88D6C6865(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyBegin_C306438A448E634CC040BEA8A8EFBFB1(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyBegin_C306438A448E634CC040BEA8B6190186(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyBegin_C306438A448E634CC040BEA8BAB77E21(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyBegin_C306438A448E634CC040BEA8EBD83823(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyBegin_C306438A448E634CC040BEA8F663EA70(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_C306438A448E634CC040BEA832A72D1B(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_C306438A448E634CC040BEA85B3B2F85(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_C306438A448E634CC040BEA85DE4560B(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_C306438A448E634CC040BEA86630F705(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_C306438A448E634CC040BEA86B7985C3(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_C306438A448E634CC040BEA87FA4507F(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_C306438A448E634CC040BEA88D6C6865(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_C306438A448E634CC040BEA8A8EFBFB1(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_C306438A448E634CC040BEA8B6190186(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_C306438A448E634CC040BEA8BAB77E21(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_C306438A448E634CC040BEA8EBD83823(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_C306438A448E634CC040BEA8F663EA70(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnTaskDestroyed_C306438A448E634CC040BEA832A72D1B();
	void OnTaskDestroyed_C306438A448E634CC040BEA85B3B2F85();
	void OnTaskDestroyed_C306438A448E634CC040BEA85DE4560B();
	void OnTaskDestroyed_C306438A448E634CC040BEA86630F705();
	void OnTaskDestroyed_C306438A448E634CC040BEA86B7985C3();
	void OnTaskDestroyed_C306438A448E634CC040BEA87FA4507F();
	void OnTaskDestroyed_C306438A448E634CC040BEA88D6C6865();
	void OnTaskDestroyed_C306438A448E634CC040BEA8A8EFBFB1();
	void OnTaskDestroyed_C306438A448E634CC040BEA8B6190186();
	void OnTaskDestroyed_C306438A448E634CC040BEA8BAB77E21();
	void OnTaskDestroyed_C306438A448E634CC040BEA8EBD83823();
	void OnTaskDestroyed_C306438A448E634CC040BEA8F663EA70();
	void OnTotalDurationExpiredOrTaskDestroyed_C306438A448E634CC040BEA832A72D1B();
	void OnTotalDurationExpiredOrTaskDestroyed_C306438A448E634CC040BEA85B3B2F85();
	void OnTotalDurationExpiredOrTaskDestroyed_C306438A448E634CC040BEA85DE4560B();
	void OnTotalDurationExpiredOrTaskDestroyed_C306438A448E634CC040BEA86630F705();
	void OnTotalDurationExpiredOrTaskDestroyed_C306438A448E634CC040BEA86B7985C3();
	void OnTotalDurationExpiredOrTaskDestroyed_C306438A448E634CC040BEA87FA4507F();
	void OnTotalDurationExpiredOrTaskDestroyed_C306438A448E634CC040BEA88D6C6865();
	void OnTotalDurationExpiredOrTaskDestroyed_C306438A448E634CC040BEA8A8EFBFB1();
	void OnTotalDurationExpiredOrTaskDestroyed_C306438A448E634CC040BEA8B6190186();
	void OnTotalDurationExpiredOrTaskDestroyed_C306438A448E634CC040BEA8BAB77E21();
	void OnTotalDurationExpiredOrTaskDestroyed_C306438A448E634CC040BEA8EBD83823();
	void OnTotalDurationExpiredOrTaskDestroyed_C306438A448E634CC040BEA8F663EA70();
	void RequestEndAbility(bool Invert, bool ForceBack);
	void RequestEndWithNonCombatDeath();
	void StaggerLarge();
	void StaggerSmall();
	void Strike();
	void UnapplyExStateTag();
	void UpdateMotionWarpingTarget();
	void Upper();
	void WaitForLand_AirBlowOff();
	void WaitForLand_Upper();

	float GetAngleInRad(bool Invert, bool ForceBack, const struct FGameplayEventData& EventData) const;
	void GetKnockBackDir(const struct FGameplayEventData& EventData, struct FVector* KnockBackDir) const;
	bool Is_Landed_or_Wait_Time_Expired(double TimeLimit) const;
	bool IsDead() const;
	bool IsDeathDeferred() const;
	bool IsReactingToDeath() const;
	bool IsReactiongToStatusEffect() const;
	void OnGrounded(bool* Grounded) const;
	void PickAnim(TArray<class UAnimMontage*>& InAnims, bool InInvert, bool InForceBack, class UAnimMontage** montage_stagger_small_front) const;
	bool ShouldPlayMontage() const;
	bool ShouldWaitForDeferredDeath() const;
	bool WasBattle() const;
	void WasNonBattleDeath(bool* TRUE_0) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_DamageReaction_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_DamageReaction_C")
	}
	static class UGA_DamageReaction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DamageReaction_C>();
	}
};
DUMPER7_ASSERTS_UGA_DamageReaction_C;

}

