#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_LocoShuffleturn_New

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_LocoShuffleturn_New.GA_LocoShuffleturn_New_C
// 0x0118 (0x0658 - 0x0540)
class UGA_LocoShuffleturn_New_C final : public UActionHumanGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Angle_Target;                                      // 0x0548(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54C[0x4];                                      // 0x054C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Angle_Current;                                     // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   Anims_RightSide;                                   // 0x0558(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   Anims_LeftSide;                                    // 0x0568(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   Anims_RightSide_Crouch;                            // 0x0578(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   Anims_LeftSide_Crouch;                             // 0x0588(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   Anims_RightSide_NonCombat;                         // 0x0598(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   Anims_LeftSide_NonCombat;                          // 0x05A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   Anims_RightSide_InBaseCamp;                        // 0x05B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UAnimMontage*>                   Anims_LeftSide_InBaseCamp;                         // 0x05C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          TurnRight;                                         // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D9[0x7];                                      // 0x05D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Angle_Turn;                                        // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCrouched;                                        // 0x05E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E9[0x3];                                      // 0x05E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AnimNum;                                           // 0x05EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Anim;                                              // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DurationAnimTakesToRotate;                         // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartTime;                                         // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RemainingRotateTime;                               // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActionHumanProcessRootMotionDelegateHandle Handle_RotationFix;                           // 0x0610(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        PlayScale;                                         // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Anim_Crouched;                                     // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        LatestTimeAnimStarted;                             // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CrouchStateChangingAllowed;                        // 0x0638(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                DurationsToRotate_EachAngle;                       // 0x0640(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        TimeAbilityActivated;                              // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void End_if_Not_Idle(bool* IsEnded);
	void ExecuteUbergraph_GA_LocoShuffleturn_New(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_93D6A3D444B9B4A09CB6CD8981AEB860();
	void OnBlendOut_9753ACF1455A9F1C68B560BB2ED02519();
	void OnCancelled_93D6A3D444B9B4A09CB6CD8981AEB860();
	void OnCancelled_9753ACF1455A9F1C68B560BB2ED02519();
	void OnCompleted_93D6A3D444B9B4A09CB6CD8981AEB860();
	void OnCompleted_9753ACF1455A9F1C68B560BB2ED02519();
	void OnInterrupted_93D6A3D444B9B4A09CB6CD8981AEB860();
	void OnInterrupted_9753ACF1455A9F1C68B560BB2ED02519();
	void OnMontageNotifyBegin_93D6A3D444B9B4A09CB6CD8981AEB860(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyBegin_9753ACF1455A9F1C68B560BB2ED02519(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_93D6A3D444B9B4A09CB6CD8981AEB860(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_9753ACF1455A9F1C68B560BB2ED02519(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnTaskDestroyed_93D6A3D444B9B4A09CB6CD8981AEB860();
	void OnTaskDestroyed_9753ACF1455A9F1C68B560BB2ED02519();
	void OnTotalDurationExpiredOrTaskDestroyed_93D6A3D444B9B4A09CB6CD8981AEB860();
	void OnTotalDurationExpiredOrTaskDestroyed_9753ACF1455A9F1C68B560BB2ED02519();
	void UnbindIfRemainingTimeElapsed();

	TArray<class UAnimMontage*> GetAnims_Crouched() const;
	TArray<class UAnimMontage*> GetAnims_Stand() const;
	bool IsInBaseCamp() const;
	bool IsNonBatle() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_LocoShuffleturn_New_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_LocoShuffleturn_New_C")
	}
	static class UGA_LocoShuffleturn_New_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_LocoShuffleturn_New_C>();
	}
};
DUMPER7_ASSERTS_UGA_LocoShuffleturn_New_C;

}

