#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Land

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Land.GA_Land_C
// 0x0058 (0x0598 - 0x0540)
class UGA_Land_C final : public UGA_Land
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsLandingWhileMoving;                              // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeCanBeCancelByMoveNotifyBegun;                  // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAfterAllowLandingCancell;                        // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Montage_Land_InPlace;                              // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage_Land_Jog;                                  // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage_Land_Walk;                                 // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage_Land_Heavy_BTL;                            // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage_Land_Heavy_NBT;                            // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        HeavyLandHeight;                                   // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasOnTheEdge;                                      // 0x0590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Land(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnAbilityCancelledBy(const class UGameplayAbility* InAbility);
	void OnBlendOut_7EC679C446BCD9C0B93D828CB12E8AC7();
	void OnCancelled_7EC679C446BCD9C0B93D828CB12E8AC7();
	void OnCompleted_7EC679C446BCD9C0B93D828CB12E8AC7();
	void OnInterrupted_7EC679C446BCD9C0B93D828CB12E8AC7();
	void OnMontageNotifyBegin_7EC679C446BCD9C0B93D828CB12E8AC7(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_7EC679C446BCD9C0B93D828CB12E8AC7(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnTaskDestroyed_7EC679C446BCD9C0B93D828CB12E8AC7();
	void OnTotalDurationExpiredOrTaskDestroyed_7EC679C446BCD9C0B93D828CB12E8AC7();

	void IsMoveState(EPlayerMoveState MoveState, bool* Result) const;
	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Land_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Land_C")
	}
	static class UGA_Land_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Land_C>();
	}
};
DUMPER7_ASSERTS_UGA_Land_C;

}

