#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_LadderClimb_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.DisableMovementErrorChecks
// 0x0008 (0x0008 - 0x0000)
struct GA_LadderClimb_Base_C_DisableMovementErrorChecks final
{
public:
	class AActionHumanCharacter*                  CallFunc_GetOwningAppCharacter_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_DisableMovementErrorChecks;

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.EndWithFall
// 0x0050 (0x0050 - 0x0000)
struct GA_LadderClimb_Base_C_EndWithFall final
{
public:
	struct FVector                                CurrentVelocity;                                   // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActionHumanCharacter*                  CallFunc_GetOwningAppCharacter_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_EndWithFall;

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.EndWithLanded
// 0x0018 (0x0018 - 0x0000)
struct GA_LadderClimb_Base_C_EndWithLanded final
{
public:
	struct FVector                                CurrentVelocity;                                   // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_EndWithLanded;

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.ErrorBreak
// 0x0020 (0x0020 - 0x0000)
struct GA_LadderClimb_Base_C_ErrorBreak final
{
public:
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_ErrorBreak;

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.ExecuteUbergraph_GA_LadderClimb_Base
// 0x02E0 (0x02E0 - 0x0000)
struct GA_LadderClimb_Base_C_ExecuteUbergraph_GA_LadderClimb_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InName_1;                       // 0x0054(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNotifyEvent                       K2Node_CustomEvent_InNotifyEvent_1;                // 0x0060(0x00B8)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent)> K2Node_CreateDelegate_OutputDelegate_5; // 0x0118(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InName;                         // 0x0128(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEvent                       K2Node_CustomEvent_InNotifyEvent;                  // 0x0130(0x00B8)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent)> K2Node_CreateDelegate_OutputDelegate_6; // 0x01E8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEvent                       Temp_struct_Variable;                              // 0x01F8(0x00B8)(ContainsInstancedReference)
	class FName                                   Temp_name_Variable;                                // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x02BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x02BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CreateNetLocoPlayMontageAndWaitProxy_OutDuration; // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_ActionHumanPlayMontage*    CallFunc_CreateNetLocoPlayMontageAndWaitProxy_ReturnValue; // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_ExecuteUbergraph_GA_LadderClimb_Base;

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_LadderClimb_Base_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_K2_OnEndAbility;

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.OnAnimMontageTaskDestroyedOrAnimMontageEnded
// 0x0058 (0x0058 - 0x0000)
struct GA_LadderClimb_Base_C_OnAnimMontageTaskDestroyedOrAnimMontageEnded final
{
public:
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_2;     // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_3;     // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_4;     // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_5;     // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_6;     // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_7;     // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_8;     // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_9;     // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_10;    // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_OnAnimMontageTaskDestroyedOrAnimMontageEnded;

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.OnMontageNotifyBegin_431D07E840C9EAD9077C2B92670C0C0F
// 0x00C0 (0x00C0 - 0x0000)
struct GA_LadderClimb_Base_C_OnMontageNotifyBegin_431D07E840C9EAD9077C2B92670C0C0F final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEvent                       InNotifyEvent;                                     // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_OnMontageNotifyBegin_431D07E840C9EAD9077C2B92670C0C0F;

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.OnMontageNotifyEnd_431D07E840C9EAD9077C2B92670C0C0F
// 0x00C0 (0x00C0 - 0x0000)
struct GA_LadderClimb_Base_C_OnMontageNotifyEnd_431D07E840C9EAD9077C2B92670C0C0F final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEvent                       InNotifyEvent;                                     // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_OnMontageNotifyEnd_431D07E840C9EAD9077C2B92670C0C0F;

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.SetCapsuleRadiusToDefault
// 0x0008 (0x0008 - 0x0000)
struct GA_LadderClimb_Base_C_SetCapsuleRadiusToDefault final
{
public:
	class AActionHumanCharacter*                  CallFunc_GetOwningAppCharacter_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_SetCapsuleRadiusToDefault;

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.SetCapsuleRadiusToMinimum
// 0x0010 (0x0010 - 0x0000)
struct GA_LadderClimb_Base_C_SetCapsuleRadiusToMinimum final
{
public:
	class AActionHumanCharacter*                  CallFunc_GetOwningAppCharacter_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledCapsuleRadius_ReturnValue;       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_SetCapsuleRadiusToMinimum;

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.SetMovementModeToFalling
// 0x0010 (0x0010 - 0x0000)
struct GA_LadderClimb_Base_C_SetMovementModeToFalling final
{
public:
	class AActionHumanCharacter*                  CallFunc_GetOwningAppCharacter_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActionHumanMovementComponent*          CallFunc_GetAppMovementComponent_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_SetMovementModeToFalling;

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.SetMovementModeToFlying
// 0x0010 (0x0010 - 0x0000)
struct GA_LadderClimb_Base_C_SetMovementModeToFlying final
{
public:
	class AActionHumanCharacter*                  CallFunc_GetOwningAppCharacter_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActionHumanMovementComponent*          CallFunc_GetAppMovementComponent_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_SetMovementModeToFlying;

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.SetMovementModeToLadderClimbing
// 0x0018 (0x0018 - 0x0000)
struct GA_LadderClimb_Base_C_SetMovementModeToLadderClimbing final
{
public:
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActionHumanCharacter*                  CallFunc_GetOwningAppCharacter_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActionHumanMovementComponent*          CallFunc_GetAppMovementComponent_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_SetMovementModeToLadderClimbing;

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.SetMovementModeToWalking
// 0x0010 (0x0010 - 0x0000)
struct GA_LadderClimb_Base_C_SetMovementModeToWalking final
{
public:
	class AActionHumanCharacter*                  CallFunc_GetOwningAppCharacter_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActionHumanMovementComponent*          CallFunc_GetAppMovementComponent_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_SetMovementModeToWalking;

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.SetNetMovementModeToDefault
// 0x0008 (0x0008 - 0x0000)
struct GA_LadderClimb_Base_C_SetNetMovementModeToDefault final
{
public:
	class AActionHumanCharacter*                  CallFunc_GetOwningAppCharacter_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_SetNetMovementModeToDefault;

// Function GA_LadderClimb_Base.GA_LadderClimb_Base_C.FindFloor
// 0x0148 (0x0148 - 0x0000)
struct GA_LadderClimb_Base_C_FindFloor final
{
public:
	bool                                          Found;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FloorDist;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActionHumanCharacter*                  CallFunc_GetOwningAppCharacter_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UActionHumanMovementComponent*          CallFunc_GetAppMovementComponent_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFindFloorResult                       CallFunc_K2_FindFloor_FloorResult;                 // 0x0038(0x0108)(NoDestructor, ContainsInstancedReference)
	double                                        K2Node_FunctionResult_Floordist_ImplicitCast;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_Base_C_FindFloor;

}

