#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_LadderClimb_ClimbDown_RightSide_Fast_Start

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function GA_LadderClimb_ClimbDown_RightSide_Fast_Start.GA_LadderClimb_ClimbDown_RightSide_Fast_Start_C.ExecuteUbergraph_GA_LadderClimb_ClimbDown_RightSide_Fast_Start
// 0x0310 (0x0310 - 0x0000)
struct GA_LadderClimb_ClimbDown_RightSide_Fast_Start_C_ExecuteUbergraph_GA_LadderClimb_ClimbDown_RightSide_Fast_Start final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InName_1;                       // 0x0064(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNotifyEvent                       K2Node_CustomEvent_InNotifyEvent_1;                // 0x0070(0x00B8)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0128(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InName;                         // 0x0138(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEvent                       K2Node_CustomEvent_InNotifyEvent;                  // 0x0140(0x00B8)(ConstParm, ContainsInstancedReference)
	TDelegate<void(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent)> K2Node_CreateDelegate_OutputDelegate_7; // 0x01F8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEvent                       Temp_struct_Variable;                              // 0x0208(0x00B8)(ContainsInstancedReference)
	class FName                                   Temp_name_Variable;                                // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CreateNetLocoPlayMontageAndWaitProxy_OutDuration; // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_ActionHumanPlayMontage*    CallFunc_CreateNetLocoPlayMontageAndWaitProxy_ReturnValue; // 0x02D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindFloor_Found;                          // 0x02DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FindFloor_Floordist;                      // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActionHumanGameplayAbilityMessage     K2Node_Event_InMessage;                            // 0x02F0(0x0018)(ConstParm, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0309(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_ClimbDown_RightSide_Fast_Start_C_ExecuteUbergraph_GA_LadderClimb_ClimbDown_RightSide_Fast_Start;

// Function GA_LadderClimb_ClimbDown_RightSide_Fast_Start.GA_LadderClimb_ClimbDown_RightSide_Fast_Start_C.OnAbilityCommitted
// 0x0008 (0x0008 - 0x0000)
struct GA_LadderClimb_ClimbDown_RightSide_Fast_Start_C_OnAbilityCommitted final
{
public:
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0000(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_LadderClimb_ClimbDown_RightSide_Fast_Start_C_OnAbilityCommitted;

// Function GA_LadderClimb_ClimbDown_RightSide_Fast_Start.GA_LadderClimb_ClimbDown_RightSide_Fast_Start_C.OnMontageNotifyBegin_15C8AAB14D08BAE9261B84B400486AFA
// 0x00C0 (0x00C0 - 0x0000)
struct GA_LadderClimb_ClimbDown_RightSide_Fast_Start_C_OnMontageNotifyBegin_15C8AAB14D08BAE9261B84B400486AFA final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEvent                       InNotifyEvent;                                     // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_GA_LadderClimb_ClimbDown_RightSide_Fast_Start_C_OnMontageNotifyBegin_15C8AAB14D08BAE9261B84B400486AFA;

// Function GA_LadderClimb_ClimbDown_RightSide_Fast_Start.GA_LadderClimb_ClimbDown_RightSide_Fast_Start_C.OnMontageNotifyEnd_15C8AAB14D08BAE9261B84B400486AFA
// 0x00C0 (0x00C0 - 0x0000)
struct GA_LadderClimb_ClimbDown_RightSide_Fast_Start_C_OnMontageNotifyEnd_15C8AAB14D08BAE9261B84B400486AFA final
{
public:
	class FName                                   InName;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNotifyEvent                       InNotifyEvent;                                     // 0x0008(0x00B8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_GA_LadderClimb_ClimbDown_RightSide_Fast_Start_C_OnMontageNotifyEnd_15C8AAB14D08BAE9261B84B400486AFA;

// Function GA_LadderClimb_ClimbDown_RightSide_Fast_Start.GA_LadderClimb_ClimbDown_RightSide_Fast_Start_C.OnNotifyMessage
// 0x0018 (0x0018 - 0x0000)
struct GA_LadderClimb_ClimbDown_RightSide_Fast_Start_C_OnNotifyMessage final
{
public:
	struct FActionHumanGameplayAbilityMessage     InMessage;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
DUMPER7_ASSERTS_GA_LadderClimb_ClimbDown_RightSide_Fast_Start_C_OnNotifyMessage;

}

