#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_LocoCutturn

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_LocoCutturn.GA_LocoCutturn_C
// 0x0048 (0x0588 - 0x0540)
class UGA_LocoCutturn_C final : public UActionHumanGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FActionHumanProcessRootMotionDelegateHandle ProcessRootMotionHandleForYawCorrection;      // 0x0548(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         YawCorrectionDuration;                             // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55C[0x4];                                      // 0x055C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Anim_R;                                            // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Anim_L;                                            // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           PickedMontage;                                     // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Anim_R_NonCombat;                                  // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Anim_L_NonCombat;                                  // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BindYawCorrection(double& SlackYaw);
	void ExecuteUbergraph_GA_LocoCutturn(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_FBBA5F424B4EDD814EFBB5914DC7521F();
	void OnCancelled_FBBA5F424B4EDD814EFBB5914DC7521F();
	void OnCompleted_FBBA5F424B4EDD814EFBB5914DC7521F();
	void OnInterrupted_FBBA5F424B4EDD814EFBB5914DC7521F();
	void OnMontageNotifyBegin_FBBA5F424B4EDD814EFBB5914DC7521F(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_FBBA5F424B4EDD814EFBB5914DC7521F(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnTaskDestroyed_FBBA5F424B4EDD814EFBB5914DC7521F();
	void OnTotalDurationExpiredOrTaskDestroyed_FBBA5F424B4EDD814EFBB5914DC7521F();
	class UAnimMontage* PickBestAnimAndSlack(double* Slack);
	void UnbindYawCorrection();

	bool K2_CanActivateAbility(const struct FGameplayAbilityActorInfo& ActorInfo, const struct FGameplayAbilitySpecHandle& Handle, struct FGameplayTagContainer* RelevantTags) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_LocoCutturn_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_LocoCutturn_C")
	}
	static class UGA_LocoCutturn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_LocoCutturn_C>();
	}
};
DUMPER7_ASSERTS_UGA_LocoCutturn_C;

}

