#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ReloadFailed_Bayonet_Air

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ReloadFailed_Bayonet_Air.GA_ReloadFailed_Bayonet_Air_C
// 0x0030 (0x0578 - 0x0548)
class UGA_ReloadFailed_Bayonet_Air_C final : public UReloadMagazineAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0548(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        BeginTime;                                         // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SameAnimSectionLenght;                             // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StackBeginTime;                                    // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StacVelocityThreshold;                             // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StackSafetyLimit;                                  // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_ReloadFailed_Bayonet_Air(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_BABF5B154EAFB2BC4CE6D2A52B79694E();
	void OnCancelled_BABF5B154EAFB2BC4CE6D2A52B79694E();
	void OnCompleted_BABF5B154EAFB2BC4CE6D2A52B79694E();
	void OnInterrupted_BABF5B154EAFB2BC4CE6D2A52B79694E();
	void OnMontageNotifyBegin_BABF5B154EAFB2BC4CE6D2A52B79694E(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnMontageNotifyEnd_BABF5B154EAFB2BC4CE6D2A52B79694E(const class FName InName, const struct FAnimNotifyEvent& InNotifyEvent);
	void OnTaskDestroyed_BABF5B154EAFB2BC4CE6D2A52B79694E();
	void OnTotalDurationExpiredOrTaskDestroyed_BABF5B154EAFB2BC4CE6D2A52B79694E();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_ReloadFailed_Bayonet_Air_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_ReloadFailed_Bayonet_Air_C")
	}
	static class UGA_ReloadFailed_Bayonet_Air_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ReloadFailed_Bayonet_Air_C>();
	}
};
DUMPER7_ASSERTS_UGA_ReloadFailed_Bayonet_Air_C;

}

