#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IF_ConfigKeyAssignEntry

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.SetSelectKeyType
// 0x0001 (0x0001 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_SetSelectKeyType final
{
public:
	EConfigKeyType                                InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_SetSelectKeyType;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.SetIsExpansion
// 0x0002 (0x0002 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_SetIsExpansion final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutFlag;                                           // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_SetIsExpansion;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.SetIsDuplication
// 0x0002 (0x0002 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_SetIsDuplication final
{
public:
	bool                                          InIsDuplication;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EConfigKeyType                                InKeyType;                                         // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_SetIsDuplication;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.SetEditKeyAssign
// 0x0018 (0x0018 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_SetEditKeyAssign final
{
public:
	TArray<struct FKey>                           InKey;                                             // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EConfigKeyType                                InKeyType;                                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_SetEditKeyAssign;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.OnKeyTypeChange
// 0x0001 (0x0001 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_OnKeyTypeChange final
{
public:
	EConfigKeyType                                InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_OnKeyTypeChange;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.GetItemName
// 0x0010 (0x0010 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_GetItemName final
{
public:
	class FText                                   OutInputActionName;                                // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_GetItemName;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.GetIsTriggerAxis
// 0x0001 (0x0001 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_GetIsTriggerAxis final
{
public:
	bool                                          OutIsTriggerAxis;                                  // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_GetIsTriggerAxis;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.GetIsExpansion
// 0x0001 (0x0001 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_GetIsExpansion final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_GetIsExpansion;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.GetIsDuplication
// 0x0002 (0x0002 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_GetIsDuplication final
{
public:
	EConfigKeyType                                InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutIsDuplication;                                  // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_GetIsDuplication;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.GetIsCategoryEntry
// 0x0001 (0x0001 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_GetIsCategoryEntry final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_GetIsCategoryEntry;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.GetInputActionTag
// 0x0008 (0x0008 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_GetInputActionTag final
{
public:
	struct FGameplayTag                           OutTag;                                            // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_GetInputActionTag;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.GetEditKeyByKeyType
// 0x0018 (0x0018 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_GetEditKeyByKeyType final
{
public:
	EConfigKeyType                                InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           OutKey;                                            // 0x0008(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_GetEditKeyByKeyType;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.GetEditKey
// 0x0030 (0x0030 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_GetEditKey final
{
public:
	TArray<struct FKey>                           InGamePadKey;                                      // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FKey>                           InKeyboardKey_Main;                                // 0x0010(0x0010)(Parm, OutParm)
	TArray<struct FKey>                           InKeyboardKey_Sub;                                 // 0x0020(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_GetEditKey;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.GetDescriptionTexture
// 0x0030 (0x0030 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_GetDescriptionTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              OutTexture;                                        // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          OutIsValid;                                        // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_GetDescriptionTexture;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.GetDescriptionText
// 0x0010 (0x0010 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_GetDescriptionText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_GetDescriptionText;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.GetDescriptionMoviePath
// 0x0018 (0x0018 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_GetDescriptionMoviePath final
{
public:
	class FString                                 OutPath;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          OutIsValid;                                        // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_GetDescriptionMoviePath;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.GetAssignEnableType
// 0x0001 (0x0001 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_GetAssignEnableType final
{
public:
	EConfigKeyAssignEnableType                    OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_GetAssignEnableType;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.GetApplyKeyByKeyType
// 0x0018 (0x0018 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_GetApplyKeyByKeyType final
{
public:
	EConfigKeyType                                InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           OutKey;                                            // 0x0008(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_GetApplyKeyByKeyType;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.GetApplyKey
// 0x0030 (0x0030 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_GetApplyKey final
{
public:
	TArray<struct FKey>                           InGamePadKey;                                      // 0x0000(0x0010)(Parm, OutParm)
	TArray<struct FKey>                           InKeyboardKey_Main;                                // 0x0010(0x0010)(Parm, OutParm)
	TArray<struct FKey>                           InKeyboardKey_Sub;                                 // 0x0020(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_GetApplyKey;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.ClearKey
// 0x0002 (0x0002 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_ClearKey final
{
public:
	EConfigKeyType                                InKeyType;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSuccess;                                         // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_ClearKey;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.CheckIsKeyDefault
// 0x0001 (0x0001 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_CheckIsKeyDefault final
{
public:
	bool                                          OutIsKeyDefault;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_CheckIsKeyDefault;

// Function IF_ConfigKeyAssignEntry.IF_ConfigKeyAssignEntry_C.CheckIsKeyApply
// 0x0001 (0x0001 - 0x0000)
struct IF_ConfigKeyAssignEntry_C_CheckIsKeyApply final
{
public:
	bool                                          OutIsKeyApply;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_IF_ConfigKeyAssignEntry_C_CheckIsKeyApply;

}

