#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OnlineSession

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CommonUser_structs.hpp"
#include "CommonUser_classes.hpp"
#include "OnlineSession_structs.hpp"


namespace SDK
{

// Class OnlineSession.OnlineSessionBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UOnlineSessionBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static float OnlineSessionSampleFunction(float Param);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineSessionBPLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineSessionBPLibrary")
	}
	static class UOnlineSessionBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineSessionBPLibrary>();
	}
};
DUMPER7_ASSERTS_UOnlineSessionBPLibrary;

// Class OnlineSession.OnlineSessionSubsystem
// 0x00F0 (0x0230 - 0x0140)
class UOnlineSessionSubsystem : public UCommonSessionSubsystem
{
public:
	uint8                                         Pad_140[0x68];                                     // 0x0140(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class ASessionProxy>              SessionProxyClass;                                 // 0x01A8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASessionProxy*                          SessionProxy;                                      // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TArray<class UCommonSession_SearchResult*>    SearchResults;                                     // 0x01B8(0x0010)(ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_1C8[0x68];                                     // 0x01C8(0x0068)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AdvertiseSession();
	void BreakUpSession();
	void CreateSession(bool bInUseInvite);
	void DestroySession();
	void EndSession();
	void FindAvailableSession();
	class APlayerState* GetGuestPlayerState();
	class APlayerState* GetHostPlayerState();
	class FString GetSessionStateStr();
	bool HasSessions();
	bool HaveNamedSession(class FName InSessionName);
	bool IsAdvertiseSession();
	bool IsGuestPlayer();
	bool IsHostPlayer();
	bool IsWorldHostPlayer();
	void KeepSessionPrivate();
	void KickGuestPlayer();
	void LeaveSession();
	void SetLANMatch(bool bInLANMatch);
	void SetPlayerNum(const int32 InPlayerNum);
	void SetSessionMapID(const struct FPrimaryAssetId& InMapID);
	void TravelToClient();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineSessionSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineSessionSubsystem")
	}
	static class UOnlineSessionSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineSessionSubsystem>();
	}
};
DUMPER7_ASSERTS_UOnlineSessionSubsystem;

// Class OnlineSession.OnlineUserSubsystem
// 0x0070 (0x01C8 - 0x0158)
class UOnlineUserSubsystem final : public UCommonUserSubsystem
{
public:
	uint8                                         Pad_158[0x70];                                     // 0x0158(0x0070)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool GetCanPlayOnline(int32 InLocalPlayerIndex);
	void GetFriendsInfo(TArray<class FString>* OutFriendName, TArray<struct FUniqueNetIdRepl>* OutFriendNetId);
	struct FUniqueNetIdRepl GetLocalUserNetId(int32 InLocalPlayerIndex);
	struct FPlatformUserId GetPlatformUserId(int32 InLocalPlayerIndex);
	class FString GetUserNickName();
	ECommonUserPrivilegeResult GetUserPrivilege(int32 InLocalPlayerIndex, ECommonUserPrivilege TargetPrivilege);
	bool IsPlayerLoggedIn(int32 InLocalPlayerIndex);
	void LoginUser();
	void ReadFriendsList();
	void SendSessionInvite(int32 InIndex);
	void ShowFriendsUI();
	void ShowInviteUI();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("OnlineUserSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OnlineUserSubsystem")
	}
	static class UOnlineUserSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOnlineUserSubsystem>();
	}
};
DUMPER7_ASSERTS_UOnlineUserSubsystem;

// Class OnlineSession.SessionProxy
// 0x0000 (0x02A0 - 0x02A0)
class ASessionProxy : public AInfo
{
public:
	void ClientMessage(const ESessionMessageType InType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SessionProxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SessionProxy")
	}
	static class ASessionProxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASessionProxy>();
	}
};
DUMPER7_ASSERTS_ASessionProxy;

}

