#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PPABP_MT020_PCMotorcycle_000

#include "Basic.hpp"

#include "AppAnimGraph_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PPABP_MT020_PCMotorcycle_000.PPABP_MT020_PCMotorcycle_000_C
// 0x0B00 (0x1210 - 0x0710)
class UPPABP_MT020_PCMotorcycle_000_C final : public UAnimDynamicsPostProcessAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0710(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0718(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0720(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0728(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x07E0(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0800(0x0020)()
	struct FAppAnimNode_RigidBody                 AppAnimGraphNode_RigidBody;                        // 0x0820(0x09B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x11D0(0x0020)()
	struct FVector                                Gravity_Param;                                     // 0x11F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Time;                                              // 0x1208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_MT020_PCMotorcycle_000_AppAnimGraphNode_RigidBody_6D3EC04740D0283D8FBC27BEE1D0F7AF();
	void ExecuteUbergraph_PPABP_MT020_PCMotorcycle_000(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PPABP_MT020_PCMotorcycle_000_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PPABP_MT020_PCMotorcycle_000_C")
	}
	static class UPPABP_MT020_PCMotorcycle_000_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPPABP_MT020_PCMotorcycle_000_C>();
	}
};
DUMPER7_ASSERTS_UPPABP_MT020_PCMotorcycle_000_C;

}

