#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PPABP_BodyBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ControlRig_structs.hpp"
#include "Extensions_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PPABP_BodyBase.PPABP_BodyBase_C
// 0x0AA0 (0x0E10 - 0x0370)
class UPPABP_BodyBase_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03A8(0x00B8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x0460(0x04D0)(ContainsInstancedReference)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0930(0x0020)()
	struct FAppAnimNode_ShoeSole                  AppAnimGraphNode_ShoeSole;                         // 0x0950(0x0330)()
	struct FAppAnimNode_FABRIK                    AppAnimGraphNode_FABRIK;                           // 0x0C80(0x0170)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0DF0(0x0020)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_PPABP_BodyBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PPABP_BodyBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PPABP_BodyBase_C")
	}
	static class UPPABP_BodyBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPPABP_BodyBase_C>();
	}
};
DUMPER7_ASSERTS_UPPABP_BodyBase_C;

}

