#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PPABP_CopyPose

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PPABP_CopyPose.PPABP_CopyPose_C
// 0x0100 (0x0470 - 0x0370)
class UPPABP_CopyPose_C final : public UAnimInstance
{
public:
	uint8                                         Pad_368[0x8];                                      // 0x0368(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0378(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0380(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0388(0x0020)()
	struct FAnimNode_PoseSnapshot                 AnimGraphNode_PoseSnapshot;                        // 0x03A8(0x0090)()
	struct FPoseSnapshot                          PoseSnapshot;                                      // 0x0438(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_PPABP_CopyPose(int32 EntryPoint);
	void SetPoseSnapshot(const struct FPoseSnapshot& PoseSnapshot_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PPABP_CopyPose_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PPABP_CopyPose_C")
	}
	static class UPPABP_CopyPose_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPPABP_CopyPose_C>();
	}
};
DUMPER7_ASSERTS_UPPABP_CopyPose_C;

}

