#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PPABP_BF_GiantNolegs

#include "Basic.hpp"

#include "AppAnimGraph_structs.hpp"
#include "Engine_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PPABP_BF_GiantNolegs.PPABP_BF_GiantNolegs_C
// 0x4D50 (0x5460 - 0x0710)
class UPPABP_BF_GiantNolegs_C final : public UAnimDynamicsPostProcessAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0710(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0718(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0720(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0728(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0748(0x00B8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0800(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0820(0x0020)()
	struct FAppAnimNode_RigidBody                 AppAnimGraphNode_RigidBody;                        // 0x0840(0x09B0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x11F0(0x07B0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x19A0(0x07B0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x2150(0x07B0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x2900(0x07B0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x30B0(0x07B0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x3860(0x07B0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x4010(0x07B0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x47C0(0x07B0)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x4F70(0x04D0)(ContainsInstancedReference)
	struct FVector                                Gravity_Param;                                     // 0x5440(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_BF_GiantNolegs_AnimGraphNode_KawaiiPhysics_0C31EDA444FCA9FDB3C7C48A2D77FB2F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_BF_GiantNolegs_AnimGraphNode_KawaiiPhysics_3CF063414D31BACBD15EB791CBEF7964();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_BF_GiantNolegs_AnimGraphNode_KawaiiPhysics_8B9E213348329E9CCAA101989E31BC3A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_BF_GiantNolegs_AnimGraphNode_KawaiiPhysics_A0C5D494423689A3E860F2BB5021B159();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_BF_GiantNolegs_AnimGraphNode_KawaiiPhysics_A575372F4326797AF8F605997CC37CCE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_BF_GiantNolegs_AnimGraphNode_KawaiiPhysics_B21838A94E89A3D9293278B7E6399345();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_BF_GiantNolegs_AnimGraphNode_KawaiiPhysics_D11FB026427DC6063AE4E3B3088BE646();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_BF_GiantNolegs_AnimGraphNode_KawaiiPhysics_E6D743D84B73C8AF29FFA28ED4ECAED5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_BF_GiantNolegs_AppAnimGraphNode_RigidBody_E03E371446CD9159F22E96A7BD74DA41();
	void ExecuteUbergraph_PPABP_BF_GiantNolegs(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PPABP_BF_GiantNolegs_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PPABP_BF_GiantNolegs_C")
	}
	static class UPPABP_BF_GiantNolegs_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPPABP_BF_GiantNolegs_C>();
	}
};
DUMPER7_ASSERTS_UPPABP_BF_GiantNolegs_C;

}

