#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PPABP_Gobbo

#include "Basic.hpp"

#include "AppAnimGraph_structs.hpp"
#include "Engine_structs.hpp"
#include "ControlRig_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"
#include "KawaiiPhysics_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass PPABP_Gobbo.PPABP_Gobbo_C
// 0x38E0 (0x3FF0 - 0x0710)
class UPPABP_Gobbo_C final : public UAnimDynamicsPostProcessAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0710(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0718(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0720(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0728(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0748(0x00B8)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x0800(0x04D0)(ContainsInstancedReference)
	struct FAppAnimNode_RigidBody                 AppAnimGraphNode_RigidBody;                        // 0x0CD0(0x09B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1680(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x16A8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x16D0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1750(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1778(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1798(0x0020)()
	uint8                                         Pad_17B8[0x8];                                     // 0x17B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x17C0(0x07B0)()
	struct FAppAnimNode_ShoeSole                  AppAnimGraphNode_ShoeSole;                         // 0x1F70(0x0330)()
	struct FAppAnimNode_FABRIK                    AppAnimGraphNode_FABRIK;                           // 0x22A0(0x0170)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2410(0x0028)()
	uint8                                         Pad_2438[0x8];                                     // 0x2438(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x2440(0x07B0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x2BF0(0x07B0)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x33A0(0x07B0)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode_1;                     // 0x3B50(0x00D0)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode;                       // 0x3C20(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x3CF0(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x3D70(0x00F0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x3E60(0x0040)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x3EA0(0x0040)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x3EE0(0x00F0)()
	struct FVector                                Gravity_Param;                                     // 0x3FD0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_Gobbo_AnimGraphNode_KawaiiPhysics_00F0905B4B750B4C3DA6D1B02B9C7525();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_Gobbo_AnimGraphNode_KawaiiPhysics_2810589E4F526013AF96CCA2EDB5DCFB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_Gobbo_AnimGraphNode_KawaiiPhysics_48D44CA840F20ECF35A983802AD5BD65();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_Gobbo_AnimGraphNode_KawaiiPhysics_ECAF207643A56242A2A171B49D24BCCA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_Gobbo_AnimGraphNode_LayeredBoneBlend_079EBF6F470FE5C9B5A983A58AF0D5F3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_Gobbo_AnimGraphNode_LayeredBoneBlend_928818AB456B957EC40FC288B42F2334();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_PPABP_Gobbo_AppAnimGraphNode_RigidBody_107597F34B2D33F852FCA7BE65F41EAC();
	void ExecuteUbergraph_PPABP_Gobbo(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("PPABP_Gobbo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"PPABP_Gobbo_C")
	}
	static class UPPABP_Gobbo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPPABP_Gobbo_C>();
	}
};
DUMPER7_ASSERTS_UPPABP_Gobbo_C;

}

