#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestSystemWorldComposition

#include "Basic.hpp"

#include "QuestSystem_classes.hpp"


namespace SDK
{

// Class QuestSystemWorldComposition.QSTask_LevelStream
// 0x0030 (0x00D8 - 0x00A8)
class UQSTask_LevelStream final : public UQSTask_DuplicateBase
{
public:
	TSoftObjectPtr<class UWorld>                  Level;                                             // 0x00A8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bMakeVisibleAfterLoad;                             // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShouldBlockOnLoad;                                // 0x00D1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D2[0x6];                                       // 0x00D2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLoadCompleted();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSTask_LevelStream")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSTask_LevelStream")
	}
	static class UQSTask_LevelStream* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSTask_LevelStream>();
	}
};
DUMPER7_ASSERTS_UQSTask_LevelStream;

// Class QuestSystemWorldComposition.QSTask_LevelVisiable
// 0x0038 (0x00E0 - 0x00A8)
class UQSTask_LevelVisiable final : public UQSTask_DuplicateBase
{
public:
	TSoftObjectPtr<class UWorld>                  Level;                                             // 0x00A8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bLevelVisible;                                     // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelStreaming*                        LevelStreaming;                                    // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	void OnLevelHidden();
	void OnLevelShown();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSTask_LevelVisiable")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSTask_LevelVisiable")
	}
	static class UQSTask_LevelVisiable* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSTask_LevelVisiable>();
	}
};
DUMPER7_ASSERTS_UQSTask_LevelVisiable;

// Class QuestSystemWorldComposition.QSTask_UnlevelStream
// 0x0030 (0x00D8 - 0x00A8)
class UQSTask_UnlevelStream final : public UQSTask_DuplicateBase
{
public:
	TSoftObjectPtr<class UWorld>                  Level;                                             // 0x00A8(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bShouldBlockOnLoad;                                // 0x00D0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnLoadCompleted();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSTask_UnlevelStream")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSTask_UnlevelStream")
	}
	static class UQSTask_UnlevelStream* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSTask_UnlevelStream>();
	}
};
DUMPER7_ASSERTS_UQSTask_UnlevelStream;

}

