#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestSystemStoryFlag

#include "Basic.hpp"

#include "QuestSystemStoryFlag_structs.hpp"
#include "QuestSystem_structs.hpp"
#include "StoryFlagSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function QuestSystemStoryFlag.QSTask_AwaitEvaluationFormulaSharedMemory.OnChangeSharedMemory
// 0x0010 (0x0010 - 0x0000)
struct QSTask_AwaitEvaluationFormulaSharedMemory_OnChangeSharedMemory final
{
public:
	struct FQSSharedMemorySelecter                ChangeSelecter;                                    // 0x0000(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QSTask_AwaitEvaluationFormulaSharedMemory_OnChangeSharedMemory;

// Function QuestSystemStoryFlag.QSTask_AwaitEvaluationFormulaStoryFlag.OnChangeStoryFlag
// 0x0018 (0x0018 - 0x0000)
struct QSTask_AwaitEvaluationFormulaStoryFlag_OnChangeStoryFlag final
{
public:
	struct FStoryFlagEvaluationFormula            ChangeEvaluationFormula;                           // 0x0000(0x0010)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QSTask_AwaitEvaluationFormulaStoryFlag_OnChangeStoryFlag;

// Function QuestSystemStoryFlag.QSTask_ObserverChangeStoryFlag.OnChangeStoryFlag
// 0x0020 (0x0020 - 0x0000)
struct QSTask_ObserverChangeStoryFlag_OnChangeStoryFlag final
{
public:
	struct FStoryFlagChangeParam                  Param;                                             // 0x0000(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QSTask_ObserverChangeStoryFlag_OnChangeStoryFlag;

// Function QuestSystemStoryFlag.QuestAreaSubSystem.GetAreaComponents
// 0x0010 (0x0010 - 0x0000)
struct QuestAreaSubSystem_GetAreaComponents final
{
public:
	TArray<class UPrimitiveComponent*>            ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestAreaSubSystem_GetAreaComponents;

// Function QuestSystemStoryFlag.QuestAreaSubSystem.OnBeginOverlapEffectiveArea
// 0x0118 (0x0118 - 0x0000)
struct QuestAreaSubSystem_OnBeginOverlapEffectiveArea final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestAreaSubSystem_OnBeginOverlapEffectiveArea;

// Function QuestSystemStoryFlag.QuestAreaSubSystem.OnBeginOverlapInvalidArea
// 0x0118 (0x0118 - 0x0000)
struct QuestAreaSubSystem_OnBeginOverlapInvalidArea final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00F8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestAreaSubSystem_OnBeginOverlapInvalidArea;

// Function QuestSystemStoryFlag.QuestAreaSubSystem.OnEndOverlapEffectiveArea
// 0x0020 (0x0020 - 0x0000)
struct QuestAreaSubSystem_OnEndOverlapEffectiveArea final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestAreaSubSystem_OnEndOverlapEffectiveArea;

// Function QuestSystemStoryFlag.QuestAreaSubSystem.OnEndOverlapInvalidArea
// 0x0020 (0x0020 - 0x0000)
struct QuestAreaSubSystem_OnEndOverlapInvalidArea final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestAreaSubSystem_OnEndOverlapInvalidArea;

// Function QuestSystemStoryFlag.QuestCollectionActor.OnChangeStoryFlag
// 0x0018 (0x0018 - 0x0000)
struct QuestCollectionActor_OnChangeStoryFlag final
{
public:
	struct FStoryFlagEvaluationFormula            EvaluationFormula;                                 // 0x0000(0x0010)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestCollectionActor_OnChangeStoryFlag;

// Function QuestSystemStoryFlag.QuestVolumeBase.OnChangeVisiable
// 0x0020 (0x0020 - 0x0000)
struct QuestVolumeBase_OnChangeVisiable final
{
public:
	struct FStoryFlagChangeParam                  Param;                                             // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestVolumeBase_OnChangeVisiable;

// Function QuestSystemStoryFlag.QuestMessageVolume.OnBeginOverlap
// 0x0010 (0x0010 - 0x0000)
struct QuestMessageVolume_OnBeginOverlap final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestMessageVolume_OnBeginOverlap;

// Function QuestSystemStoryFlag.QuestMessageVolume.OnEndOverlap
// 0x0010 (0x0010 - 0x0000)
struct QuestMessageVolume_OnEndOverlap final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestMessageVolume_OnEndOverlap;

// Function QuestSystemStoryFlag.QuestSpawner.OnChangeStoryFlag
// 0x0018 (0x0018 - 0x0000)
struct QuestSpawner_OnChangeStoryFlag final
{
public:
	struct FStoryFlagEvaluationFormula            EvaluationFormula;                                 // 0x0000(0x0010)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestSpawner_OnChangeStoryFlag;

// Function QuestSystemStoryFlag.QuestSpawner.OnChangeVisiable
// 0x0020 (0x0020 - 0x0000)
struct QuestSpawner_OnChangeVisiable final
{
public:
	struct FStoryFlagChangeParam                  Param;                                             // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSpawner_OnChangeVisiable;

// Function QuestSystemStoryFlag.QuestSpawnSubsystem.OnChangeStoryFlag
// 0x0018 (0x0018 - 0x0000)
struct QuestSpawnSubsystem_OnChangeStoryFlag final
{
public:
	struct FStoryFlagEvaluationFormula            ChangeEvaluationFormula;                           // 0x0000(0x0010)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestSpawnSubsystem_OnChangeStoryFlag;

// Function QuestSystemStoryFlag.QuestSpawnSubsystem.OnQuestEnd
// 0x0010 (0x0010 - 0x0000)
struct QuestSpawnSubsystem_OnQuestEnd final
{
public:
	class UQuestSystemAsset*                      QuestSystem;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQSProgressor*                          Progressor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSpawnSubsystem_OnQuestEnd;

// Function QuestSystemStoryFlag.QuestSpawnSubsystem.OnSubsystemInitialized
// 0x0008 (0x0008 - 0x0000)
struct QuestSpawnSubsystem_OnSubsystemInitialized final
{
public:
	class UStoryFlagSubsystem*                    InStoryFlagSubsystem;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSpawnSubsystem_OnSubsystemInitialized;

// Function QuestSystemStoryFlag.QuestSummaryLibrary.ClearQuestSummary
// 0x0008 (0x0008 - 0x0000)
struct QuestSummaryLibrary_ClearQuestSummary final
{
public:
	class UObject*                                Request;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSummaryLibrary_ClearQuestSummary;

// Function QuestSystemStoryFlag.QuestSummaryLibrary.ClearTaskProgress
// 0x0018 (0x0018 - 0x0000)
struct QuestSummaryLibrary_ClearTaskProgress final
{
public:
	const class UObject*                          InWorldContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuestProgressHandle                   Handle;                                            // 0x0008(0x000C)(Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestSummaryLibrary_ClearTaskProgress;

// Function QuestSystemStoryFlag.QuestSummaryLibrary.CreateTaskProgress
// 0x0020 (0x0020 - 0x0000)
struct QuestSummaryLibrary_CreateTaskProgress final
{
public:
	const class UObject*                          InWorldContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                HandleOwner;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuestProgressHandle                   ReturnValue;                                       // 0x0010(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestSummaryLibrary_CreateTaskProgress;

// Function QuestSystemStoryFlag.QuestSummaryLibrary.GetActiveQuestSummarys
// 0x0018 (0x0018 - 0x0000)
struct QuestSummaryLibrary_GetActiveQuestSummarys final
{
public:
	const class UObject*                          InWorldContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSummaryLibrary_GetActiveQuestSummarys;

// Function QuestSystemStoryFlag.QuestSummaryLibrary.GetQuestSummary
// 0x0018 (0x0018 - 0x0000)
struct QuestSummaryLibrary_GetQuestSummary final
{
public:
	const class UObject*                          InWorldContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSummaryLibrary_GetQuestSummary;

// Function QuestSystemStoryFlag.QuestSummaryLibrary.GetQuestSummaryInfo
// 0x0050 (0x0050 - 0x0000)
struct QuestSummaryLibrary_GetQuestSummaryInfo final
{
public:
	const class UObject*                          InWorldContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InQuestTag;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsValid;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestSummaryInfo                      SummaryInfo;                                       // 0x0018(0x0038)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSummaryLibrary_GetQuestSummaryInfo;

// Function QuestSystemStoryFlag.QuestSummaryLibrary.SetQuestSummary
// 0x0018 (0x0018 - 0x0000)
struct QuestSummaryLibrary_SetQuestSummary final
{
public:
	class UObject*                                Request;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   NewSummary;                                        // 0x0008(0x0010)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSummaryLibrary_SetQuestSummary;

// Function QuestSystemStoryFlag.QuestSummaryLibrary.SetQuestSummaryInfoNew
// 0x0020 (0x0020 - 0x0000)
struct QuestSummaryLibrary_SetQuestSummaryInfoNew final
{
public:
	const class UObject*                          InWorldContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InQuestTag;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   QuestSummaryLabel;                                 // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNew;                                              // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestSummaryLibrary_SetQuestSummaryInfoNew;

// Function QuestSystemStoryFlag.QuestSummaryLibrary.SetTaskProgress
// 0x0030 (0x0030 - 0x0000)
struct QuestSummaryLibrary_SetTaskProgress final
{
public:
	const class UObject*                          InWorldContext;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuestProgressHandle                   Handle;                                            // 0x0008(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestProgressInfo                     NewInfo;                                           // 0x0018(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSummaryLibrary_SetTaskProgress;

// Function QuestSystemStoryFlag.QuestSummaryScript.OverrideDataTable
// 0x0010 (0x0010 - 0x0000)
struct QuestSummaryScript_OverrideDataTable final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             QuestSummaryDataTable;                             // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSummaryScript_OverrideDataTable;

// Function QuestSystemStoryFlag.QuestSummarySubsystem.ClearQuestSummary
// 0x0008 (0x0008 - 0x0000)
struct QuestSummarySubsystem_ClearQuestSummary final
{
public:
	class UObject*                                Request;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSummarySubsystem_ClearQuestSummary;

// Function QuestSystemStoryFlag.QuestSummarySubsystem.ClearTaskProgress
// 0x000C (0x000C - 0x0000)
struct QuestSummarySubsystem_ClearTaskProgress final
{
public:
	struct FQuestProgressHandle                   Handle;                                            // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSummarySubsystem_ClearTaskProgress;

// Function QuestSystemStoryFlag.QuestSummarySubsystem.CreateTaskProgress
// 0x0018 (0x0018 - 0x0000)
struct QuestSummarySubsystem_CreateTaskProgress final
{
public:
	class UObject*                                TaskObject;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQuestProgressHandle                   ReturnValue;                                       // 0x0008(0x000C)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestSummarySubsystem_CreateTaskProgress;

// Function QuestSystemStoryFlag.QuestSummarySubsystem.SetQuestSummary
// 0x0018 (0x0018 - 0x0000)
struct QuestSummarySubsystem_SetQuestSummary final
{
public:
	class UObject*                                Request;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   NewSummary;                                        // 0x0008(0x0010)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSummarySubsystem_SetQuestSummary;

// Function QuestSystemStoryFlag.QuestSummarySubsystem.SetTaskProgress
// 0x0028 (0x0028 - 0x0000)
struct QuestSummarySubsystem_SetTaskProgress final
{
public:
	struct FQuestProgressHandle                   Handle;                                            // 0x0000(0x000C)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuestProgressInfo                     Infomation;                                        // 0x0010(0x0018)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSummarySubsystem_SetTaskProgress;

// Function QuestSystemStoryFlag.QuestSummarySubsystem.GetQuestSummary
// 0x0010 (0x0010 - 0x0000)
struct QuestSummarySubsystem_GetQuestSummary final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSummarySubsystem_GetQuestSummary;

// Function QuestSystemStoryFlag.QuestSummarySubsystem.GetTaskProgress
// 0x0050 (0x0050 - 0x0000)
struct QuestSummarySubsystem_GetTaskProgress final
{
public:
	TMap<struct FQuestProgressHandle, struct FQuestProgressInfo> ReturnValue;                        // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSummarySubsystem_GetTaskProgress;

// Function QuestSystemStoryFlag.QuestSystemStoryFlagScript.OverrideDataTable
// 0x0010 (0x0010 - 0x0000)
struct QuestSystemStoryFlagScript_OverrideDataTable final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             QuestSpawnDataTable;                               // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSystemStoryFlagScript_OverrideDataTable;

// Function QuestSystemStoryFlag.StoryFlagAssetStream.OnChangeStoryFlag
// 0x0018 (0x0018 - 0x0000)
struct StoryFlagAssetStream_OnChangeStoryFlag final
{
public:
	struct FStoryFlagEvaluationFormula            EvaluationFormula;                                 // 0x0000(0x0010)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnable;                                           // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StoryFlagAssetStream_OnChangeStoryFlag;

// Function QuestSystemStoryFlag.StoryFlagAssetStream.OnChangeVisiable
// 0x0020 (0x0020 - 0x0000)
struct StoryFlagAssetStream_OnChangeVisiable final
{
public:
	struct FStoryFlagChangeParam                  Param;                                             // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoryFlagAssetStream_OnChangeVisiable;

// Function QuestSystemStoryFlag.StoryFlagAssetStream.OnLoadingCompleted
// 0x0010 (0x0010 - 0x0000)
struct StoryFlagAssetStream_OnLoadingCompleted final
{
public:
	TArray<class UObject*>                        Loaded;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_StoryFlagAssetStream_OnLoadingCompleted;

// Function QuestSystemStoryFlag.StoryFlagQuestLibrary.IsSharedMemoryEvaluationFormulaAnalysis
// 0x0020 (0x0020 - 0x0000)
struct StoryFlagQuestLibrary_IsSharedMemoryEvaluationFormulaAnalysis final
{
public:
	const class UQSProgressor*                    InProgressor;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQSSharedMemoryEvaluationFormula       EvaluationFormula;                                 // 0x0008(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_StoryFlagQuestLibrary_IsSharedMemoryEvaluationFormulaAnalysis;

}

