#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestSystem

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum QuestSystem.EQSSharedMemorySyncType
// NumValues: 0x0005
enum class EQSSharedMemorySyncType : uint8
{
	None                                     = 0,
	Bidirectional                            = 1,
	ParentWay                                = 2,
	ChildWay                                 = 3,
	EQSSharedMemorySyncType_MAX              = 4,
};

// Enum QuestSystem.EQSSharedMemoryCompare
// NumValues: 0x0003
enum class EQSSharedMemoryCompare : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	EQSSharedMemoryCompare_MAX               = 2,
};

// Enum QuestSystem.EQSSharedMemoryArithmeticCompare
// NumValues: 0x0007
enum class EQSSharedMemoryArithmeticCompare : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	Less                                     = 2,
	LessOrEqual                              = 3,
	Greater                                  = 4,
	GreaterOrEqual                           = 5,
	EQSSharedMemoryArithmeticCompare_MAX     = 6,
};

// Enum QuestSystem.EQSSharedMemoryKeyOperation
// NumValues: 0x0004
enum class EQSSharedMemoryKeyOperation : uint8
{
	Basic                                    = 0,
	Arithmetic                               = 1,
	Text                                     = 2,
	EQSSharedMemoryKeyOperation_MAX          = 3,
};

// Enum QuestSystem.EQSTask_SendQuestMessageTargetType
// NumValues: 0x0004
enum class EQSTask_SendQuestMessageTargetType : uint32
{
	All                                      = 0,
	Parent                                   = 1,
	Child                                    = 2,
	EQSTask_MAX                              = 3,
};

// Enum QuestSystem.EQuestTransitionAction
// NumValues: 0x0003
enum class EQuestTransitionAction : uint8
{
	Run                                      = 0,
	Abort                                    = 1,
	EQuestTransitionAction_MAX               = 2,
};

// Enum QuestSystem.EQSTRPlayerDistanceCompare
// NumValues: 0x0005
enum class EQSTRPlayerDistanceCompare : uint8
{
	Less                                     = 0,
	LessOrEqual                              = 1,
	Greater                                  = 2,
	GreaterOrEqual                           = 3,
	EQSTRPlayerDistanceCompare_MAX           = 4,
};

// ScriptStruct QuestSystem.QSDataProviderBase
// 0x0018 (0x0018 - 0x0000)
struct FQSDataProviderBase
{
public:
	bool                                          bOverrideParam;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ParamName;                                         // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UQSDataProviderKey>         DataProviderKeyType;                               // 0x0010(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQSDataProviderBase;

// ScriptStruct QuestSystem.QSDataProviderFloatValue
// 0x0008 (0x0020 - 0x0018)
struct FQSDataProviderFloatValue final : public FQSDataProviderBase
{
public:
	float                                         Value;                                             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FQSDataProviderFloatValue;

// ScriptStruct QuestSystem.QSSharedMemorySelecter
// 0x0010 (0x0010 - 0x0000)
struct FQSSharedMemorySelecter final
{
public:
	class FName                                   EntryName;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UQSSharedMemoryKey>         KeyType;                                           // 0x0008(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQSSharedMemorySelecter;

// ScriptStruct QuestSystem.QSDataProviderBoolValue
// 0x0008 (0x0020 - 0x0018)
struct FQSDataProviderBoolValue final : public FQSDataProviderBase
{
public:
	bool                                          Value;                                             // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FQSDataProviderBoolValue;

// ScriptStruct QuestSystem.QSDataProviderIntegerValue
// 0x0008 (0x0020 - 0x0018)
struct FQSDataProviderIntegerValue final : public FQSDataProviderBase
{
public:
	int32                                         Value;                                             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FQSDataProviderIntegerValue;

// ScriptStruct QuestSystem.QSDataProviderDoubleValue
// 0x0008 (0x0020 - 0x0018)
struct FQSDataProviderDoubleValue final : public FQSDataProviderBase
{
public:
	double                                        Value;                                             // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQSDataProviderDoubleValue;

// ScriptStruct QuestSystem.QSDataProviderNameValue
// 0x0008 (0x0020 - 0x0018)
struct FQSDataProviderNameValue final : public FQSDataProviderBase
{
public:
	class FName                                   Value;                                             // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQSDataProviderNameValue;

// ScriptStruct QuestSystem.QSActorBinding
// 0x0008 (0x0008 - 0x0000)
struct FQSActorBinding final
{
public:
	class FName                                   ActorName;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQSActorBinding;

// ScriptStruct QuestSystem.QSDataProviderActorBindingValue
// 0x0008 (0x0020 - 0x0018)
struct FQSDataProviderActorBindingValue final : public FQSDataProviderBase
{
public:
	struct FQSActorBinding                        Value;                                             // 0x0018(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQSDataProviderActorBindingValue;

// ScriptStruct QuestSystem.QSDataProviderSharedMemorySelecterValue
// 0x0010 (0x0028 - 0x0018)
struct FQSDataProviderSharedMemorySelecterValue final : public FQSDataProviderBase
{
public:
	struct FQSSharedMemorySelecter                Value;                                             // 0x0018(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQSDataProviderSharedMemorySelecterValue;

// ScriptStruct QuestSystem.QSDataProviderGameplayTagValue
// 0x0008 (0x0020 - 0x0018)
struct FQSDataProviderGameplayTagValue final : public FQSDataProviderBase
{
public:
	struct FGameplayTag                           Value;                                             // 0x0018(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQSDataProviderGameplayTagValue;

// ScriptStruct QuestSystem.QSDataProviderVectorValue
// 0x0018 (0x0030 - 0x0018)
struct FQSDataProviderVectorValue final : public FQSDataProviderBase
{
public:
	struct FVector                                Value;                                             // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQSDataProviderVectorValue;

// ScriptStruct QuestSystem.QSDataProviderRotatorValue
// 0x0018 (0x0030 - 0x0018)
struct FQSDataProviderRotatorValue final : public FQSDataProviderBase
{
public:
	struct FRotator                               Value;                                             // 0x0018(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQSDataProviderRotatorValue;

// ScriptStruct QuestSystem.QSBranchGotoCheckPointInfo
// 0x0018 (0x0018 - 0x0000)
struct FQSBranchGotoCheckPointInfo final
{
public:
	TArray<class UQSTransitionRule*>              TransitionRules;                                   // 0x0000(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	class FName                                   GoToCheckPointName;                                // 0x0010(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQSBranchGotoCheckPointInfo;

// ScriptStruct QuestSystem.QuestSystemTickFunction
// 0x0008 (0x0030 - 0x0028)
struct FQuestSystemTickFunction final : public FTickFunction
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FQuestSystemTickFunction;

// ScriptStruct QuestSystem.QSBindingCache
// 0x0030 (0x0030 - 0x0000)
struct FQSBindingCache final
{
public:
	TMulticastInlineDelegate<void(class AActor* InSpawnActor)> OnSpawnCache;                         // 0x0000(0x0010)(ZeroConstructor, Transient, InstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class AActor* InActor)> OnDespawnCache;                            // 0x0010(0x0010)(ZeroConstructor, Transient, InstancedReference, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         Actors;                                            // 0x0020(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FQSBindingCache;

// ScriptStruct QuestSystem.QSBindingSearchSource
// 0x0020 (0x0020 - 0x0000)
struct FQSBindingSearchSource final
{
public:
	TArray<TSubclassOf<class AActor>>             TargetClassLists;                                  // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class IInterface>>         TargetInterfaceLists;                              // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQSBindingSearchSource;

// ScriptStruct QuestSystem.QSSharedMemoryEntry
// 0x0010 (0x0010 - 0x0000)
struct FQSSharedMemoryEntry final
{
public:
	class FName                                   EntryName;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQSSharedMemoryKey*                     KeyType;                                           // 0x0008(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FQSSharedMemoryEntry;

// ScriptStruct QuestSystem.QSDataProviderEntry
// 0x0050 (0x0050 - 0x0000)
struct FQSDataProviderEntry final
{
public:
	TMap<class FName, class UQSDataProviderKey*>  DataProviderKeys;                                  // 0x0000(0x0050)(Edit, ExportObject, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FQSDataProviderEntry;

// ScriptStruct QuestSystem.QSAssetSetting
// 0x0001 (0x0001 - 0x0000)
struct FQSAssetSetting final
{
public:
	bool                                          bIsExcludeFromAllResets;                           // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQSAssetSetting;

// ScriptStruct QuestSystem.QSMessageParamBase
// 0x0000 (0x0000 - 0x0000)
#pragma pack(push, 0x1)
struct alignas(0x01) FQSMessageParamBase
{
};
#pragma pack(pop)
DUMPER7_ASSERTS_FQSMessageParamBase;

// ScriptStruct QuestSystem.QSSimpleMessageParam
// 0x0008 (0x0008 - 0x0000)
struct FQSSimpleMessageParam : public FQSMessageParamBase
{
public:
	class FName                                   Message;                                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQSSimpleMessageParam;

}

