#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "QuestSystem_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Slate_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class QuestSystem.QSBindingActorAccess
// 0x0000 (0x0028 - 0x0028)
class UQSBindingActorAccess : public UObject
{
public:
	class AActor* GetBindingActor(const class UObject* InWorldContext, const struct FQSActorBinding& InBinding) const;
	TArray<class AActor*> GetBindingAllActors(const class UObject* InWorldContext, const TArray<struct FQSActorBinding>& InBinding) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSBindingActorAccess")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSBindingActorAccess")
	}
	static class UQSBindingActorAccess* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSBindingActorAccess>();
	}
};
DUMPER7_ASSERTS_UQSBindingActorAccess;

// Class QuestSystem.QSDataProviderKey
// 0x0008 (0x0030 - 0x0028)
class UQSDataProviderKey : public UObject
{
public:
	class FName                                   ParamName;                                         // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSDataProviderKey")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSDataProviderKey")
	}
	static class UQSDataProviderKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSDataProviderKey>();
	}
};
DUMPER7_ASSERTS_UQSDataProviderKey;

// Class QuestSystem.QSDataProviderKey_ActorBinding
// 0x0010 (0x0040 - 0x0030)
class UQSDataProviderKey_ActorBinding final : public UQSDataProviderKey
{
public:
	struct FQSActorBinding                        Value;                                             // 0x0030(0x0008)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSDataProviderKey_ActorBinding")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSDataProviderKey_ActorBinding")
	}
	static class UQSDataProviderKey_ActorBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSDataProviderKey_ActorBinding>();
	}
};
DUMPER7_ASSERTS_UQSDataProviderKey_ActorBinding;

// Class QuestSystem.QSDataProviderKey_Bool
// 0x0008 (0x0038 - 0x0030)
class UQSDataProviderKey_Bool final : public UQSDataProviderKey
{
public:
	bool                                          Value;                                             // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSDataProviderKey_Bool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSDataProviderKey_Bool")
	}
	static class UQSDataProviderKey_Bool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSDataProviderKey_Bool>();
	}
};
DUMPER7_ASSERTS_UQSDataProviderKey_Bool;

// Class QuestSystem.QSDataProviderKey_Double
// 0x0010 (0x0040 - 0x0030)
class UQSDataProviderKey_Double final : public UQSDataProviderKey
{
public:
	double                                        Value;                                             // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSDataProviderKey_Double")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSDataProviderKey_Double")
	}
	static class UQSDataProviderKey_Double* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSDataProviderKey_Double>();
	}
};
DUMPER7_ASSERTS_UQSDataProviderKey_Double;

// Class QuestSystem.QSDataProviderKey_Float
// 0x0008 (0x0038 - 0x0030)
class UQSDataProviderKey_Float final : public UQSDataProviderKey
{
public:
	float                                         Value;                                             // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSDataProviderKey_Float")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSDataProviderKey_Float")
	}
	static class UQSDataProviderKey_Float* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSDataProviderKey_Float>();
	}
};
DUMPER7_ASSERTS_UQSDataProviderKey_Float;

// Class QuestSystem.QSDataProviderKey_GameplayTag
// 0x0010 (0x0040 - 0x0030)
class UQSDataProviderKey_GameplayTag final : public UQSDataProviderKey
{
public:
	struct FGameplayTag                           Value;                                             // 0x0030(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSDataProviderKey_GameplayTag")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSDataProviderKey_GameplayTag")
	}
	static class UQSDataProviderKey_GameplayTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSDataProviderKey_GameplayTag>();
	}
};
DUMPER7_ASSERTS_UQSDataProviderKey_GameplayTag;

// Class QuestSystem.QSDataProviderKey_Integer
// 0x0008 (0x0038 - 0x0030)
class UQSDataProviderKey_Integer final : public UQSDataProviderKey
{
public:
	int32                                         Value;                                             // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSDataProviderKey_Integer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSDataProviderKey_Integer")
	}
	static class UQSDataProviderKey_Integer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSDataProviderKey_Integer>();
	}
};
DUMPER7_ASSERTS_UQSDataProviderKey_Integer;

// Class QuestSystem.QSDataProviderKey_Name
// 0x0010 (0x0040 - 0x0030)
class UQSDataProviderKey_Name final : public UQSDataProviderKey
{
public:
	class FName                                   Value;                                             // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38[0x8];                                       // 0x0038(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSDataProviderKey_Name")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSDataProviderKey_Name")
	}
	static class UQSDataProviderKey_Name* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSDataProviderKey_Name>();
	}
};
DUMPER7_ASSERTS_UQSDataProviderKey_Name;

// Class QuestSystem.QSDataProviderKey_Rotator
// 0x0030 (0x0060 - 0x0030)
class UQSDataProviderKey_Rotator final : public UQSDataProviderKey
{
public:
	struct FRotator                               Value;                                             // 0x0030(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSDataProviderKey_Rotator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSDataProviderKey_Rotator")
	}
	static class UQSDataProviderKey_Rotator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSDataProviderKey_Rotator>();
	}
};
DUMPER7_ASSERTS_UQSDataProviderKey_Rotator;

// Class QuestSystem.QSDataProviderKey_SharedMemorySelecter
// 0x0020 (0x0050 - 0x0030)
class UQSDataProviderKey_SharedMemorySelecter final : public UQSDataProviderKey
{
public:
	struct FQSSharedMemorySelecter                Value;                                             // 0x0030(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSDataProviderKey_SharedMemorySelecter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSDataProviderKey_SharedMemorySelecter")
	}
	static class UQSDataProviderKey_SharedMemorySelecter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSDataProviderKey_SharedMemorySelecter>();
	}
};
DUMPER7_ASSERTS_UQSDataProviderKey_SharedMemorySelecter;

// Class QuestSystem.QSDataProviderKey_Vector
// 0x0030 (0x0060 - 0x0030)
class UQSDataProviderKey_Vector final : public UQSDataProviderKey
{
public:
	struct FVector                                Value;                                             // 0x0030(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSDataProviderKey_Vector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSDataProviderKey_Vector")
	}
	static class UQSDataProviderKey_Vector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSDataProviderKey_Vector>();
	}
};
DUMPER7_ASSERTS_UQSDataProviderKey_Vector;

// Class QuestSystem.QSItemBase
// 0x0040 (0x0068 - 0x0028)
class UQSItemBase : public UObject
{
public:
	struct FGuid                                  ID;                                                // 0x0028(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ParentID;                                          // 0x0038(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 NodeName;                                          // 0x0048(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bDuplicateItem : 1;                                // 0x0058(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestSystemAsset*                      TreeAsset;                                         // 0x0060(0x0008)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	void GetLevelActorBindingSupportClass(class FName PropertyName, TArray<TSubclassOf<class AActor>>* OutFilterActorClass, TArray<TSubclassOf<class IInterface>>* OutFilterInterfaceClass) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSItemBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSItemBase")
	}
	static class UQSItemBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSItemBase>();
	}
};
DUMPER7_ASSERTS_UQSItemBase;

// Class QuestSystem.QSEventTrigger
// 0x0000 (0x0068 - 0x0068)
class UQSEventTrigger : public UQSItemBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSEventTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSEventTrigger")
	}
	static class UQSEventTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSEventTrigger>();
	}
};
DUMPER7_ASSERTS_UQSEventTrigger;

// Class QuestSystem.QSEventTrigger_DuplicateBase
// 0x0008 (0x0070 - 0x0068)
class UQSEventTrigger_DuplicateBase : public UQSEventTrigger
{
public:
	TWeakObjectPtr<class UQSProgressor>           Progressor;                                        // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void EventNotifyToNode();
	void ReceiveActivate();
	void ReceiveDeactivate();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSEventTrigger_DuplicateBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSEventTrigger_DuplicateBase")
	}
	static class UQSEventTrigger_DuplicateBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSEventTrigger_DuplicateBase>();
	}
};
DUMPER7_ASSERTS_UQSEventTrigger_DuplicateBase;

// Class QuestSystem.QSEventTrigger_DuplicateBlueprintBase
// 0x0018 (0x0088 - 0x0070)
class UQSEventTrigger_DuplicateBlueprintBase final : public UQSEventTrigger_DuplicateBase
{
public:
	uint8                                         Pad_70[0x10];                                      // 0x0070(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bShowPropertyDetails : 1;                          // 0x0080(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSEventTrigger_DuplicateBlueprintBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSEventTrigger_DuplicateBlueprintBase")
	}
	static class UQSEventTrigger_DuplicateBlueprintBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSEventTrigger_DuplicateBlueprintBase>();
	}
};
DUMPER7_ASSERTS_UQSEventTrigger_DuplicateBlueprintBase;

// Class QuestSystem.QSEventTrigger_KeyEvent
// 0x0038 (0x00A8 - 0x0070)
class UQSEventTrigger_KeyEvent final : public UQSEventTrigger_DuplicateBase
{
public:
	struct FInputChord                            InputChord;                                        // 0x0070(0x0020)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EInputEvent                                   InputKeyEvent;                                     // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bConsumeInput : 1;                                 // 0x0094(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bExecuteWhenPaused : 1;                            // 0x0094(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         bOverrideParentBinding : 1;                        // 0x0094(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Priority;                                          // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         bStopAction : 1;                                   // 0x009C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_9D[0x3];                                       // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TWeakObjectPtr<class UInputComponent>         WeakInputComponent;                                // 0x00A0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	void OnKeyEvent(const struct FKey& Key);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSEventTrigger_KeyEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSEventTrigger_KeyEvent")
	}
	static class UQSEventTrigger_KeyEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSEventTrigger_KeyEvent>();
	}
};
DUMPER7_ASSERTS_UQSEventTrigger_KeyEvent;

// Class QuestSystem.QSEventTrigger_MessageQuestReset
// 0x0010 (0x0078 - 0x0068)
class UQSEventTrigger_MessageQuestReset final : public UQSEventTrigger
{
public:
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MessageLabel;                                      // 0x0070(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSEventTrigger_MessageQuestReset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSEventTrigger_MessageQuestReset")
	}
	static class UQSEventTrigger_MessageQuestReset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSEventTrigger_MessageQuestReset>();
	}
};
DUMPER7_ASSERTS_UQSEventTrigger_MessageQuestReset;

// Class QuestSystem.QSEventTrigger_MessageReceiver
// 0x0010 (0x0078 - 0x0068)
class UQSEventTrigger_MessageReceiver final : public UQSEventTrigger
{
public:
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MessageLabel;                                      // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSEventTrigger_MessageReceiver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSEventTrigger_MessageReceiver")
	}
	static class UQSEventTrigger_MessageReceiver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSEventTrigger_MessageReceiver>();
	}
};
DUMPER7_ASSERTS_UQSEventTrigger_MessageReceiver;

// Class QuestSystem.QSMessageLibrary
// 0x0000 (0x0028 - 0x0028)
class UQSMessageLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void K2_SendQuestMessage(const class UObject* WorldContextObject, const struct FQSSimpleMessageParam& InMessage);
	static void SendQuestMessage(const class UObject* WorldContextObject, const struct FQSSimpleMessageParam& InParam);
	static void SendQuestMessageQuestReset(const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSMessageLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSMessageLibrary")
	}
	static class UQSMessageLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSMessageLibrary>();
	}
};
DUMPER7_ASSERTS_UQSMessageLibrary;

// Class QuestSystem.QSNodeBase
// 0x0018 (0x0080 - 0x0068)
class UQSNodeBase : public UQSItemBase
{
public:
	uint8                                         Pad_68[0x4];                                       // 0x0068(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeactivateWaitTime;                                // 0x006C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UQSTransition_Base*>             Transitions;                                       // 0x0070(0x0010)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSNodeBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSNodeBase")
	}
	static class UQSNodeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSNodeBase>();
	}
};
DUMPER7_ASSERTS_UQSNodeBase;

// Class QuestSystem.QSNode_Slot
// 0x0020 (0x00A0 - 0x0080)
class UQSNode_Slot : public UQSNodeBase
{
public:
	TArray<class UQSTaskItem*>                    Tasks;                                             // 0x0080(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)
	TArray<class UQSServiceItem*>                 Services;                                          // 0x0090(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSNode_Slot")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSNode_Slot")
	}
	static class UQSNode_Slot* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSNode_Slot>();
	}
};
DUMPER7_ASSERTS_UQSNode_Slot;

// Class QuestSystem.QSNode_CheckPoint
// 0x0010 (0x00B0 - 0x00A0)
class UQSNode_CheckPoint final : public UQSNode_Slot
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CheckPointName;                                    // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSNode_CheckPoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSNode_CheckPoint")
	}
	static class UQSNode_CheckPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSNode_CheckPoint>();
	}
};
DUMPER7_ASSERTS_UQSNode_CheckPoint;

// Class QuestSystem.QSNodeCheckPointInterface
// 0x0000 (0x0000 - 0x0000)
class IQSNodeCheckPointInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSNodeCheckPointInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSNodeCheckPointInterface")
	}
	static class IQSNodeCheckPointInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IQSNodeCheckPointInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IQSNodeCheckPointInterface;

// Class QuestSystem.QSNode_Completed
// 0x0008 (0x0088 - 0x0080)
class UQSNode_Completed final : public UQSNodeBase
{
public:
	bool                                          bAutoSave;                                         // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSNode_Completed")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSNode_Completed")
	}
	static class UQSNode_Completed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSNode_Completed>();
	}
};
DUMPER7_ASSERTS_UQSNode_Completed;

// Class QuestSystem.QSNode_Event
// 0x0008 (0x0088 - 0x0080)
class UQSNode_Event final : public UQSNodeBase
{
public:
	class UQSEventTrigger*                        EventTrigger;                                      // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSNode_Event")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSNode_Event")
	}
	static class UQSNode_Event* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSNode_Event>();
	}
};
DUMPER7_ASSERTS_UQSNode_Event;

// Class QuestSystem.QSNode_GoToCheckPoint
// 0x0008 (0x0088 - 0x0080)
class UQSNode_GoToCheckPoint final : public UQSNodeBase
{
public:
	class FName                                   GoToCheckPointName;                                // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSNode_GoToCheckPoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSNode_GoToCheckPoint")
	}
	static class UQSNode_GoToCheckPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSNode_GoToCheckPoint>();
	}
};
DUMPER7_ASSERTS_UQSNode_GoToCheckPoint;

// Class QuestSystem.QSNode_GoToReset
// 0x0008 (0x0088 - 0x0080)
class UQSNode_GoToReset final : public UQSNodeBase
{
public:
	class FName                                   GoToResetName;                                     // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSNode_GoToReset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSNode_GoToReset")
	}
	static class UQSNode_GoToReset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSNode_GoToReset>();
	}
};
DUMPER7_ASSERTS_UQSNode_GoToReset;

// Class QuestSystem.QSNode_Reset
// 0x0010 (0x00B0 - 0x00A0)
class UQSNode_Reset final : public UQSNode_Slot
{
public:
	uint8                                         Pad_A0[0x8];                                       // 0x00A0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ResetName;                                         // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSNode_Reset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSNode_Reset")
	}
	static class UQSNode_Reset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSNode_Reset>();
	}
};
DUMPER7_ASSERTS_UQSNode_Reset;

// Class QuestSystem.QSNode_Root
// 0x0000 (0x0080 - 0x0080)
class UQSNode_Root final : public UQSNodeBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSNode_Root")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSNode_Root")
	}
	static class UQSNode_Root* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSNode_Root>();
	}
};
DUMPER7_ASSERTS_UQSNode_Root;

// Class QuestSystem.QSNode_RootCheckPoint
// 0x0010 (0x0090 - 0x0080)
class UQSNode_RootCheckPoint final : public UQSNodeBase
{
public:
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CheckPointName;                                    // 0x0088(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSNode_RootCheckPoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSNode_RootCheckPoint")
	}
	static class UQSNode_RootCheckPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSNode_RootCheckPoint>();
	}
};
DUMPER7_ASSERTS_UQSNode_RootCheckPoint;

// Class QuestSystem.QSNode_BranchGotoCheckPoint
// 0x0010 (0x0090 - 0x0080)
class UQSNode_BranchGotoCheckPoint final : public UQSNodeBase
{
public:
	TArray<struct FQSBranchGotoCheckPointInfo>    GoToCheckPoints;                                   // 0x0080(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSNode_BranchGotoCheckPoint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSNode_BranchGotoCheckPoint")
	}
	static class UQSNode_BranchGotoCheckPoint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSNode_BranchGotoCheckPoint>();
	}
};
DUMPER7_ASSERTS_UQSNode_BranchGotoCheckPoint;

// Class QuestSystem.QSNode_Prefab
// 0x0008 (0x0088 - 0x0080)
class UQSNode_Prefab final : public UQSNodeBase
{
public:
	class UQuestSystemPrefab*                     Prefab;                                            // 0x0080(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSNode_Prefab")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSNode_Prefab")
	}
	static class UQSNode_Prefab* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSNode_Prefab>();
	}
};
DUMPER7_ASSERTS_UQSNode_Prefab;

// Class QuestSystem.QSNode_PrefabEntry
// 0x0000 (0x0080 - 0x0080)
class UQSNode_PrefabEntry final : public UQSNodeBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSNode_PrefabEntry")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSNode_PrefabEntry")
	}
	static class UQSNode_PrefabEntry* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSNode_PrefabEntry>();
	}
};
DUMPER7_ASSERTS_UQSNode_PrefabEntry;

// Class QuestSystem.QSNode_PrefabExit
// 0x0000 (0x0080 - 0x0080)
class UQSNode_PrefabExit final : public UQSNodeBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSNode_PrefabExit")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSNode_PrefabExit")
	}
	static class UQSNode_PrefabExit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSNode_PrefabExit>();
	}
};
DUMPER7_ASSERTS_UQSNode_PrefabExit;

// Class QuestSystem.QSPlacementInterface
// 0x0000 (0x0000 - 0x0000)
class IQSPlacementInterface final
{
public:
	void ActivePlacement();
	void DeactivePlacement();
	void SetActivePlacement(bool bActive);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSPlacementInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSPlacementInterface")
	}
	static class IQSPlacementInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IQSPlacementInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IQSPlacementInterface;

// Class QuestSystem.QSProgressor
// 0x0188 (0x01B0 - 0x0028)
class UQSProgressor final : public UObject
{
public:
	class UQuestSystemAsset*                      QuestSystem;                                       // 0x0028(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	class FName                                   CheckPintName;                                     // 0x0030(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UQSProgressor>           ParentQuest;                                       // 0x0038(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class UQSProgressor>>   ChildQuests;                                       // 0x0040(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<struct FGuid>                          ActiveNodeIds;                                     // 0x0050(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<TScriptInterface<class IQSReceiverInterface>> MessageReceivers;                           // 0x0060(0x0010)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<struct FGuid, class UQSItemBase*>        DuplicateItems;                                    // 0x0070(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<uint8>                                 InstanceMemory;                                    // 0x00C0(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMap<class UObject*, uint32>                  InstanceMemoryOffset;                              // 0x00D0(0x0050)(Transient, NativeAccessSpecifierPrivate)
	TArray<uint8>                                 SharedMemory;                                      // 0x0120(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<uint32>                                SharedMemoryOffset;                                // 0x0130(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	EQSSharedMemorySyncType                       SharedMemorySyncType;                              // 0x0140(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FQSSharedMemorySelecter>        SharedMemorySyncSelecters;                         // 0x0148(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	bool                                          bIsPaused;                                         // 0x0158(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnQuestFinish;                                     // 0x0160(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnQuestReset;                                      // 0x0170(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FQSSharedMemorySelecter& Selecter)> OnChangeSharedMemory; // 0x0180(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_190[0x20];                                     // 0x0190(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UQuestSystemAsset* GetQuestSystem() const;
	class FName GetQuestSystemName() const;
	void QuestSystemDebugLog() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSProgressor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSProgressor")
	}
	static class UQSProgressor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSProgressor>();
	}
};
DUMPER7_ASSERTS_UQSProgressor;

// Class QuestSystem.QSReceiverInterface
// 0x0000 (0x0000 - 0x0000)
class IQSReceiverInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSReceiverInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSReceiverInterface")
	}
	static class IQSReceiverInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IQSReceiverInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IQSReceiverInterface;

// Class QuestSystem.QSActorTagToLevelBinding
// 0x0000 (0x0000 - 0x0000)
class IQSActorTagToLevelBinding final
{
public:
	void SetTaskActorLabel(const TArray<class FName>& ActorLabels);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSActorTagToLevelBinding")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSActorTagToLevelBinding")
	}
	static class IQSActorTagToLevelBinding* GetDefaultObj()
	{
		return GetDefaultObjImpl<IQSActorTagToLevelBinding>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IQSActorTagToLevelBinding;

// Class QuestSystem.QSServiceItem
// 0x0000 (0x0068 - 0x0068)
class UQSServiceItem : public UQSItemBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSServiceItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSServiceItem")
	}
	static class UQSServiceItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSServiceItem>();
	}
};
DUMPER7_ASSERTS_UQSServiceItem;

// Class QuestSystem.QSService_BlueprintBase
// 0x0020 (0x0088 - 0x0068)
class UQSService_BlueprintBase final : public UQSServiceItem
{
public:
	uint8                                         Pad_68[0x18];                                      // 0x0068(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bShowPropertyDetails : 1;                          // 0x0080(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintReadOnly, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate))
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveAbort(class UQSProgressor* Progressor) const;
	void ReceiveNodeActivate(class UQSProgressor* Progressor) const;
	void ReceiveNodeDeactivate(class UQSProgressor* Progressor) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSService_BlueprintBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSService_BlueprintBase")
	}
	static class UQSService_BlueprintBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSService_BlueprintBase>();
	}
};
DUMPER7_ASSERTS_UQSService_BlueprintBase;

// Class QuestSystem.QSService_DuplicateBase
// 0x0010 (0x0078 - 0x0068)
class UQSService_DuplicateBase : public UQSServiceItem
{
public:
	TWeakObjectPtr<class UQSProgressor>           Progressor;                                        // 0x0068(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bReceiveMessager : 1;                              // 0x0070(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ReceiveAbort();
	void ReceiveNodeActivate();
	void ReceiveNodeDeactivate();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSService_DuplicateBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSService_DuplicateBase")
	}
	static class UQSService_DuplicateBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSService_DuplicateBase>();
	}
};
DUMPER7_ASSERTS_UQSService_DuplicateBase;

// Class QuestSystem.QSService_DuplicateBlueprintBase
// 0x0080 (0x00F8 - 0x0078)
class UQSService_DuplicateBlueprintBase final : public UQSService_DuplicateBase
{
public:
	uint8                                         Pad_78[0x18];                                      // 0x0078(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	uint8                                         bShowPropertyDetails : 1;                          // 0x0090(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnTemplate, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           MessageFunctionNames;                              // 0x0098(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A8[0x50];                                      // 0x00A8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSService_DuplicateBlueprintBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSService_DuplicateBlueprintBase")
	}
	static class UQSService_DuplicateBlueprintBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSService_DuplicateBlueprintBase>();
	}
};
DUMPER7_ASSERTS_UQSService_DuplicateBlueprintBase;

// Class QuestSystem.QSService_SetSharedMemoryNameWhenMessageReceived
// 0x0028 (0x0090 - 0x0068)
class UQSService_SetSharedMemoryNameWhenMessageReceived final : public UQSServiceItem
{
public:
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   MessageLabel;                                      // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FQSSharedMemorySelecter                Label;                                             // 0x0078(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   Value;                                             // 0x0088(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSService_SetSharedMemoryNameWhenMessageReceived")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSService_SetSharedMemoryNameWhenMessageReceived")
	}
	static class UQSService_SetSharedMemoryNameWhenMessageReceived* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSService_SetSharedMemoryNameWhenMessageReceived>();
	}
};
DUMPER7_ASSERTS_UQSService_SetSharedMemoryNameWhenMessageReceived;

// Class QuestSystem.QSService_SetSharedMemoryNameWhenTimeElapsed
// 0x0020 (0x0088 - 0x0068)
class UQSService_SetSharedMemoryNameWhenTimeElapsed final : public UQSServiceItem
{
public:
	float                                         WaitTime;                                          // 0x0068(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQSSharedMemorySelecter                Label;                                             // 0x0070(0x0010)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                   Value;                                             // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSService_SetSharedMemoryNameWhenTimeElapsed")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSService_SetSharedMemoryNameWhenTimeElapsed")
	}
	static class UQSService_SetSharedMemoryNameWhenTimeElapsed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSService_SetSharedMemoryNameWhenTimeElapsed>();
	}
};
DUMPER7_ASSERTS_UQSService_SetSharedMemoryNameWhenTimeElapsed;

// Class QuestSystem.QSSharedMemoryKey
// 0x0008 (0x0030 - 0x0028)
class UQSSharedMemoryKey : public UObject
{
public:
	uint32                                        ValueSize;                                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EQSSharedMemoryKeyOperation                   SupportedOp;                                       // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSSharedMemoryKey")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSSharedMemoryKey")
	}
	static class UQSSharedMemoryKey* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSSharedMemoryKey>();
	}
};
DUMPER7_ASSERTS_UQSSharedMemoryKey;

// Class QuestSystem.QSSharedMemoryKey_Bool
// 0x0008 (0x0038 - 0x0030)
class UQSSharedMemoryKey_Bool final : public UQSSharedMemoryKey
{
public:
	bool                                          bInitializeValue;                                  // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bParentInitializeValue;                            // 0x0031(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSSharedMemoryKey_Bool")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSSharedMemoryKey_Bool")
	}
	static class UQSSharedMemoryKey_Bool* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSSharedMemoryKey_Bool>();
	}
};
DUMPER7_ASSERTS_UQSSharedMemoryKey_Bool;

// Class QuestSystem.QSSharedMemoryKey_Byte
// 0x0008 (0x0038 - 0x0030)
class UQSSharedMemoryKey_Byte final : public UQSSharedMemoryKey
{
public:
	uint8                                         InitializeValue;                                   // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         ParentInitializeValue;                             // 0x0031(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSSharedMemoryKey_Byte")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSSharedMemoryKey_Byte")
	}
	static class UQSSharedMemoryKey_Byte* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSSharedMemoryKey_Byte>();
	}
};
DUMPER7_ASSERTS_UQSSharedMemoryKey_Byte;

// Class QuestSystem.QSSharedMemoryKey_Double
// 0x0010 (0x0040 - 0x0030)
class UQSSharedMemoryKey_Double final : public UQSSharedMemoryKey
{
public:
	double                                        InitializeValue;                                   // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	double                                        ParentInitializeValue;                             // 0x0038(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSSharedMemoryKey_Double")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSSharedMemoryKey_Double")
	}
	static class UQSSharedMemoryKey_Double* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSSharedMemoryKey_Double>();
	}
};
DUMPER7_ASSERTS_UQSSharedMemoryKey_Double;

// Class QuestSystem.QSSharedMemoryKey_Enum
// 0x0008 (0x0038 - 0x0030)
class UQSSharedMemoryKey_Enum final : public UQSSharedMemoryKey
{
public:
	class UEnum*                                  EnumType;                                          // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSSharedMemoryKey_Enum")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSSharedMemoryKey_Enum")
	}
	static class UQSSharedMemoryKey_Enum* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSSharedMemoryKey_Enum>();
	}
};
DUMPER7_ASSERTS_UQSSharedMemoryKey_Enum;

// Class QuestSystem.QSSharedMemoryKey_Float
// 0x0008 (0x0038 - 0x0030)
class UQSSharedMemoryKey_Float final : public UQSSharedMemoryKey
{
public:
	float                                         InitializeValue;                                   // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         ParentInitializeValue;                             // 0x0034(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSSharedMemoryKey_Float")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSSharedMemoryKey_Float")
	}
	static class UQSSharedMemoryKey_Float* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSSharedMemoryKey_Float>();
	}
};
DUMPER7_ASSERTS_UQSSharedMemoryKey_Float;

// Class QuestSystem.QSSharedMemoryKey_GameplayTag
// 0x0010 (0x0040 - 0x0030)
class UQSSharedMemoryKey_GameplayTag final : public UQSSharedMemoryKey
{
public:
	struct FGameplayTag                           InitializeValue;                                   // 0x0030(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                           ParentInitializeValue;                             // 0x0038(0x0008)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSSharedMemoryKey_GameplayTag")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSSharedMemoryKey_GameplayTag")
	}
	static class UQSSharedMemoryKey_GameplayTag* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSSharedMemoryKey_GameplayTag>();
	}
};
DUMPER7_ASSERTS_UQSSharedMemoryKey_GameplayTag;

// Class QuestSystem.QSSharedMemoryKey_Int
// 0x0008 (0x0038 - 0x0030)
class UQSSharedMemoryKey_Int final : public UQSSharedMemoryKey
{
public:
	int32                                         InitializeValue;                                   // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         ParentInitializeValue;                             // 0x0034(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSSharedMemoryKey_Int")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSSharedMemoryKey_Int")
	}
	static class UQSSharedMemoryKey_Int* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSSharedMemoryKey_Int>();
	}
};
DUMPER7_ASSERTS_UQSSharedMemoryKey_Int;

// Class QuestSystem.QSSharedMemoryKey_Name
// 0x0010 (0x0040 - 0x0030)
class UQSSharedMemoryKey_Name final : public UQSSharedMemoryKey
{
public:
	class FName                                   InitializeValue;                                   // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   ParentInitializeValue;                             // 0x0038(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSSharedMemoryKey_Name")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSSharedMemoryKey_Name")
	}
	static class UQSSharedMemoryKey_Name* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSSharedMemoryKey_Name>();
	}
};
DUMPER7_ASSERTS_UQSSharedMemoryKey_Name;

// Class QuestSystem.QSSharedMemoryKey_Object
// 0x0008 (0x0038 - 0x0030)
class UQSSharedMemoryKey_Object final : public UQSSharedMemoryKey
{
public:
	TSubclassOf<class UObject>                    BaseClass;                                         // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSSharedMemoryKey_Object")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSSharedMemoryKey_Object")
	}
	static class UQSSharedMemoryKey_Object* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSSharedMemoryKey_Object>();
	}
};
DUMPER7_ASSERTS_UQSSharedMemoryKey_Object;

// Class QuestSystem.QSSharedMemoryKey_Rotator
// 0x0030 (0x0060 - 0x0030)
class UQSSharedMemoryKey_Rotator final : public UQSSharedMemoryKey
{
public:
	struct FRotator                               InitializeValue;                                   // 0x0030(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	struct FRotator                               ParentInitializeValue;                             // 0x0048(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSSharedMemoryKey_Rotator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSSharedMemoryKey_Rotator")
	}
	static class UQSSharedMemoryKey_Rotator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSSharedMemoryKey_Rotator>();
	}
};
DUMPER7_ASSERTS_UQSSharedMemoryKey_Rotator;

// Class QuestSystem.QSSharedMemoryKey_Struct
// 0x0000 (0x0030 - 0x0030)
class UQSSharedMemoryKey_Struct final : public UQSSharedMemoryKey
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSSharedMemoryKey_Struct")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSSharedMemoryKey_Struct")
	}
	static class UQSSharedMemoryKey_Struct* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSSharedMemoryKey_Struct>();
	}
};
DUMPER7_ASSERTS_UQSSharedMemoryKey_Struct;

// Class QuestSystem.QSSharedMemoryKey_Vector
// 0x0030 (0x0060 - 0x0030)
class UQSSharedMemoryKey_Vector final : public UQSSharedMemoryKey
{
public:
	struct FVector                                InitializeValue;                                   // 0x0030(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                                ParentInitializeValue;                             // 0x0048(0x0018)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSSharedMemoryKey_Vector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSSharedMemoryKey_Vector")
	}
	static class UQSSharedMemoryKey_Vector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSSharedMemoryKey_Vector>();
	}
};
DUMPER7_ASSERTS_UQSSharedMemoryKey_Vector;

// Class QuestSystem.QSTaskItem
// 0x0000 (0x0068 - 0x0068)
class UQSTaskItem : public UQSItemBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSTaskItem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSTaskItem")
	}
	static class UQSTaskItem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSTaskItem>();
	}
};
DUMPER7_ASSERTS_UQSTaskItem;

// Class QuestSystem.QSTaskItem_CameraFade
// 0x00A0 (0x0108 - 0x0068)
class UQSTaskItem_CameraFade final : public UQSTaskItem
{
public:
	struct FRuntimeFloatCurve                     FadeValue;                                         // 0x0068(0x0088)(Edit, NativeAccessSpecifierPrivate)
	struct FLinearColor                           FadeColor;                                         // 0x00F0(0x0010)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bFadeAudio;                                        // 0x0100(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bCheckFinishedAlready;                             // 0x0101(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSTaskItem_CameraFade")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSTaskItem_CameraFade")
	}
	static class UQSTaskItem_CameraFade* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSTaskItem_CameraFade>();
	}
};
DUMPER7_ASSERTS_UQSTaskItem_CameraFade;

// Class QuestSystem.QSTask_AddSharedMemoryInt
// 0x0040 (0x00A8 - 0x0068)
class UQSTask_AddSharedMemoryInt final : public UQSTaskItem
{
public:
	struct FQSSharedMemorySelecter                Label;                                             // 0x0068(0x0010)(Deprecated, NoDestructor, NativeAccessSpecifierPublic)
	struct FQSDataProviderSharedMemorySelecterValue ProviderLabel;                                   // 0x0078(0x0028)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         AddValue;                                          // 0x00A0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("QSTask_AddSharedMemoryInt")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QSTask_AddSharedMemoryInt")
	}
	static class UQSTask_AddSharedMemoryInt* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQSTask_AddSharedMemoryInt>();
	}
};
