#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestSystemStoryFlag

#include "Basic.hpp"

#include "QuestSystem_structs.hpp"
#include "StoryFlagSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum QuestSystemStoryFlag.EQuestActiveAreaType
// NumValues: 0x0003
enum class EQuestActiveAreaType : uint8
{
	EffectiveArea                            = 0,
	InvalidArea                              = 1,
	EQuestActiveAreaType_MAX                 = 2,
};

// Enum QuestSystemStoryFlag.EQSStoryFlagBooleanCompare
// NumValues: 0x0003
enum class EQSStoryFlagBooleanCompare : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	EQSStoryFlagBooleanCompare_MAX           = 2,
};

// Enum QuestSystemStoryFlag.EQSStoryFlagGameplayTagCompare
// NumValues: 0x0007
enum class EQSStoryFlagGameplayTagCompare : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	Less                                     = 2,
	LessOrEqual                              = 3,
	Greater                                  = 4,
	GreaterOrEqual                           = 5,
	EQSStoryFlagGameplayTagCompare_MAX       = 6,
};

// Enum QuestSystemStoryFlag.EQSStoryFlagIntegerCompare
// NumValues: 0x0007
enum class EQSStoryFlagIntegerCompare : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	Less                                     = 2,
	LessOrEqual                              = 3,
	Greater                                  = 4,
	GreaterOrEqual                           = 5,
	EQSStoryFlagIntegerCompare_MAX           = 6,
};

// Enum QuestSystemStoryFlag.EQSVolatileStoryFlagBooleanCompare
// NumValues: 0x0003
enum class EQSVolatileStoryFlagBooleanCompare : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	EQSVolatileStoryFlagBooleanCompare_MAX   = 2,
};

// Enum QuestSystemStoryFlag.EQSVolatileStoryFlagGameplayTagCompare
// NumValues: 0x0007
enum class EQSVolatileStoryFlagGameplayTagCompare : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	Less                                     = 2,
	LessOrEqual                              = 3,
	Greater                                  = 4,
	GreaterOrEqual                           = 5,
	EQSVolatileStoryFlagGameplayTagCompare_MAX = 6,
};

// Enum QuestSystemStoryFlag.EQSVolatileStoryFlagIntegerCompare
// NumValues: 0x0007
enum class EQSVolatileStoryFlagIntegerCompare : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	Less                                     = 2,
	LessOrEqual                              = 3,
	Greater                                  = 4,
	GreaterOrEqual                           = 5,
	EQSVolatileStoryFlagIntegerCompare_MAX   = 6,
};

// ScriptStruct QuestSystemStoryFlag.QuestSpawnConditionKeyCache
// 0x0010 (0x0010 - 0x0000)
struct FQuestSpawnConditionKeyCache final
{
public:
	TArray<class FName>                           KeyCache;                                          // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQuestSpawnConditionKeyCache;

// ScriptStruct QuestSystemStoryFlag.QuestProgressHandle
// 0x000C (0x000C - 0x0000)
struct FQuestProgressHandle final
{
public:
	TWeakObjectPtr<class UObject>                 WeakRequestObject;                                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Identifier;                                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQuestProgressHandle;

// ScriptStruct QuestSystemStoryFlag.QuestProgressInfo
// 0x0018 (0x0018 - 0x0000)
struct FQuestProgressInfo final
{
public:
	class FText                                   Description;                                       // 0x0000(0x0010)(BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                         Num;                                               // 0x0010(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Max;                                               // 0x0014(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQuestProgressInfo;

// ScriptStruct QuestSystemStoryFlag.QuestMessageFlagChange
// 0x0001 (0x0001 - 0x0000)
struct FQuestMessageFlagChange final : public FQSMessageParamBase
{
public:
	uint8                                         Pad_0[0x1];                                        // 0x0000(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FQuestMessageFlagChange;

// ScriptStruct QuestSystemStoryFlag.QuestSpawnDefinitionDataRow
// 0x0038 (0x0040 - 0x0008)
struct FQuestSpawnDefinitionDataRow final : public FTableRowBase
{
public:
	struct FStoryFlagEvaluationFormula            StartConditions;                                   // 0x0008(0x0010)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UQuestSystemAsset>       QuestAsset;                                        // 0x0018(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQuestSpawnDefinitionDataRow;

// ScriptStruct QuestSystemStoryFlag.QuestSpawnInfo
// 0x0010 (0x0010 - 0x0000)
struct FQuestSpawnInfo final
{
public:
	bool                                          bRunning;                                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQSProgressor*                          Progressor;                                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
};
DUMPER7_ASSERTS_FQuestSpawnInfo;

// ScriptStruct QuestSystemStoryFlag.QuestProgressConditions
// 0x0018 (0x0018 - 0x0000)
struct FQuestProgressConditions final
{
public:
	struct FStoryFlagLabel                        FlagLabel;                                         // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 Progresses;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQuestProgressConditions;

// ScriptStruct QuestSystemStoryFlag.QuestSummaryInfo
// 0x0038 (0x0038 - 0x0000)
struct FQuestSummaryInfo final
{
public:
	class FText                                   QuestName;                                         // 0x0000(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                   QuestDescription;                                  // 0x0010(0x0010)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<class FText>                           Synopsis;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bNew;                                              // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bClear;                                            // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FQuestSummaryInfo;

// ScriptStruct QuestSystemStoryFlag.QuestSummarySectionDetails
// 0x0020 (0x0020 - 0x0000)
struct FQuestSummarySectionDetails final
{
public:
	class FText                                   Synopsis;                                          // 0x0000(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FStoryFlagEvaluationFormula            EvaluationFormula;                                 // 0x0010(0x0010)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQuestSummarySectionDetails;

// ScriptStruct QuestSystemStoryFlag.QuestSummaryDefinitionDataRow
// 0x0050 (0x0058 - 0x0008)
struct FQuestSummaryDefinitionDataRow final : public FTableRowBase
{
public:
	class FText                                   QuestName;                                         // 0x0008(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FText                                   QuestDescription;                                  // 0x0018(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FStoryFlagEvaluationFormula            BootEvaluationFormula;                             // 0x0028(0x0010)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStoryFlagEvaluationFormula            ClearEvaluationFormula;                            // 0x0038(0x0010)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FQuestSummarySectionDetails>    SectionInfos;                                      // 0x0048(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQuestSummaryDefinitionDataRow;

// ScriptStruct QuestSystemStoryFlag.QSDataProviderStoryFlagLabel
// 0x0008 (0x0020 - 0x0018)
struct FQSDataProviderStoryFlagLabel final : public FQSDataProviderBase
{
public:
	struct FStoryFlagLabel                        Value;                                             // 0x0018(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQSDataProviderStoryFlagLabel;

// ScriptStruct QuestSystemStoryFlag.QSDataProviderStoryFlagEvaluationFormula
// 0x0010 (0x0028 - 0x0018)
struct FQSDataProviderStoryFlagEvaluationFormula final : public FQSDataProviderBase
{
public:
	struct FStoryFlagEvaluationFormula            Value;                                             // 0x0018(0x0010)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FQSDataProviderStoryFlagEvaluationFormula;

// ScriptStruct QuestSystemStoryFlag.QSSharedMemoryEvaluationFormula
// 0x0000 (0x0010 - 0x0010)
struct FQSSharedMemoryEvaluationFormula final : public FSymbolEvaluationFormulaBase
{
};
DUMPER7_ASSERTS_FQSSharedMemoryEvaluationFormula;

}

