#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SQ_SummonBuddy

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "LevelSequence_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SQ_SummonBuddy.SQ_SummonBuddy_DirectorBP_C
// 0x00E8 (0x0130 - 0x0048)
class USQ_SummonBuddy_DirectorBP_C final : public ULevelSequenceDirector
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0048(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTransform                             StartTransform;                                    // 0x0050(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             TargetTransform;                                   // 0x00B0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          NS_Summon_Buddy_Burst_Pt;                          // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          NS_Summon_Buddy_Glow_Ball;                         // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ANiagaraActor*                          NS_Summon_Buddy_Appear_Line;                       // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 PlayerMesh;                                        // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SQ_SummonBuddy_DirectorBP(int32 EntryPoint);
	void GetBindingBuddy(class ACharacter** AsCharacter);
	void GetBindingPlayer(class ACharacter** AsCharacter);
	void GetNPCTransform();
	void GetPlayerTransform();
	void GetVisualControl(class AActor* Actor, class UBP_PlayerVisualControl_C** Result);
	void Heart_Tick(class AStaticMeshActor* Heart);
	void NS_Summon_Buddy_Appear_Line_Event(class ANiagaraActor* NS_Summon_Buddy_Appear_Line_0);
	void NS_Summon_Buddy_Appear_Line_Event_Tick(class ANiagaraActor* NS_Summon_Buddy_Appear_Line_0);
	void NS_Summon_Buddy_Burst_Pt_Event_Begin(class ANiagaraActor* NS_Summon_Buddy_Burst_Pt_0);
	void NS_Summon_Buddy_Glow_Ball_Event(class ANiagaraActor* NS_Summon_Buddy_Glow_Ball_0);
	void NS_Summon_Buddy_SetParameter(class ANiagaraActor* NS_Summon_Buddy_Begin);
	void SequenceEvent__ENTRYPOINTSQ_SummonBuddy_DirectorBP(class ANiagaraActor* NS_Summon_Buddy_Begin);
	void SequenceEvent__ENTRYPOINTSQ_SummonBuddy_DirectorBP_0();
	void SequenceEvent__ENTRYPOINTSQ_SummonBuddy_DirectorBP_1();
	void SequenceEvent__ENTRYPOINTSQ_SummonBuddy_DirectorBP_2();
	void SequenceEvent__ENTRYPOINTSQ_SummonBuddy_DirectorBP_3(class ANiagaraActor* NS_Summon_Buddy_Burst_Pt_0);
	void SequenceEvent__ENTRYPOINTSQ_SummonBuddy_DirectorBP_4(class ANiagaraActor* NS_Summon_Buddy_Glow_Ball_0);
	void SequenceEvent__ENTRYPOINTSQ_SummonBuddy_DirectorBP_5(class ANiagaraActor* NS_Summon_Buddy_Appear_Line_0);
	void SequenceEvent__ENTRYPOINTSQ_SummonBuddy_DirectorBP_6(class ANiagaraActor* NS_Summon_Buddy_Appear_Line_0);
	void SequenceEvent__ENTRYPOINTSQ_SummonBuddy_DirectorBP_7();
	void SetMaterialParameter_VanishCenter(class UMeshComponent* Mesh, class FName Parameter);
	void ShowBuddy();
	void ShowBuddy_Begin();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SQ_SummonBuddy_DirectorBP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SQ_SummonBuddy_DirectorBP_C")
	}
	static class USQ_SummonBuddy_DirectorBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USQ_SummonBuddy_DirectorBP_C>();
	}
};
DUMPER7_ASSERTS_USQ_SummonBuddy_DirectorBP_C;

}

