#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_DestructibleMeshActor_ResetTransformInfo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_DestructibleMeshActor_ResetTransformInfo.ST_DestructibleMeshActor_ResetTransformInfo
// 0x0080 (0x0080 - 0x0000)
struct FST_DestructibleMeshActor_ResetTransformInfo final
{
public:
	class USceneComponent*                        ParentComponent_6_80D49397470F5EA38EB788A7AED40936; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             WorldTransform_8_5B504C4F49C969A1D03DCFBF0EAC7C2D; // 0x0010(0x0060)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bVisibility_10_EFBCE4D74AB2CC58B6D7588B2F7F8564;   // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             CollisionEnabled_14_5702DECE436CE97FBA909FBB245CBAF9; // 0x0071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_DestructibleMeshActor_ResetTransformInfo;

}

