#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StoryFlagSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum StoryFlagSystem.EStoryFlagType
// NumValues: 0x0004
enum class EStoryFlagType : uint32
{
	Boolean                                  = 0,
	Integer                                  = 1,
	GamePlayTag                              = 2,
	EStoryFlagType_MAX                       = 3,
};

// Enum StoryFlagSystem.EStoryFlagCompare
// NumValues: 0x0007
enum class EStoryFlagCompare : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	Less                                     = 2,
	LessOrEqual                              = 3,
	Greater                                  = 4,
	GreaterOrEqual                           = 5,
	EStoryFlagCompare_MAX                    = 6,
};

// ScriptStruct StoryFlagSystem.SymbolEvaluationFormulaBase
// 0x0010 (0x0010 - 0x0000)
struct FSymbolEvaluationFormulaBase
{
public:
	class FString                                 EvaluationFormula;                                 // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSymbolEvaluationFormulaBase;

// ScriptStruct StoryFlagSystem.StoryFlagEvaluationFormula
// 0x0000 (0x0010 - 0x0010)
struct FStoryFlagEvaluationFormula final : public FSymbolEvaluationFormulaBase
{
};
DUMPER7_ASSERTS_FStoryFlagEvaluationFormula;

// ScriptStruct StoryFlagSystem.StoryFlagDataLayerInfo
// 0x0050 (0x0058 - 0x0008)
struct FStoryFlagDataLayerInfo final : public FTableRowBase
{
public:
	TSoftObjectPtr<class UDataLayerAsset>         DataLayerAsset;                                    // 0x0008(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStoryFlagEvaluationFormula            Condition;                                         // 0x0030(0x0010)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                   TimeSeriesCondition;                               // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	EDataLayerRuntimeState                        SuccessState;                                      // 0x0050(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDataLayerRuntimeState                        FailedState;                                       // 0x0051(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableSuccessState;                               // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEanbleFailedState;                                // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStoryFlagDataLayerInfo;

// ScriptStruct StoryFlagSystem.StoryFlagPresetLabel
// 0x0008 (0x0008 - 0x0000)
struct FStoryFlagPresetLabel final
{
public:
	class FName                                   Label;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStoryFlagPresetLabel;

// ScriptStruct StoryFlagSystem.StoryFlagAliasLabel
// 0x0008 (0x0008 - 0x0000)
struct FStoryFlagAliasLabel final
{
public:
	class FName                                   Label;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStoryFlagAliasLabel;

// ScriptStruct StoryFlagSystem.StoryFlagLabel
// 0x0008 (0x0008 - 0x0000)
struct FStoryFlagLabel final
{
public:
	class FName                                   Label;                                             // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStoryFlagLabel;

// ScriptStruct StoryFlagSystem.StoryFlagChangeParam
// 0x0020 (0x0020 - 0x0000)
struct FStoryFlagChangeParam final
{
public:
	struct FStoryFlagLabel                        Label;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PrevValue;                                         // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewValue;                                          // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           PrevTag;                                           // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           NewTag;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStoryFlagChangeParam;

// ScriptStruct StoryFlagSystem.EFA_Token
// 0x0020 (0x0020 - 0x0000)
struct alignas(0x08) FEFA_Token final
{
public:
	uint8                                         Pad_0[0x20];                                       // 0x0000(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FEFA_Token;

// ScriptStruct StoryFlagSystem.StoryFlagDefinitionDataRow
// 0x0058 (0x0060 - 0x0008)
struct FStoryFlagDefinitionDataRow final : public FTableRowBase
{
public:
	class FName                                   Category;                                          // 0x0008(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Description;                                       // 0x0010(0x0010)(Edit, NativeAccessSpecifierPublic)
	EStoryFlagType                                FlagType;                                          // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DefaultValueBool;                                  // 0x0024(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DefaultValue;                                      // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UDataTable>              TagDataTable;                                      // 0x0030(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Volatile;                                          // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsInitToKeepValue;                                 // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStoryFlagDefinitionDataRow;

// ScriptStruct StoryFlagSystem.StoryFlagPresetDataRow
// 0x0118 (0x0120 - 0x0008)
struct FStoryFlagPresetDataRow : public FTableRowBase
{
public:
	class FText                                   Description;                                       // 0x0008(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FName                                   Category;                                          // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FStoryFlagPresetLabel>          ChildPresets;                                      // 0x0020(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<struct FStoryFlagLabel, bool>            BooleanSet;                                        // 0x0030(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<struct FStoryFlagLabel, int32>           IntegerSet;                                        // 0x0080(0x0050)(Edit, NativeAccessSpecifierPublic)
	TMap<struct FStoryFlagLabel, struct FGameplayTag> GameplayTagSet;                                // 0x00D0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStoryFlagPresetDataRow;

// ScriptStruct StoryFlagSystem.StoryFlagCondition
// 0x0010 (0x0010 - 0x0000)
struct FStoryFlagCondition final
{
public:
	struct FStoryFlagLabel                        Label;                                             // 0x0000(0x0008)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CheckValue;                                        // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EStoryFlagCompare                             CompareType;                                       // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FStoryFlagCondition;

// ScriptStruct StoryFlagSystem.StoryFlagTagDataRow
// 0x0010 (0x0018 - 0x0008)
struct FStoryFlagTagDataRow final : public FTableRowBase
{
public:
	class FText                                   Description;                                       // 0x0008(0x0010)(Edit, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStoryFlagTagDataRow;

// ScriptStruct StoryFlagSystem.StoryFlagEvaluationFormulaAliasDataRow
// 0x0028 (0x0030 - 0x0008)
struct FStoryFlagEvaluationFormulaAliasDataRow final : public FTableRowBase
{
public:
	class FText                                   Description;                                       // 0x0008(0x0010)(Edit, NativeAccessSpecifierPublic)
	class FName                                   Category;                                          // 0x0018(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStoryFlagEvaluationFormula            EvaluationFormula;                                 // 0x0020(0x0010)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStoryFlagEvaluationFormulaAliasDataRow;

}

