#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STR_SeethroughActor

#include "Basic.hpp"

#include "STR_SeethroughObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STR_SeethroughActor.STR_SeethroughActor
// 0x0040 (0x0040 - 0x0000)
struct FSTR_SeethroughActor final
{
public:
	class AActor*                                 Actor_42_01B28CAE4E6BB75BE1026E8364CF0E06;         // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	int32                                         HitCount_45_31961E5246C081B55C91A3901AF727A9;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DistanceToCamera_48_2A7620D74F6802BAE209C99E11F5F87E; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTR_SeethroughObject>          Objects_54_70947EB9469C432F5452F38665E9B6BA;       // 0x0018(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	bool                                          bFadeOut_63_59B88AA744F591262225B0AC4D38BC8B;      // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FadeTime_67_A84DA13147D126092DF83182F87B1046;      // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FadeWeight_69_E5FCDD724DEB451611247A87EEF47783;    // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSTR_SeethroughActor;

}

