#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TakeMovieScene

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"
#include "MovieSceneTracks_structs.hpp"


namespace SDK
{

// Class TakeMovieScene.MovieSceneTakeSection
// 0x06D0 (0x07C8 - 0x00F8)
class UMovieSceneTakeSection final : public UMovieSceneSection
{
public:
	struct FMovieSceneIntegerChannel              HoursCurve;                                        // 0x00F8(0x0120)(NativeAccessSpecifierPublic)
	struct FMovieSceneIntegerChannel              MinutesCurve;                                      // 0x0218(0x0120)(NativeAccessSpecifierPublic)
	struct FMovieSceneIntegerChannel              SecondsCurve;                                      // 0x0338(0x0120)(NativeAccessSpecifierPublic)
	struct FMovieSceneIntegerChannel              FramesCurve;                                       // 0x0458(0x0120)(NativeAccessSpecifierPublic)
	struct FMovieSceneFloatChannel                SubFramesCurve;                                    // 0x0578(0x0128)(NativeAccessSpecifierPublic)
	struct FMovieSceneStringChannel               Slate;                                             // 0x06A0(0x0128)(NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneTakeSection")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneTakeSection")
	}
	static class UMovieSceneTakeSection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTakeSection>();
	}
};
DUMPER7_ASSERTS_UMovieSceneTakeSection;

// Class TakeMovieScene.MovieSceneTakeSettings
// 0x0060 (0x0088 - 0x0028)
class UMovieSceneTakeSettings final : public UObject
{
public:
	class FString                                 HoursName;                                         // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MinutesName;                                       // 0x0038(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SecondsName;                                       // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 FramesName;                                        // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SubFramesName;                                     // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SlateName;                                         // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneTakeSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneTakeSettings")
	}
	static class UMovieSceneTakeSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTakeSettings>();
	}
};
DUMPER7_ASSERTS_UMovieSceneTakeSettings;

// Class TakeMovieScene.MovieSceneTakeTrack
// 0x0010 (0x00B0 - 0x00A0)
class UMovieSceneTakeTrack final : public UMovieSceneNameableTrack
{
public:
	TArray<class UMovieSceneSection*>             Sections;                                          // 0x00A0(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MovieSceneTakeTrack")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MovieSceneTakeTrack")
	}
	static class UMovieSceneTakeTrack* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMovieSceneTakeTrack>();
	}
};
DUMPER7_ASSERTS_UMovieSceneTakeTrack;

}

