#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Text3D

#include "Basic.hpp"

#include "Text3D_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Text3D.Text3DCharacterTransform.SetLocationDistance
// 0x0018 (0x0018 - 0x0000)
struct Text3DCharacterTransform_SetLocationDistance final
{
public:
	struct FVector                                Distance;                                          // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetLocationDistance;

// Function Text3D.Text3DCharacterTransform.SetLocationEnabled
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetLocationEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetLocationEnabled;

// Function Text3D.Text3DCharacterTransform.SetLocationOrder
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetLocationOrder final
{
public:
	EText3DCharacterEffectOrder                   Order;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetLocationOrder;

// Function Text3D.Text3DCharacterTransform.SetLocationProgress
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetLocationProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetLocationProgress;

// Function Text3D.Text3DCharacterTransform.SetLocationRange
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetLocationRange final
{
public:
	float                                         Range;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetLocationRange;

// Function Text3D.Text3DCharacterTransform.SetRotateBegin
// 0x0018 (0x0018 - 0x0000)
struct Text3DCharacterTransform_SetRotateBegin final
{
public:
	struct FRotator                               Value;                                             // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetRotateBegin;

// Function Text3D.Text3DCharacterTransform.SetRotateEnabled
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetRotateEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetRotateEnabled;

// Function Text3D.Text3DCharacterTransform.SetRotateEnd
// 0x0018 (0x0018 - 0x0000)
struct Text3DCharacterTransform_SetRotateEnd final
{
public:
	struct FRotator                               Value;                                             // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetRotateEnd;

// Function Text3D.Text3DCharacterTransform.SetRotateOrder
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetRotateOrder final
{
public:
	EText3DCharacterEffectOrder                   Order;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetRotateOrder;

// Function Text3D.Text3DCharacterTransform.SetRotateProgress
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetRotateProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetRotateProgress;

// Function Text3D.Text3DCharacterTransform.SetRotateRange
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetRotateRange final
{
public:
	float                                         Range;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetRotateRange;

// Function Text3D.Text3DCharacterTransform.SetScaleBegin
// 0x0018 (0x0018 - 0x0000)
struct Text3DCharacterTransform_SetScaleBegin final
{
public:
	struct FVector                                Value;                                             // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetScaleBegin;

// Function Text3D.Text3DCharacterTransform.SetScaleEnabled
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetScaleEnabled final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetScaleEnabled;

// Function Text3D.Text3DCharacterTransform.SetScaleEnd
// 0x0018 (0x0018 - 0x0000)
struct Text3DCharacterTransform_SetScaleEnd final
{
public:
	struct FVector                                Value;                                             // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetScaleEnd;

// Function Text3D.Text3DCharacterTransform.SetScaleOrder
// 0x0001 (0x0001 - 0x0000)
struct Text3DCharacterTransform_SetScaleOrder final
{
public:
	EText3DCharacterEffectOrder                   Order;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetScaleOrder;

// Function Text3D.Text3DCharacterTransform.SetScaleProgress
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetScaleProgress final
{
public:
	float                                         Progress;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetScaleProgress;

// Function Text3D.Text3DCharacterTransform.SetScaleRange
// 0x0004 (0x0004 - 0x0000)
struct Text3DCharacterTransform_SetScaleRange final
{
public:
	float                                         Range;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DCharacterTransform_SetScaleRange;

// Function Text3D.Text3DComponent.GetBounds
// 0x0030 (0x0030 - 0x0000)
struct Text3DComponent_GetBounds final
{
public:
	struct FVector                                Origin;                                            // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                BoxExtent;                                         // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetBounds;

// Function Text3D.Text3DComponent.GetGlyphCount
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_GetGlyphCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetGlyphCount;

// Function Text3D.Text3DComponent.GetGlyphKerningComponent
// 0x0010 (0x0010 - 0x0000)
struct Text3DComponent_GetGlyphKerningComponent final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetGlyphKerningComponent;

// Function Text3D.Text3DComponent.GetGlyphKerningComponents
// 0x0010 (0x0010 - 0x0000)
struct Text3DComponent_GetGlyphKerningComponents final
{
public:
	TArray<class USceneComponent*>                ReturnValue;                                       // 0x0000(0x0010)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetGlyphKerningComponents;

// Function Text3D.Text3DComponent.GetGlyphMeshComponent
// 0x0010 (0x0010 - 0x0000)
struct Text3DComponent_GetGlyphMeshComponent final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetGlyphMeshComponent;

// Function Text3D.Text3DComponent.GetGlyphMeshComponents
// 0x0010 (0x0010 - 0x0000)
struct Text3DComponent_GetGlyphMeshComponents final
{
public:
	TArray<class UStaticMeshComponent*>           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetGlyphMeshComponents;

// Function Text3D.Text3DComponent.GetTextScale
// 0x0018 (0x0018 - 0x0000)
struct Text3DComponent_GetTextScale final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetTextScale;

// Function Text3D.Text3DComponent.SetBackMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_SetBackMaterial final
{
public:
	class UMaterialInterface*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetBackMaterial;

// Function Text3D.Text3DComponent.SetBevel
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetBevel final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetBevel;

// Function Text3D.Text3DComponent.SetBevelMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_SetBevelMaterial final
{
public:
	class UMaterialInterface*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetBevelMaterial;

// Function Text3D.Text3DComponent.SetBevelSegments
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetBevelSegments final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetBevelSegments;

// Function Text3D.Text3DComponent.SetBevelType
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetBevelType final
{
public:
	EText3DBevelType                              Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetBevelType;

// Function Text3D.Text3DComponent.SetCastShadow
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetCastShadow final
{
public:
	bool                                          NewCastShadow;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetCastShadow;

// Function Text3D.Text3DComponent.SetExtrude
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetExtrude final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetExtrude;

// Function Text3D.Text3DComponent.SetExtrudeMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_SetExtrudeMaterial final
{
public:
	class UMaterialInterface*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetExtrudeMaterial;

// Function Text3D.Text3DComponent.SetFont
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_SetFont final
{
public:
	class UFont*                                  InFont;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetFont;

// Function Text3D.Text3DComponent.SetFreeze
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetFreeze final
{
public:
	bool                                          bFreeze;                                           // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetFreeze;

// Function Text3D.Text3DComponent.SetFrontMaterial
// 0x0008 (0x0008 - 0x0000)
struct Text3DComponent_SetFrontMaterial final
{
public:
	class UMaterialInterface*                     Value;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetFrontMaterial;

// Function Text3D.Text3DComponent.SetHasMaxHeight
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetHasMaxHeight final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetHasMaxHeight;

// Function Text3D.Text3DComponent.SetHasMaxWidth
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetHasMaxWidth final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetHasMaxWidth;

// Function Text3D.Text3DComponent.SetHasOutline
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetHasOutline final
{
public:
	bool                                          bValue;                                            // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetHasOutline;

// Function Text3D.Text3DComponent.SetHorizontalAlignment
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetHorizontalAlignment final
{
public:
	EText3DHorizontalTextAlignment                Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetHorizontalAlignment;

// Function Text3D.Text3DComponent.SetKerning
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetKerning final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetKerning;

// Function Text3D.Text3DComponent.SetLineSpacing
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetLineSpacing final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetLineSpacing;

// Function Text3D.Text3DComponent.SetMaxHeight
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetMaxHeight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetMaxHeight;

// Function Text3D.Text3DComponent.SetMaxWidth
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetMaxWidth final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetMaxWidth;

// Function Text3D.Text3DComponent.SetOutlineExpand
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetOutlineExpand final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetOutlineExpand;

// Function Text3D.Text3DComponent.SetScaleProportionally
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetScaleProportionally final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetScaleProportionally;

// Function Text3D.Text3DComponent.SetText
// 0x0010 (0x0010 - 0x0000)
struct Text3DComponent_SetText final
{
public:
	class FText                                   Value;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetText;

// Function Text3D.Text3DComponent.SetVerticalAlignment
// 0x0001 (0x0001 - 0x0000)
struct Text3DComponent_SetVerticalAlignment final
{
public:
	EText3DVerticalTextAlignment                  Value;                                             // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetVerticalAlignment;

// Function Text3D.Text3DComponent.SetWordSpacing
// 0x0004 (0x0004 - 0x0000)
struct Text3DComponent_SetWordSpacing final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_SetWordSpacing;

// Function Text3D.Text3DComponent.GetFormattedText
// 0x0010 (0x0010 - 0x0000)
struct Text3DComponent_GetFormattedText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetFormattedText;

// Function Text3D.Text3DComponent.GetTypefaceNames
// 0x0010 (0x0010 - 0x0000)
struct Text3DComponent_GetTypefaceNames final
{
public:
	TArray<class FName>                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Text3DComponent_GetTypefaceNames;

}

