#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "RigVM_structs.hpp"
#include "AnimationCore_structs.hpp"


namespace SDK
{

// PropertyBag Transient.PropertyBag_b2f96c6fc4af8638
// 0x0004 (0x0004 - 0x0000)
struct FPropertyBag_b2f96c6fc4af8638 final
{
public:
	float                                         RigVMModel___SetCurveValue_Value__Const;           // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_b2f96c6fc4af8638;

// PropertyBag Transient.PropertyBag_6fde87da6d8b756
// 0x0030 (0x0030 - 0x0000)
struct FPropertyBag_6fde87da6d8b756 final
{
public:
	struct FRigElementKey                         RigVMModel___Set_Relative_Transform_Child__Const;  // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___Set_Relative_Transform_Parent__Const; // 0x000C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Relative_Transform_bParentInitial__Const; // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___Set_Relative_Transform_Weight__Const; // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___Set_Relative_Transform_bPropagateToChildren__Const; // 0x0020(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___Set_Relative_Transform_1_Child__Const; // 0x0024(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_6fde87da6d8b756;

// PropertyBag Transient.PropertyBag_0
// 0x0000 (0x0000 - 0x0000)
struct FPropertyBag_0 final
{
};
DUMPER7_ASSERTS_FPropertyBag_0;

// ScriptStruct Transient.HoudiniEvent_SWC
// 0x0048 (0x0048 - 0x0000)
struct FHoudiniEvent_SWC final
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Impulse;                                           // 0x0018(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector3f                              Velocity;                                          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         POINTID;                                           // 0x0028(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LIFE;                                              // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Type;                                              // 0x0044(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FHoudiniEvent_SWC;

// PropertyBag Transient.PropertyBag_e71d909cdf31ea4
// 0x07A0 (0x07A0 - 0x0000)
struct FPropertyBag_e71d909cdf31ea4 final
{
public:
	struct FRigElementKey                         RigVMModel___SetRotation_3_1_1_Item__Const;        // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___SetRotation_3_1_1_Space__Const;       // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___SetRotation_3_1_1_bInitial__Const;    // 0x000D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_4_A__Const; // 0x0010(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_Item__Const; // 0x0030(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___MathTransformMakeRelative_2_1_2_1_4_Parent__Const; // 0x0040(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathQuaternionSwingTwist_2_1_1_1_4_TwistAxis__Const; // 0x00A0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_4_T__Const; // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___SetRotation_3_1_1_bPropagateToChildren__Const; // 0x00BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___AimItem_Item__Const;                  // 0x00C0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_Primary__Const;               // 0x00D0(0x0048)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_Item__Const;     // 0x0118(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___RigUnit_GetTransform_Space__Const;    // 0x0124(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_Secondary__Const;             // 0x0128(0x0048)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_3_1_Item__Const; // 0x0170(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         RigVMModel___AimItem_DebugSettings__Const;         // 0x0180(0x0070)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___AimItem_1_Item__Const;                // 0x01F0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_1_Item__Const;          // 0x01FC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_2_T__Const; // 0x0208(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_Item__Const;            // 0x020C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_Item__Const; // 0x0218(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_3_T__Const; // 0x0224(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_Item__Const;              // 0x0228(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_Item__Const;            // 0x0234(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_1_1_T__Const;     // 0x0240(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_Item__Const;          // 0x0244(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_3_1_T__Const; // 0x0250(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_Item__Const;        // 0x0254(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_1_A__Const; // 0x0260(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_1_2_Item__Const; // 0x0280(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_Item__Const;      // 0x028C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_6_Item__Const;  // 0x0298(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_1_4_1_1_1_Item__Const; // 0x02A4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_5_1_T__Const; // 0x02B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_5_Item__Const;  // 0x02B4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_4_Item__Const;  // 0x02C0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_3_Item__Const;  // 0x02CC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_2_Item__Const;  // 0x02D8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_2_Item__Const; // 0x02E4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_1_Item__Const;  // 0x02F0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_Item__Const;    // 0x02FC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_2_1_2_Item__Const; // 0x0308(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_1_1_Item__Const;              // 0x0314(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_1_Primary__Const;           // 0x0320(0x0048)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_1_Item__Const; // 0x0368(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_1_Secondary__Const;         // 0x0378(0x0048)(Edit, NoDestructor)
	struct FRigUnit_AimBone_DebugSettings         RigVMModel___AimItem_1_1_DebugSettings__Const;     // 0x03C0(0x0070)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___AimItem_1_2_Item__Const;              // 0x0430(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_2_Secondary__Const;         // 0x0440(0x0048)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___SetRotation_3_1_2_Item__Const;        // 0x0488(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_2_Item__Const;          // 0x0494(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_3_Item__Const; // 0x04A0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_Item__Const;            // 0x04AC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_1_Item__Const;          // 0x04B8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_2_Item__Const;        // 0x04C4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_2_Item__Const;      // 0x04D0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_1_2_1_Item__Const; // 0x04DC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_2_Item__Const;    // 0x04E8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_6_1_Item__Const; // 0x04F4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_1_4_1_1_1_1_Item__Const; // 0x0500(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_5_1_Item__Const; // 0x050C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_4_1_Item__Const; // 0x0518(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_3_1_Item__Const; // 0x0524(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_2_1_Item__Const; // 0x0530(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_2_2_Item__Const; // 0x053C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_1_1_Item__Const; // 0x0548(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_7_Item__Const;  // 0x0554(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_2_1_2_1_Item__Const; // 0x0560(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_1_1_1_Item__Const;      // 0x056C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_2_Item__Const; // 0x0578(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_2_Item__Const;                // 0x0584(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_2_Item__Const;   // 0x0590(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_3_1_2_Item__Const; // 0x059C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_1_3_Item__Const;              // 0x05A8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_1_3_Item__Const;        // 0x05B4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_3_Item__Const;          // 0x05C0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_4_Item__Const; // 0x05CC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_4_Item__Const;            // 0x05D8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_3_Item__Const;          // 0x05E4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_3_Item__Const;        // 0x05F0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_3_Item__Const;      // 0x05FC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_1_2_2_Item__Const; // 0x0608(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_3_Item__Const;    // 0x0614(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_6_2_Item__Const; // 0x0620(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_1_4_1_1_1_2_Item__Const; // 0x062C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_5_2_Item__Const; // 0x0638(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_4_2_Item__Const; // 0x0644(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_3_2_Item__Const; // 0x0650(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_2_2_Item__Const; // 0x065C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_2_1_Item__Const; // 0x0668(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_1_2_Item__Const; // 0x0674(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_8_Item__Const;  // 0x0680(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_2_1_2_2_Item__Const; // 0x068C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_1_1_1_Item__Const;            // 0x0698(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_1_1_Item__Const; // 0x06A4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_1_2_1_Item__Const;            // 0x06B0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_1_2_1_Item__Const;      // 0x06BC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_2_1_Item__Const;        // 0x06C8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_3_1_Item__Const; // 0x06D4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_1_Item__Const;          // 0x06E0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_1_1_Item__Const;        // 0x06EC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_2_1_Item__Const;      // 0x06F8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_2_1_Item__Const;    // 0x0704(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_1_2_1_1_Item__Const; // 0x0710(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_2_1_Item__Const;  // 0x071C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_6_1_1_Item__Const; // 0x0728(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_1_4_1_1_1_1_1_Item__Const; // 0x0734(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_5_1_1_Item__Const; // 0x0740(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_4_1_1_Item__Const; // 0x074C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_3_1_1_Item__Const; // 0x0758(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_2_1_1_Item__Const; // 0x0764(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_2_2_1_Item__Const; // 0x0770(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_1_1_1_Item__Const; // 0x077C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_7_1_Item__Const; // 0x0788(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_2_1_2_1_1_Item__Const; // 0x0794(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_e71d909cdf31ea4;

// PropertyBag Transient.PropertyBag_19e4cd475c2bc5b2
// 0x01C0 (0x01C0 - 0x0000)
struct FPropertyBag_19e4cd475c2bc5b2 final
{
public:
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_ItemA__Const;  // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_ItemB__Const;  // 0x000C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_EffectorItem__Const; // 0x0018(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___TwoBoneIKSimplePerItem_Effector__Const; // 0x0030(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___GetTransform_3_3_3_Space__Const;      // 0x0090(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___GetTransform_3_3_3_bInitial__Const;   // 0x0091(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_92[0x6];                                       // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___MathVectorAdd_B__Const;               // 0x0098(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathFloatMax_B__Const;                // 0x00B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___TwoBoneIKSimplePerItem_PrimaryAxis__Const; // 0x00B8(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___TwoBoneIKSimplePerItem_SecondaryAxis__Const; // 0x00D0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___TwoBoneIKSimplePerItem_SecondaryAxisWeight__Const; // 0x00E8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                RigVMModel___TwoBoneIKSimplePerItem_PoleVector__Const; // 0x00F0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EControlRigVectorKind                         RigVMModel___TwoBoneIKSimplePerItem_PoleVectorKind__Const; // 0x0108(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RigVMModel___TwoBoneIKSimplePerItem_StretchStartRatio__Const; // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___TwoBoneIKSimplePerItem_StretchMaximumRatio__Const; // 0x0110(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___TwoBoneIKSimplePerItem_bPropagateToChildren__Const; // 0x0114(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0xB];                                      // 0x0115(0x000B)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_TwoBoneIKSimple_DebugSettings RigVMModel___TwoBoneIKSimplePerItem_DebugSettings__Const; // 0x0120(0x0070)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_1_ItemA__Const; // 0x0190(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_1_ItemB__Const; // 0x019C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___TwoBoneIKSimplePerItem_1_EffectorItem__Const; // 0x01A8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RigVMModel___VariableNode_Value__Const;            // 0x01B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_19e4cd475c2bc5b2;

// ScriptStruct Transient.ChaosDestructionEvent_SWC
// 0x0044 (0x0044 - 0x0000)
struct FChaosDestructionEvent_SWC final
{
public:
	struct FVector3f                              Position;                                          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Normal;                                            // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              Velocity;                                          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector3f                              AngularVelocity;                                   // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtentMin;                                         // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExtentMax;                                         // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ParticleID;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Time;                                              // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Type;                                              // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FChaosDestructionEvent_SWC;

// PropertyBag Transient.PropertyBag_74f996ac7382adf
// 0x05D0 (0x05D0 - 0x0000)
struct FPropertyBag_74f996ac7382adf final
{
public:
	struct FRigElementKey                         RigVMModel___SetRotation_3_1_1_Item__Const;        // 0x0000(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___SetRotation_3_1_1_Space__Const;       // 0x000C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___SetRotation_3_1_1_bInitial__Const;    // 0x000D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_4_A__Const; // 0x0010(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_Item__Const; // 0x0030(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___MathTransformMakeRelative_2_1_2_1_4_Parent__Const; // 0x0040(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathQuaternionSwingTwist_2_1_1_1_4_TwistAxis__Const; // 0x00A0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_4_T__Const; // 0x00B8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___SetRotation_3_1_1_bPropagateToChildren__Const; // 0x00BC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___AimItem_Item__Const;                  // 0x00C0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_Primary__Const;               // 0x00D0(0x0048)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_Item__Const;     // 0x0118(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___RigUnit_GetTransform_Space__Const;    // 0x0124(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_Secondary__Const;             // 0x0128(0x0048)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_3_1_Item__Const; // 0x0170(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimBone_DebugSettings         RigVMModel___AimItem_DebugSettings__Const;         // 0x0180(0x0070)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___AimItem_1_Item__Const;                // 0x01F0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_1_Item__Const;          // 0x01FC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_2_T__Const; // 0x0208(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_Item__Const;            // 0x020C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_Item__Const; // 0x0218(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_3_T__Const; // 0x0224(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_Item__Const;              // 0x0228(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_Item__Const;            // 0x0234(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_1_1_T__Const;     // 0x0240(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_Item__Const;          // 0x0244(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_3_1_T__Const; // 0x0250(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_Item__Const;        // 0x0254(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_1_A__Const; // 0x0260(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_1_2_Item__Const; // 0x0280(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_Item__Const;      // 0x028C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_6_Item__Const;  // 0x0298(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_1_4_1_1_1_Item__Const; // 0x02A4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_5_1_T__Const; // 0x02B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_5_Item__Const;  // 0x02B4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_4_Item__Const;  // 0x02C0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_3_Item__Const;  // 0x02CC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_2_Item__Const;  // 0x02D8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_2_Item__Const; // 0x02E4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_1_Item__Const;  // 0x02F0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_Item__Const;    // 0x02FC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_2_1_2_Item__Const; // 0x0308(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___AimItem_1_1_Item__Const;              // 0x0314(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_1_Primary__Const;           // 0x0320(0x0048)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_1_1_Item__Const; // 0x0368(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_1_Secondary__Const;         // 0x0378(0x0048)(Edit, NoDestructor)
	struct FRigUnit_AimBone_DebugSettings         RigVMModel___AimItem_1_1_DebugSettings__Const;     // 0x03C0(0x0070)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___AimItem_1_2_Item__Const;              // 0x0430(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_2_Secondary__Const;         // 0x0440(0x0048)(Edit, NoDestructor)
	struct FRigElementKey                         RigVMModel___SetRotation_3_1_2_Item__Const;        // 0x0488(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_2_Item__Const;          // 0x0494(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_3_Item__Const; // 0x04A0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_2_Item__Const;            // 0x04AC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_1_Item__Const;          // 0x04B8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_2_Item__Const;        // 0x04C4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_2_Item__Const;      // 0x04D0(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_1_2_1_Item__Const; // 0x04DC(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_2_Item__Const;    // 0x04E8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_6_1_Item__Const; // 0x04F4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_1_4_1_1_1_1_Item__Const; // 0x0500(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_5_1_Item__Const; // 0x050C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_4_1_Item__Const; // 0x0518(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_3_1_Item__Const; // 0x0524(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_2_1_Item__Const; // 0x0530(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_2_2_Item__Const; // 0x053C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_1_1_Item__Const; // 0x0548(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_1_1_7_Item__Const;  // 0x0554(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_2_1_2_1_Item__Const; // 0x0560(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_2_1_Item__Const;        // 0x056C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_3_2_1_T__Const; // 0x0578(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_3_2_1_1_Item__Const;      // 0x057C(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_3_Item__Const;      // 0x0588(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_4_3_2_1_1_Item__Const; // 0x0594(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RigVMModel___MathQuaternionSwingTwist_2_1_1_1_1_1_TwistAxis__Const; // 0x05A0(0x0018)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___SetRotation_1_2_1_3_1_Item__Const;    // 0x05B8(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_3_1_1_1_4_3_2_1_1_2_Item__Const; // 0x05C4(0x000C)(Edit, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyBag_74f996ac7382adf;

// PropertyBag Transient.PropertyBag_ac083bc8f23d0399
// 0x37E0 (0x37E0 - 0x0000)
struct FPropertyBag_ac083bc8f23d0399 final
{
public:
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_4_Result; // 0x0000(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionSwingTwist_2_1_1_1_4_Swing; // 0x0020(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___MathTransformMakeRelative_2_1_2_1_4_Local; // 0x0040(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_1_Transform;   // 0x00A0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_3_1_CachedIndex; // 0x0100(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionSwingTwist_2_1_1_1_4_Input; // 0x0110(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionSwingTwist_2_1_1_1_4_Twist; // 0x0130(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___SetRotation_3_1_1_CachedIndex;        // 0x0150(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_Transform;       // 0x0160(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_CachedIndex;     // 0x01C0(0x0010)(Edit)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_Primary__IO;                  // 0x01D0(0x0048)(Edit, NoDestructor)
	uint8                                         Pad_218[0x8];                                      // 0x0218(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_3_1_Transform; // 0x0220(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_3_1_CachedIndex; // 0x0280(0x0010)(Edit)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_Secondary__IO;                // 0x0290(0x0048)(Edit, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_CachedItem;                   // 0x02D8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_PrimaryCachedSpace;           // 0x02E8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_SecondaryCachedSpace;         // 0x02F8(0x0010)(Edit)
	TArray<bool>                                  RigVMModel___AimItem_bIsInitialized;               // 0x0308(0x0010)(Edit)
	uint8                                         Pad_318[0x8];                                      // 0x0318(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_Transform;     // 0x0320(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_CachedIndex;   // 0x0380(0x0010)(Edit)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_Primary__IO;                // 0x0390(0x0048)(Edit, NoDestructor)
	uint8                                         Pad_3D8[0x8];                                      // 0x03D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_1_3_Transform;   // 0x03E0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_1_3_CachedIndex; // 0x0440(0x0010)(Edit)
	struct FRigUnit_AimItem_Target                RigVMModel___AimItem_1_Secondary__IO;              // 0x0450(0x0048)(Edit, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_1_CachedItem;                 // 0x0498(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_1_PrimaryCachedSpace;         // 0x04A8(0x0010)(Edit)
	TArray<struct FCachedRigElement>              RigVMModel___AimItem_1_SecondaryCachedSpace;       // 0x04B8(0x0010)(Edit)
	TArray<bool>                                  RigVMModel___AimItem_1_bIsInitialized;             // 0x04C8(0x0010)(Edit)
	uint8                                         Pad_4D8[0x8];                                      // 0x04D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_2_Result; // 0x04E0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionSwingTwist_2_1_1_1_2_Swing; // 0x0500(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_1_1_Transform; // 0x0520(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_3_1_1_CachedIndex; // 0x0580(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionSwingTwist_2_1_1_1_2_Input; // 0x0590(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionSwingTwist_2_1_1_1_2_Twist; // 0x05B0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___SetRotation_3_1_CachedIndex;          // 0x05D0(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_3_Result; // 0x05E0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_1_1_1_Transform; // 0x0600(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_3_1_1_1_CachedIndex; // 0x0660(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_3_B; // 0x0670(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___SetRotation_3_CachedIndex;            // 0x0690(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_1_Result;         // 0x06A0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionSwingTwist_2_Twist;     // 0x06C0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionInverse_4_1_2_2_Result; // 0x06E0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_1_1_1_4_3_Transform; // 0x0700(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_3_1_1_1_4_3_CachedIndex; // 0x0760(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionInverse_4_1_2_2_Value;  // 0x0770(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionSwingTwist_2_Swing;     // 0x0790(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___SetRotation_CachedIndex;              // 0x07B0(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_1_1_Result;       // 0x07C0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___SetRotation_1_CachedIndex;            // 0x07E0(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_3_1_Result; // 0x07F0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_1_1_1_1_Transform; // 0x0810(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_3_1_1_1_1_CachedIndex; // 0x0870(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_3_1_B; // 0x0880(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___SetRotation_1_2_CachedIndex;          // 0x08A0(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionMul_1_1_1_1_3_6_5_Result; // 0x08B0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_4_1_1_1_2_Transform; // 0x08D0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_4_1_1_1_2_CachedIndex; // 0x0930(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionMul_1_1_1_1_3_6_5_A;    // 0x0940(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_1_Result; // 0x0960(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionSwingTwist_2_1_1_1_1_Twist; // 0x0980(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionMul_1_4_1_2_1_Result;   // 0x09A0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_1_1_1_1_2_Transform; // 0x09C0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_3_1_1_1_1_2_CachedIndex; // 0x0A20(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionMul_1_4_1_2_1_A;        // 0x0A30(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionInverse_1_2_2_Result;   // 0x0A50(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_2_1_1_2_Transform; // 0x0A70(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_3_2_1_1_2_CachedIndex; // 0x0AD0(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionInverse_1_2_2_Value;    // 0x0AE0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionSwingTwist_2_1_1_1_1_Swing; // 0x0B00(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___SetRotation_1_2_1_CachedIndex;        // 0x0B20(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionMul_1_1_1_1_3_6_4_Result; // 0x0B30(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_4_1_1_1_1_1_Transform; // 0x0B50(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_4_1_1_1_1_1_CachedIndex; // 0x0BB0(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionMul_1_1_1_1_3_6_4_A;    // 0x0BC0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_1_1_Result; // 0x0BE0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___SetRotation_1_2_1_1_CachedIndex;      // 0x0C00(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionMul_4_1_1_1_Result;     // 0x0C10(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_5_1_1_2_1_2_Transform; // 0x0C30(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_5_1_1_2_1_2_CachedIndex; // 0x0C90(0x0010)(Edit)
	struct FQuat                                  RigVMModel___MathQuaternionMul_4_1_1_1_A;          // 0x0CA0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionSlerp_1_1_2_1_1_1_1_5_1_Result; // 0x0CC0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  RigVMModel___MathQuaternionSwingTwist_2_1_1_2_1_1_Swing; // 0x0CE0(0x0020)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___MathTransformMakeRelative_2_1_2_1_Local; // 0x0D00(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_1_1_1_1_4_1_1_1_Transform; // 0x0D60(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_3_1_1_1_1_4_1_1_1_CachedIndex; // 0x0DC0(0x0010)(Edit)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_3_2_1_1_4_1_1_1_Transform; // 0x0DD0(0x0060)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
