#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_AreaBuffListEntryPiece

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "BasicUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_AreaBuffListEntryPiece.WDT_AreaBuffListEntryPiece_C
// 0x0098 (0x0660 - 0x05C8)
class UWDT_AreaBuffListEntryPiece_C final : public UMenuPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackgroundBlur*                        BackgroundBlur;                                    // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        BackgroundBlur_72;                                 // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HelpShadow;                                        // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HelpText;                                          // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HeroText;                                          // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HeroText_Shadow;                                   // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   AreaBuffUniqueSaveID;                              // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuardianSpiritUIInfo                  AreaBuffInfo;                                      // 0x0608(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsBuffEnable;                                      // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x3];                                      // 0x0631(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            DefaultHeroTextColor;                              // 0x0634(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DefaultHelpTextColor;                              // 0x0648(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetAreaBuffInfo(class FName InAreaBuffUniqueSaveID, const struct FGuardianSpiritUIInfo& InAreaBuffInfo, bool InIsBuffEnable);
	void PreConstruct(bool IsDesignTime);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void GetAreaBuffInfo(class FName* OutAreaBuffID, struct FGuardianSpiritUIInfo* OutAreaBuffInfo, bool* OutIsBuffEnable);
	void ExecuteUbergraph_WDT_AreaBuffListEntryPiece(int32 EntryPoint);
	void Construct();
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_AreaBuffListEntryPiece_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_AreaBuffListEntryPiece_C")
	}
	static class UWDT_AreaBuffListEntryPiece_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_AreaBuffListEntryPiece_C>();
	}
};
DUMPER7_ASSERTS_UWDT_AreaBuffListEntryPiece_C;

}

