#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Status_GuardPerformance

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_Status_GuardPerformance.WDT_Status_GuardPerformance_C.SetGuardPerformance
// 0x0028 (0x0028 - 0x0000)
struct WDT_Status_GuardPerformance_C_SetGuardPerformance final
{
public:
	int32                                         InGuardPerformance;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0018(0x0010)()
};
DUMPER7_ASSERTS_WDT_Status_GuardPerformance_C_SetGuardPerformance;

}

