#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Article_Attribute

#include "Basic.hpp"

#include "WDT_Status_PieceBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_Article_Attribute.WDT_Article_Attribute_C
// 0x0048 (0x0710 - 0x06C8)
class UWDT_Article_Attribute_C final : public UWDT_Status_PieceBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WDT_Article_Attribute_C;            // 0x06C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_Attr_STR;                                    // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AttrSTR;                                           // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_11;                                // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_63;                                // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TitleText;                                         // 0x06F0(0x0010)(Edit, BlueprintVisible)
	class FText                                   IconText;                                          // 0x0700(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WDT_Article_Attribute(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetValue(int32 InValue);
	void SetValueComparison(int32 InCurrentValue, int32 InTargetValue, bool SwapComparisons);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_Article_Attribute_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_Article_Attribute_C")
	}
	static class UWDT_Article_Attribute_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_Article_Attribute_C>();
	}
};
DUMPER7_ASSERTS_UWDT_Article_Attribute_C;

}

