#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigMenuMeterPiece

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WDT_ConfigPieceBase_classes.hpp"
#include "Extensions_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ConfigMenuMeterPiece.WDT_ConfigMenuMeterPiece_C
// 0x00F8 (0x0730 - 0x0638)
class UWDT_ConfigMenuMeterPiece_C final : public UWDT_ConfigPieceBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WDT_ConfigMenuMeterPiece_C;         // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWDT_ConfigItemTogglePiece_C*           WDT_ConfigItemTogglePiece;                         // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigMeterPiece_C*                WDT_ConfigMeterPiece;                              // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigTextElement_C*               WDT_ConfigTextElement;                             // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_LeftArrowPiece_C*                  WDT_LeftArrowPiece;                                // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_RightArrowPiece_C*                 WDT_RightArrowPiece;                               // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        MaxSliderValue;                                    // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MinSliderValue;                                    // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SliderStrideValue;                                 // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DisplayMultiplier;                                 // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        SliderDefaultValue;                                // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTimeMeter;                                      // 0x0690(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_691[0x7];                                      // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SliderDisplayNormalizeValue;                       // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              ImageTexture;                                      // 0x06A0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FString                                 MoviePath;                                         // 0x06C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        DecimalDigitMultiplier;                            // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhotoModeIntParameter                        PhotoModeIntParamterType;                          // 0x06E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPhotoModeBoolParameter                       PhotoModeBoolParamterType;                         // 0x06E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E2[0x6];                                      // 0x06E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnChangeValueMaxToMin;                             // 0x06E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnChangeValueMinToMax;                             // 0x06F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        DefaultDisplayValue;                               // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsForcedLoop;                                     // 0x0710(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsToggleEditable;                                 // 0x0711(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_712[0x2];                                      // 0x0712(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           DisableColor;                                      // 0x0714(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_724[0x4];                                      // 0x0724(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DisplayAddValue;                                   // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTextStyle();
	void SetupMeter();
	void SetTogleOnOff(bool InFlag);
	void SetStrideValue(double NewParam);
	void SetMeterValue(double Value);
	void SetIsToggleEditable(bool InIsEditable);
	void SetIsEditable(bool InFlag);
	void SetDefaultValue(double InInitializeValue, double InDefaultValue);
	void SetDefaultDisplayValue(double InInitalizeValue, double InDefaultValue);
	bool Select(bool PlayAnimation_0);
	void PreConstruct(bool IsDesignTime);
	void OnRightPressed(bool bInIsPressStarted);
	void OnMouseWheelUpSubPiece(class UMenuPieceBase* MenuPiece, int32 Level);
	void OnMouseWheelDownSubPiece(class UMenuPieceBase* MenuPiece, int32 Level);
	void OnMouseLeftClickSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeaveSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseEnterSubPiece(class UMenuPieceBase* MenuPiece);
	void OnLeftPressed(bool bInIsPressStarted);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnDecideReleased();
	void InitializeToDefaultValue();
	void Initialize();
	void Increase(bool bInCanWarp);
	void GetToggleOn(bool* OutIsOn);
	void GetPhotoModeIntParameterType(EPhotoModeIntParameter* NewParam);
	void GetPhotoModeBoolParameterType(EPhotoModeBoolParameter* OutType);
	void GetMeterValue(double* MeterValue);
	void GetLogTexture(TSoftObjectPtr<class UTexture2D>* OutTexture, bool* OutIsSuccess);
	void GetLogMoviePath(class FString* OutPath, bool* OutIsSuccess);
	void GetDisplayValue(double* OutValue);
	void GetDefaultMeterValue(double* OutDefaultValue);
	void GetDefaultDisplayMeterValue(double* OutDisplayValue);
	void ExecuteUbergraph_WDT_ConfigMenuMeterPiece(int32 EntryPoint);
	bool Deselect(bool PlayAnimation_0);
	void Decrease(bool bInCanWarp);
	void ChangeTogleOnOff();
	void BndEvt__WDT_ConfigMenuMeterPiece_WDT_ConfigMeterPiece_K2Node_ComponentBoundEvent_0_OnSliderValueChangedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ConfigMenuMeterPiece_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ConfigMenuMeterPiece_C")
	}
	static class UWDT_ConfigMenuMeterPiece_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ConfigMenuMeterPiece_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ConfigMenuMeterPiece_C;

}

