#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Status_BleedingFactor

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_Status_BleedingFactor.WDT_Status_BleedingFactor_C.SetIndependentBleedingFactor
// 0x0018 (0x0018 - 0x0000)
struct WDT_Status_BleedingFactor_C_SetIndependentBleedingFactor final
{
public:
	int32                                         InBleedingFactor;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
DUMPER7_ASSERTS_WDT_Status_BleedingFactor_C_SetIndependentBleedingFactor;

// Function WDT_Status_BleedingFactor.WDT_Status_BleedingFactor_C.SetWeapon1BleedingFactor
// 0x0018 (0x0018 - 0x0000)
struct WDT_Status_BleedingFactor_C_SetWeapon1BleedingFactor final
{
public:
	int32                                         InBleedingFactor;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
DUMPER7_ASSERTS_WDT_Status_BleedingFactor_C_SetWeapon1BleedingFactor;

// Function WDT_Status_BleedingFactor.WDT_Status_BleedingFactor_C.SetWeapon2BleedingFactor
// 0x0018 (0x0018 - 0x0000)
struct WDT_Status_BleedingFactor_C_SetWeapon2BleedingFactor final
{
public:
	int32                                         InBleedingFactor;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
DUMPER7_ASSERTS_WDT_Status_BleedingFactor_C_SetWeapon2BleedingFactor;

}

