#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigLog

#include "Basic.hpp"

#include "EN_ConfigPieceEditableType_structs.hpp"


namespace SDK::Params
{

// Function WDT_ConfigLog.WDT_ConfigLog_C.SetVisibilityLogImage
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigLog_C_SetVisibilityLogImage final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigLog_C_SetVisibilityLogImage;

// Function WDT_ConfigLog.WDT_ConfigLog_C.SetLogTitleText
// 0x0010 (0x0010 - 0x0000)
struct WDT_ConfigLog_C_SetLogTitleText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WDT_ConfigLog_C_SetLogTitleText;

// Function WDT_ConfigLog.WDT_ConfigLog_C.SetLogMovie
// 0x0028 (0x0028 - 0x0000)
struct WDT_ConfigLog_C_SetLogMovie final
{
public:
	class FString                                 Path;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetBrushResource_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBinkMediaTexture*                      K2Node_DynamicCast_AsBink_Media_Texture;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenUrl_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigLog_C_SetLogMovie;

// Function WDT_ConfigLog.WDT_ConfigLog_C.SetImageTexture
// 0x0028 (0x0028 - 0x0000)
struct WDT_ConfigLog_C_SetImageTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              Textue;                                            // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigLog_C_SetImageTexture;

// Function WDT_ConfigLog.WDT_ConfigLog_C.Set Log Text
// 0x0070 (0x0070 - 0x0000)
struct WDT_ConfigLog_C_Set_Log_Text final
{
public:
	bool                                          InIsEditable;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EN_ConfigPieceEditableType                    InEditableType;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0010)()
};
DUMPER7_ASSERTS_WDT_ConfigLog_C_Set_Log_Text;

// Function WDT_ConfigLog.WDT_ConfigLog_C.CloseLogMovie
// 0x0018 (0x0018 - 0x0000)
struct WDT_ConfigLog_C_CloseLogMovie final
{
public:
	class UObject*                                CallFunc_GetBrushResource_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBinkMediaTexture*                      K2Node_DynamicCast_AsBink_Media_Texture;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigLog_C_CloseLogMovie;

}

