#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_FieldMenuTileBC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WDT_FieldMenuTilePieceBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C
// 0x0048 (0x0618 - 0x05D0)
class UWDT_FieldMenuTileBC_C final : public UWDT_FieldMenuTilePieceBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SelectMoveAnimation;                               // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DecideAnimation;                                   // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BoxCursorFrame;                                    // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BoxCursorImage;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseArea;                                         // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       TargetImage;                                       // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnassignedImage;                                   // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 VFX_CursorSelectMove;                              // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void WidgetAnimationEvt_SelectMoveAnimation_K2Node_WidgetAnimationEvent_0();
	bool Unhighlight(bool PlayAnimation_0);
	bool SetTexture(class UTexture2D* Texture);
	bool SetSubTexture(class FName ImageId, class UTexture2D* Texture);
	bool SetSubLazyTexture(class FName ImageId, const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	bool SetLazyTexture(const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	bool Select(bool PlayAnimation_0);
	bool Reset();
	void PlayDecideAnimation();
	void OnListItemObjectSet(class UObject* ListItemObject);
	bool Highlight(bool PlayAnimation_0);
	bool FlipTexture(bool IsInverse);
	void ExecuteUbergraph_WDT_FieldMenuTileBC(int32 EntryPoint);
	bool Enable();
	bool Disable();
	bool Deselect(bool PlayAnimation_0);
	bool ClearTexture();
	bool ClearSubTexture(class FName ImageId);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	bool Blink();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_FieldMenuTileBC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_FieldMenuTileBC_C")
	}
	static class UWDT_FieldMenuTileBC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_FieldMenuTileBC_C>();
	}
};
DUMPER7_ASSERTS_UWDT_FieldMenuTileBC_C;

}

