#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_BossBleedGauge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_BossBleedGauge.WDT_BossBleedGauge_C
// 0x0028 (0x0628 - 0x0600)
class UWDT_BossBleedGauge_C final : public UHudPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BleedAttackAnimation;                              // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWDT_ResourceBar_C*                     BossResourceBar;                                   // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_L;                                          // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Effect_S;                                          // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WDT_BossBleedGauge(int32 EntryPoint);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PlayBleedAttackEffect();
	void SetBleedAmount(double InBleedAmount, double InMaxBleedAmount, EResourceChangeFactor InFactor);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_BossBleedGauge_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_BossBleedGauge_C")
	}
	static class UWDT_BossBleedGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_BossBleedGauge_C>();
	}
};
DUMPER7_ASSERTS_UWDT_BossBleedGauge_C;

}

