#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigKeyAssignEditSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "BasicUI_classes.hpp"
#include "Extensions_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ConfigKeyAssignEditSelect.WDT_ConfigKeyAssignEditSelect_C
// 0x0040 (0x0500 - 0x04C0)
class UWDT_ConfigKeyAssignEditSelect_C final : public UUIElementBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWDT_ConfigMenuKeyAssignPiece_C*        WDT_ConfigMenuKeyAssignPiece;                      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FKey>                           GamePadKey;                                        // 0x04D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FKey>                           KeyboardKey_Main;                                  // 0x04E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FKey>                           KeyboardKey_Sub;                                   // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_WDT_ConfigKeyAssignEditSelect(int32 EntryPoint);
	void InitializeKey(const class FText& ActionName, EConfigKeyType InAssignKeyType, TArray<struct FKey>& InGamePadKey, TArray<struct FKey>& InKeyboardKey_Main, TArray<struct FKey>& InKeyboardKey_Sub);
	void SetKey(TArray<struct FKey>& InKey, EConfigKeyType InKeyType);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ConfigKeyAssignEditSelect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ConfigKeyAssignEditSelect_C")
	}
	static class UWDT_ConfigKeyAssignEditSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ConfigKeyAssignEditSelect_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ConfigKeyAssignEditSelect_C;

}

