#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigMenuKeyAssignPiece

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "WDT_ConfigPieceBase_classes.hpp"
#include "Extensions_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ConfigMenuKeyAssignPiece.WDT_ConfigMenuKeyAssignPiece_C
// 0x0090 (0x06C8 - 0x0638)
class UWDT_ConfigMenuKeyAssignPiece_C final : public UWDT_ConfigPieceBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WDT_ConfigMenuKeyAssignPiece_C;     // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWDT_ConfigKeyDisplayPiece_C*           GamePadKey_Console;                                // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigKeyDisplayPiece_C*           GamePadKey_Windows;                                // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_84;                                          // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigKeyDisplayPiece_C*           KeyboardKey_Windows_Main;                          // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigKeyDisplayPiece_C*           KeyboardKey_Windows_Sub;                           // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Category;                                  // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Console;                                   // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_DiffIcon_Console;                          // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_DiffIcon_Windows;                          // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Windows;                                   // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigTextElement_C*               WDT_ConfigTextElement_AssignEnable;                // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigTextElement_C*               WDT_ConfigTextElement_Category;                    // 0x0698(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigTextElement_C*               WDT_ConfigTextElement_Console;                     // 0x06A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher;                                    // 0x06A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FGameplayTag                           InputActionTag;                                    // 0x06B0(0x0008)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBP_ConfigKeyAssignEntryBase_C*         CurrentKeyEntry;                                   // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EConfigDisplayType                            ConfigDisplayType;                                 // 0x06C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindEvents();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ChangeTextStyle(bool bIsChange);
	void Construct();
	bool Deselect(bool PlayAnimation_0);
	void ExecuteUbergraph_WDT_ConfigMenuKeyAssignPiece(int32 EntryPoint);
	void GetInputActionTag(struct FGameplayTag* OutTag);
	void InitializeAssignEditSelectType(const class FText& InText, TArray<struct FKey>& InGamePadKey, TArray<struct FKey>& InKeyboardKey_Main, TArray<struct FKey>& InKeyboardKey_Sub, EConfigKeyType InKeyType);
	void InitializeCategoryDisplay();
	void InitializeConsoleDisplay();
	void InitializeDisplay();
	void InitializeToDefaultValue();
	void InitializeWindowsDisplay();
	void OnApplyKeyAssign(bool InIsKeyApply);
	void OnChangeEditKeyAssign(bool InIsKeyDefault, bool InIsKeyApply);
	void OnLeftPressed(bool bInIsPressStarted);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnMouseEnterSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeaveSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeftClickSubPiece(class UMenuPieceBase* MenuPiece);
	void OnRightPressed(bool bInIsPressStarted);
	void OnSetVisibilityDuplicationIcon(bool InFlag, EConfigKeyType InKeyType);
	void PreConstruct(bool IsDesignTime);
	bool Select(bool PlayAnimation_0);
	void SetDeselectKeyType();
	void SetIsEditable(bool InFlag);
	void SetKey(TArray<struct FKey>& InKeys, EConfigKeyType InIsGamePad);
	void SetSelectKeyType(EConfigKeyType InKeyType);
	void SetVisibilityDiffIcon(bool InVisible);
	void UnbindEvents();
	void UpdateChangeKeyAssignDisplay();
	void UpdateKeyDisplay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ConfigMenuKeyAssignPiece_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ConfigMenuKeyAssignPiece_C")
	}
	static class UWDT_ConfigMenuKeyAssignPiece_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ConfigMenuKeyAssignPiece_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ConfigMenuKeyAssignPiece_C;

}

