#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_StatusSummary_Health

#include "Basic.hpp"

#include "WDT_Status_PieceBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_StatusSummary_Health.WDT_StatusSummary_Health_C
// 0x0048 (0x0710 - 0x06C8)
class UWDT_StatusSummary_Health_C final : public UWDT_Status_PieceBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WDT_StatusSummary_Health_C;         // 0x06C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_SummaryBuddyPoint;                           // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_SummaryMaxHP;                                // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SummaryBuddyPoint;                                 // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SummaryBuddyPoint_DiffNum;                         // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SummaryHP;                                         // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SummaryMaxBuddyPoint;                              // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SummaryMaxHP;                                      // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SummaryMaxHP_DiffNum;                              // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WDT_StatusSummary_Health(int32 EntryPoint);
	void SetHealth(double InHealth, double InMaxHealth);
	void SetHealthComparison(int32 InMaxHealthCurrent, int32 InMaxHealth, int32 InMaxLPCurrent, int32 InMaxLP);
	void SetLP(int32 InLP, int32 InMaxLP);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_StatusSummary_Health_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_StatusSummary_Health_C")
	}
	static class UWDT_StatusSummary_Health_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_StatusSummary_Health_C>();
	}
};
DUMPER7_ASSERTS_UWDT_StatusSummary_Health_C;

}

