#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_StatusDownEffectIcon

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function WDT_StatusDownEffectIcon.WDT_StatusDownEffectIcon_C.ClearSubTexture
// 0x000C (0x000C - 0x0000)
struct WDT_StatusDownEffectIcon_C_ClearSubTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_StatusDownEffectIcon_C_ClearSubTexture;

// Function WDT_StatusDownEffectIcon.WDT_StatusDownEffectIcon_C.ClearTexture
// 0x0001 (0x0001 - 0x0000)
struct WDT_StatusDownEffectIcon_C_ClearTexture final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_StatusDownEffectIcon_C_ClearTexture;

// Function WDT_StatusDownEffectIcon.WDT_StatusDownEffectIcon_C.ExecuteUbergraph_WDT_StatusDownEffectIcon
// 0x0028 (0x0028 - 0x0000)
struct WDT_StatusDownEffectIcon_C_ExecuteUbergraph_WDT_StatusDownEffectIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_InTimeElapsed;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_InTimeTotal;                          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_StatusDownEffectIcon_C_ExecuteUbergraph_WDT_StatusDownEffectIcon;

// Function WDT_StatusDownEffectIcon.WDT_StatusDownEffectIcon_C.FlipTexture
// 0x0002 (0x0002 - 0x0000)
struct WDT_StatusDownEffectIcon_C_FlipTexture final
{
public:
	bool                                          IsInverse;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_StatusDownEffectIcon_C_FlipTexture;

// Function WDT_StatusDownEffectIcon.WDT_StatusDownEffectIcon_C.MakeDMI
// 0x00E0 (0x00E0 - 0x0000)
struct WDT_StatusDownEffectIcon_C_MakeDMI final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x00D0)()
};
DUMPER7_ASSERTS_WDT_StatusDownEffectIcon_C_MakeDMI;

// Function WDT_StatusDownEffectIcon.WDT_StatusDownEffectIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_StatusDownEffectIcon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_StatusDownEffectIcon_C_PreConstruct;

// Function WDT_StatusDownEffectIcon.WDT_StatusDownEffectIcon_C.SetLazyTexture
// 0x0030 (0x0030 - 0x0000)
struct WDT_StatusDownEffectIcon_C_SetLazyTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              LazyTexture;                                       // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_StatusDownEffectIcon_C_SetLazyTexture;

// Function WDT_StatusDownEffectIcon.WDT_StatusDownEffectIcon_C.SetStatusEffectIconInfo
// 0x0028 (0x0028 - 0x0000)
struct WDT_StatusDownEffectIcon_C_SetStatusEffectIconInfo final
{
public:
	struct FStatusEffectIconHandle                InHandle;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	EStatusDownEffectIconType                     InType;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             InTexture;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             InFrame;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_StatusDownEffectIcon_C_SetStatusEffectIconInfo;

// Function WDT_StatusDownEffectIcon.WDT_StatusDownEffectIcon_C.SetStatusTimeElapsed
// 0x0010 (0x0010 - 0x0000)
struct WDT_StatusDownEffectIcon_C_SetStatusTimeElapsed final
{
public:
	double                                        InTimeElapsed;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InTimeTotal;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_StatusDownEffectIcon_C_SetStatusTimeElapsed;

// Function WDT_StatusDownEffectIcon.WDT_StatusDownEffectIcon_C.SetSubLazyTexture
// 0x0038 (0x0038 - 0x0000)
struct WDT_StatusDownEffectIcon_C_SetSubLazyTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              LazyTexture;                                       // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_StatusDownEffectIcon_C_SetSubLazyTexture;

// Function WDT_StatusDownEffectIcon.WDT_StatusDownEffectIcon_C.SetSubTexture
// 0x0018 (0x0018 - 0x0000)
struct WDT_StatusDownEffectIcon_C_SetSubTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_StatusDownEffectIcon_C_SetSubTexture;

// Function WDT_StatusDownEffectIcon.WDT_StatusDownEffectIcon_C.SetTexture
// 0x0010 (0x0010 - 0x0000)
struct WDT_StatusDownEffectIcon_C_SetTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_StatusDownEffectIcon_C_SetTexture;

}

