#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_CategoryPalletSlot

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WDT_CategoryPalletSlot.WDT_CategoryPalletSlot_C.SetTexture
// 0x0010 (0x0010 - 0x0000)
struct WDT_CategoryPalletSlot_C_SetTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_CategoryPalletSlot_C_SetTexture;

// Function WDT_CategoryPalletSlot.WDT_CategoryPalletSlot_C.SetSubTexture
// 0x0018 (0x0018 - 0x0000)
struct WDT_CategoryPalletSlot_C_SetSubTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_CategoryPalletSlot_C_SetSubTexture;

// Function WDT_CategoryPalletSlot.WDT_CategoryPalletSlot_C.SetSubLazyTexture
// 0x0038 (0x0038 - 0x0000)
struct WDT_CategoryPalletSlot_C_SetSubLazyTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              LazyTexture;                                       // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_CategoryPalletSlot_C_SetSubLazyTexture;

// Function WDT_CategoryPalletSlot.WDT_CategoryPalletSlot_C.SetLazyTexture
// 0x0030 (0x0030 - 0x0000)
struct WDT_CategoryPalletSlot_C_SetLazyTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              LazyTexture;                                       // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_CategoryPalletSlot_C_SetLazyTexture;

// Function WDT_CategoryPalletSlot.WDT_CategoryPalletSlot_C.Select
// 0x0010 (0x0010 - 0x0000)
struct WDT_CategoryPalletSlot_C_Select final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_CategoryPalletSlot_C_Select;

// Function WDT_CategoryPalletSlot.WDT_CategoryPalletSlot_C.OnMouseCursor
// 0x0005 (0x0005 - 0x0000)
struct WDT_CategoryPalletSlot_C_OnMouseCursor final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_CategoryPalletSlot_C_OnMouseCursor;

// Function WDT_CategoryPalletSlot.WDT_CategoryPalletSlot_C.FlipTexture
// 0x0002 (0x0002 - 0x0000)
struct WDT_CategoryPalletSlot_C_FlipTexture final
{
public:
	bool                                          IsInverse;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_CategoryPalletSlot_C_FlipTexture;

// Function WDT_CategoryPalletSlot.WDT_CategoryPalletSlot_C.Deselect
// 0x0010 (0x0010 - 0x0000)
struct WDT_CategoryPalletSlot_C_Deselect final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_CategoryPalletSlot_C_Deselect;

// Function WDT_CategoryPalletSlot.WDT_CategoryPalletSlot_C.ClearTexture
// 0x0001 (0x0001 - 0x0000)
struct WDT_CategoryPalletSlot_C_ClearTexture final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_CategoryPalletSlot_C_ClearTexture;

// Function WDT_CategoryPalletSlot.WDT_CategoryPalletSlot_C.ClearSubTexture
// 0x000C (0x000C - 0x0000)
struct WDT_CategoryPalletSlot_C_ClearSubTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_CategoryPalletSlot_C_ClearSubTexture;

}

