#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_StatusSummary_Defence

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WDT_StatusSummary_Defence.WDT_StatusSummary_Defence_C.SetBloodDiff
// 0x0028 (0x0028 - 0x0000)
struct WDT_StatusSummary_Defence_C_SetBloodDiff final
{
public:
	double                                        InBloodCurrent;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InBlood;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_CompareFloat_CompareResult;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor;    // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WDT_StatusSummary_Defence_C_SetBloodDiff;

// Function WDT_StatusSummary_Defence.WDT_StatusSummary_Defence_C.SetCrushDiff
// 0x0028 (0x0028 - 0x0000)
struct WDT_StatusSummary_Defence_C_SetCrushDiff final
{
public:
	double                                        InCrushCurrent;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InCrush;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_CompareFloat_CompareResult;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor;    // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WDT_StatusSummary_Defence_C_SetCrushDiff;

// Function WDT_StatusSummary_Defence.WDT_StatusSummary_Defence_C.SetDefence
// 0x0150 (0x0150 - 0x0000)
struct WDT_StatusSummary_Defence_C_SetDefence final
{
public:
	double                                        InSunder;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InCrush;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InPierce;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InBlood;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InFire;                                            // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InIce;                                             // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InThunder;                                         // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor;    // 0x0038(0x0014)()
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0050(0x0010)()
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor_1;  // 0x0060(0x0014)()
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0078(0x0010)()
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor_2;  // 0x0088(0x0014)()
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_2;          // 0x00A0(0x0010)()
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor_3;  // 0x00B0(0x0014)()
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_3;          // 0x00C8(0x0010)()
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor_4;  // 0x00D8(0x0014)()
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_4;          // 0x00F0(0x0010)()
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor_5;  // 0x0100(0x0014)()
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_5;          // 0x0118(0x0010)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_6;          // 0x0128(0x0010)()
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor_6;  // 0x0138(0x0014)()
};
DUMPER7_ASSERTS_WDT_StatusSummary_Defence_C_SetDefence;

// Function WDT_StatusSummary_Defence.WDT_StatusSummary_Defence_C.SetFireDiff
// 0x0028 (0x0028 - 0x0000)
struct WDT_StatusSummary_Defence_C_SetFireDiff final
{
public:
	double                                        InFireCurrent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InFire;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_CompareFloat_CompareResult;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor;    // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WDT_StatusSummary_Defence_C_SetFireDiff;

// Function WDT_StatusSummary_Defence.WDT_StatusSummary_Defence_C.SetIceDiff
// 0x0028 (0x0028 - 0x0000)
struct WDT_StatusSummary_Defence_C_SetIceDiff final
{
public:
	double                                        InIceCurrent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InIce;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_CompareFloat_CompareResult;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor;    // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WDT_StatusSummary_Defence_C_SetIceDiff;

// Function WDT_StatusSummary_Defence.WDT_StatusSummary_Defence_C.SetPierceDiff
// 0x0028 (0x0028 - 0x0000)
struct WDT_StatusSummary_Defence_C_SetPierceDiff final
{
public:
	double                                        InPierceCurrent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InPierce;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_CompareFloat_CompareResult;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor;    // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WDT_StatusSummary_Defence_C_SetPierceDiff;

// Function WDT_StatusSummary_Defence.WDT_StatusSummary_Defence_C.SetSunderDiff
// 0x0028 (0x0028 - 0x0000)
struct WDT_StatusSummary_Defence_C_SetSunderDiff final
{
public:
	double                                        InSunderCurrent;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InSunder;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_CompareFloat_CompareResult;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor;    // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WDT_StatusSummary_Defence_C_SetSunderDiff;

// Function WDT_StatusSummary_Defence.WDT_StatusSummary_Defence_C.SetThunderDiff
// 0x0028 (0x0028 - 0x0000)
struct WDT_StatusSummary_Defence_C_SetThunderDiff final
{
public:
	double                                        InThunderCurrent;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InThunder;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_CompareFloat_CompareResult;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor;    // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WDT_StatusSummary_Defence_C_SetThunderDiff;

}

