#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ActionInputTrgGuide

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ActionInputTrgGuide.WDT_ActionInputTrgGuide_C
// 0x01E8 (0x07B0 - 0x05C8)
class UWDT_ActionInputTrgGuide_C final : public UActionInputTrgGuideBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URichTextBlock*                         PulsText_Horizontal;                               // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         PulsText_Vertical;                                 // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TrgImage1_Horizontal;                              // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TrgImage1_Vertical;                                // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TrgImage2;                                         // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FInputActionTag                        InputActionTag;                                    // 0x05F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHorizontal;                                     // 0x0600(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUsePuls;                                          // 0x0601(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsAutoUpdateIcon;                                 // 0x0602(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_603[0x5];                                      // 0x0603(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ImageSize;                                         // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   HideKey;                                           // 0x0610(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<struct FKey, class UTexture2D*>          ConvertKeyboardLayoutTextureMap_AZERTY;            // 0x0628(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TMap<struct FKey, class UTexture2D*>          ConvertKeyboardLayoutTextureMap_QWERTZ;            // 0x0678(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	uint8                                         Pad_6C8[0x8];                                      // 0x06C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            KeyBrush;                                          // 0x06D0(0x00D0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             AltGrTexture;                                      // 0x07A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTrgImage(TArray<struct FKey>& InKeys);
	void UpdateInputActionTrgImage();
	void SetKeys(TArray<struct FKey>& InKeys);
	void SetHideKey(const struct FKey& InHideKey);
	void SetBrushImageSize(const struct FVector2D& InSize);
	void SetAllIconImageBrushTintColor(const struct FSlateColor& InTintColor);
	void RefreshKeyImage();
	void PreConstruct(bool IsDesignTime);
	void OnUpdateKeyAssign();
	void InitializeTag(const struct FInputActionTag& InInputActionTag);
	void GetAssignKey(TArray<struct FKey>* OutAssignKey);
	void ExecuteUbergraph_WDT_ActionInputTrgGuide(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ActionInputTrgGuide_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ActionInputTrgGuide_C")
	}
	static class UWDT_ActionInputTrgGuide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ActionInputTrgGuide_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ActionInputTrgGuide_C;

}

