#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_YadorigiListEntryPiece

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function WDT_YadorigiListEntryPiece.WDT_YadorigiListEntryPiece_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_YadorigiListEntryPiece_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_YadorigiListEntryPiece_C_BP_OnItemExpansionChanged;

// Function WDT_YadorigiListEntryPiece.WDT_YadorigiListEntryPiece_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_YadorigiListEntryPiece_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_YadorigiListEntryPiece_C_BP_OnItemSelectionChanged;

// Function WDT_YadorigiListEntryPiece.WDT_YadorigiListEntryPiece_C.Deselect
// 0x0002 (0x0002 - 0x0000)
struct WDT_YadorigiListEntryPiece_C_Deselect final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_YadorigiListEntryPiece_C_Deselect;

// Function WDT_YadorigiListEntryPiece.WDT_YadorigiListEntryPiece_C.ExecuteUbergraph_WDT_YadorigiListEntryPiece
// 0x0078 (0x0078 - 0x0000)
struct WDT_YadorigiListEntryPiece_C_ExecuteUbergraph_WDT_YadorigiListEntryPiece final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Deselect_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_YadorigiListEntryPiece_C*          K2Node_DynamicCast_AsWDT_Yadorigi_List_Entry_Piece; // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFastTravelFeature                     CallFunc_GetFastTravelFeatureInfo_OutFeatureInfo;  // 0x0028(0x0030)()
	bool                                          CallFunc_Select_ReturnValue;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Deselect_ReturnValue_1;                   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapSystem*                             CallFunc_GetMapSystem_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_MapSystem_C*                        K2Node_DynamicCast_AsBP_Map_System;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_YadorigiListEntryPiece_C_ExecuteUbergraph_WDT_YadorigiListEntryPiece;

// Function WDT_YadorigiListEntryPiece.WDT_YadorigiListEntryPiece_C.GetFastTravelFeatureInfo
// 0x0030 (0x0030 - 0x0000)
struct WDT_YadorigiListEntryPiece_C_GetFastTravelFeatureInfo final
{
public:
	struct FFastTravelFeature                     OutFeatureInfo;                                    // 0x0000(0x0030)(Parm, OutParm)
};
DUMPER7_ASSERTS_WDT_YadorigiListEntryPiece_C_GetFastTravelFeatureInfo;

// Function WDT_YadorigiListEntryPiece.WDT_YadorigiListEntryPiece_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WDT_YadorigiListEntryPiece_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x00F8(0x00B8)()
};
DUMPER7_ASSERTS_WDT_YadorigiListEntryPiece_C_OnFocusReceived;

// Function WDT_YadorigiListEntryPiece.WDT_YadorigiListEntryPiece_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WDT_YadorigiListEntryPiece_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_YadorigiListEntryPiece_C_OnListItemObjectSet;

// Function WDT_YadorigiListEntryPiece.WDT_YadorigiListEntryPiece_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_YadorigiListEntryPiece_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_YadorigiListEntryPiece_C_PreConstruct;

// Function WDT_YadorigiListEntryPiece.WDT_YadorigiListEntryPiece_C.Select
// 0x0002 (0x0002 - 0x0000)
struct WDT_YadorigiListEntryPiece_C_Select final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_YadorigiListEntryPiece_C_Select;

// Function WDT_YadorigiListEntryPiece.WDT_YadorigiListEntryPiece_C.Set Fast Travel Feature Info
// 0x0120 (0x0120 - 0x0000)
struct WDT_YadorigiListEntryPiece_C_Set_Fast_Travel_Feature_Info final
{
public:
	class ABP_MapSystem_C*                        InMapSystem;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FFastTravelFeature                     InFeatureInfo;                                     // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FMapFeatureInfo                        CallFunc_GetMapFeatureInfoFromMap_OutFeatureInfo;  // 0x0038(0x00E0)()
	bool                                          CallFunc_GetMapFeatureInfoFromMap_ReturnValue;     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_YadorigiListEntryPiece_C_Set_Fast_Travel_Feature_Info;

}

