#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_TitleMenu_Variationable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "BasicUI_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_TitleMenu_Variationable.WDT_TitleMenu_Variationable_C
// 0x03C8 (0x0980 - 0x05B8)
class UWDT_TitleMenu_Variationable_C final : public UAppMenuBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ZenonCursor;                                       // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TitleMenuOpen1shotAnim;                            // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       InTitleMenuAnim;                                   // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PressAnyButtonAnim;                                // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CloseTitleMenuAnimation;                           // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       BlinkingPressAnyButtonAnimation;                   // 0x05E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             AccountName;                                       // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ApplicationVersionText;                            // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BGRoot;                                            // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Black;                                             // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CODEVEINII;                                        // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ContinueEmphasis;                                  // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       HelpText;                                          // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_356;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_AspectRatio;                               // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PressAnyButton;                                    // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PressAnyButtonText;                                // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       TitleLogoImage;                                    // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TitleMenu;                                         // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           TitleMenuCanvas;                                   // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TitleMenuEntryBox;                                 // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_TitleMenuEntryPiece_C*             TitleMenuEntryContinue;                            // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_TitleMenuEntryPiece_C*             TitleMenuEntryLoadGame;                            // 0x0670(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_TitleMenuEntryPiece_C*             TitleMenuEntryLoadGame_LouRescue;                  // 0x0678(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_TitleMenuEntryPiece_C*             TitleMenuEntryNewGame;                             // 0x0680(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_TitleMenuEntryPiece_C*             TitleMenuEntryNewGame_LouRescue;                   // 0x0688(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_TitleMenuEntryPiece_C*             TitleMenuEntryQuitGame;                            // 0x0690(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_TitleMenuUIObject_C*                BP_TitleMenuUIObject;                              // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UWDT_TitleMenuEntryPiece_C*>     TitleMenuList;                                     // 0x06A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FMenuContext                           OKDialogContext;                                   // 0x06B0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TMap<ETitleProgressType, TSoftClassPtr<class UClass>> BGMap;                                     // 0x06E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, class FText>                HelpTextMap;                                       // 0x0738(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   NetworkErrorTitleText;                             // 0x0788(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   NetworkErrorText;                                  // 0x0798(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateFontInfo                         DefaultFont;                                       // 0x07A8(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   NoEmptySlotText;                                   // 0x0808(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<ETitleProgressType, class UAkAudioEvent*> BGMMap;                                           // 0x0818(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         PlayingBGMID;                                      // 0x0868(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_86C[0x4];                                      // 0x086C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuContext                           WarningDialogContext;                              // 0x0870(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FText                                   WarningDialogText;                                 // 0x08A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsFromConsent;                                     // 0x08B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFromBack;                                        // 0x08B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8BA[0x6];                                      // 0x08BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuContext                           ShowShopYesNoDialogContext;                        // 0x08C0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           ShowStoreUIFailedDialog;                           // 0x08F8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          ShowStoreUIResult;                                 // 0x0930(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_931[0x7];                                      // 0x0931(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ShowStoreUIFailedText;                             // 0x0938(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FMenuContext                           ErrorDialog;                                       // 0x0948(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void DecideMenu(class FName LastSelectedMenuName);
	void ExecuteUbergraph_WDT_TitleMenu_Variationable(int32 EntryPoint);
	void GetMenuPieceByName(class FName Name_0, class UWDT_TitleMenuEntryPiece_C** Array_Element);
	void InpActEvt_IA_UI_AnyKey_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Cancel_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Decide_K2Node_EnhancedInputActionEvent_4(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Down_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Up_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void IsIgnoreInput(bool* Ignored);
	void On_Pressed_Any_Key(bool bPlayAnimation);
	void On_Quit_Game();
	void OnAnyKey();
	void OnBrightnessSettingClosed();
	void OnCancelPressed();
	void OnChangeInitialSettingsStep();
	void OnChangeTitleProgress(ETitleProgressType Progress);
	void OnCheckNetworkAvailable(bool Result);
	void OnClosed();
	void OnClosedErrorDialog();
	void OnClosedNetworkConnectionErrorDialog();
	void OnClosedNewGameErrorDialog();
	void OnClosedWarningDialog();
	void OnConfig();
	void OnConsentSectionClosed(bool InIsDecide);
	void OnContinue();
	void OnDecidePressed();
	void OnDecideStoreOpenDialog(uint8 DecideOptionNumber);
	void OnDLCGuideDialogClosed();
	void OnDownPressed();
	class UWidgetAnimation* OnGetCloseAnimation();
	class UWidgetAnimation* OnGetOpenAnimation();
	void OnLicenseDisplay();
	void OnLoaded_EBBF5C074734D80FC8EB7495CA8B515E(TSubclassOf<class UObject> Loaded);
	void OnLoaded_EBBF5C074734D80FC8EB7495DF14165B(TSubclassOf<class UObject> Loaded);
	void OnLoadGame();
	void OnLoadGameLouRescue();
	void OnMatchingRegionSekectClosed();
	void OnMenuInitialized();
	void OnMouseEnterMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseEnterPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeftClickMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnNewGameLouRescue();
	void OnOnline();
	void OnOpen();
	void OnOpened();
	void OnShopOpenDialogClosed();
	void OnShowShopUIFailedDialogClosed();
	void OnStartNewGame();
	void OnStore();
	void OnTutorial();
	void OnUpPressed();
	void OpenInvalidSlotErrorDialog(EUISaveDataStatus InSlotStatus);
	void OpenNotEnoughDLCErrorDialog(TArray<EDLCType>& NotEnoughDLCs);
	void OpenWarningDialog();
	void ShowConsentSection(const struct FConfigurationConsentTypeTags& InTag);
	void ShowDLCGuideDialog();
	void ShowGameSettingSectionBrightness();
	void ShowNetworkSectionSelectionRegion();
	void ShowTitleMenu(bool PlayAnimation_0);
	void Update_Menu_Available();
	void UpdateHelpText();
	void WidgetAnimationEvt_InTitleMenuAnim_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_PressAnyButtonAnim_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_TitleMenuOpen1shotAnim_K2Node_WidgetAnimationEvent_2();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_TitleMenu_Variationable_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_TitleMenu_Variationable_C")
	}
	static class UWDT_TitleMenu_Variationable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_TitleMenu_Variationable_C>();
	}
};
DUMPER7_ASSERTS_UWDT_TitleMenu_Variationable_C;

}

