#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Status_DefenceByGuard

#include "Basic.hpp"

#include "WDT_Status_PieceBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_Status_DefenceByGuard.WDT_Status_DefenceByGuard_C
// 0x0070 (0x0738 - 0x06C8)
class UWDT_Status_DefenceByGuard_C final : public UWDT_Status_PieceBase_C
{
public:
	class UWDT_ArticleDiffArrowElement_C*         Arrow_SummaryBloodDefenceByGuard;                  // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_SummaryCrushDefence;                         // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_SummaryFireDefenceByGuard;                   // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_SummaryIceDefenceByGuard;                    // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_SummaryPierceDefenceByGuard;                 // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_SummarySunderDefenceByGuard;                 // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_SummaryThunderDefenceByGuard;                // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SummaryBloodDefenceByGuard;                        // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SummaryCrushDefenceByGuard;                        // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SummaryFireDefenceByGuard;                         // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SummaryIceDefenceByGuard;                          // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SummaryPierceDefenceByGuard;                       // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SummarySunderDefenceByGuard;                       // 0x0728(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SummaryThunderDefenceByGuard;                      // 0x0730(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetBloodDiff(double InBloodCurrent, double InBlood);
	void SetCrushDiff(double InCrushCurrent, double InCrush);
	void SetDefence(double InSunder, double InCrush, double InPierce, double InBlood, double InFire, double InIce, double InThunder);
	void SetFireDiff(double InFireCurrent, double InFire);
	void SetIceDiff(double InIceCurrent, double InIce);
	void SetPierceDiff(double InPierceCurrent, double InPierce);
	void SetSunderDiff(double InSunderCurrent, double InSunder);
	void SetThunderDiff(double InThunderCurrent, double InThunder);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_Status_DefenceByGuard_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_Status_DefenceByGuard_C")
	}
	static class UWDT_Status_DefenceByGuard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_Status_DefenceByGuard_C>();
	}
};
DUMPER7_ASSERTS_UWDT_Status_DefenceByGuard_C;

}

