#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_WeaponGadgetPiece

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "BasicUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_WeaponGadgetPiece.WDT_WeaponGadgetPiece_C
// 0x0058 (0x0620 - 0x05C8)
class UWDT_WeaponGadgetPiece_C final : public UMenuPieceBase
{
public:
	class UCommonLazyImage*                       CommonLazyImage;                                   // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       CommonLazyImage_Shadow;                            // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Empty;                                             // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GadgeLoad_Conductivity;                            // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GadgeLoad_Efficiency;                              // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GadgeLoad_Handling;                                // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GadgeLoad_Reliability;                             // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                SelectionFilter;                                   // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_161;                                     // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EUIWeaponGadgetSlot                           GadgetSlot;                                        // 0x0618(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool SetTexture(class UTexture2D* Texture);
	bool SetSubTexture(class FName ImageId, class UTexture2D* Texture);
	bool SetSubLazyTexture(class FName ImageId, const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	bool SetLazyTexture(const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	void SetGadgetParam(const struct FUIWeaponGadgetInfo& GadgetInfo, bool IsValid);
	bool Select(bool PlayAnimation_0);
	bool FlipTexture(bool IsInverse);
	bool Deselect(bool PlayAnimation_0);
	bool ClearTexture();
	bool ClearSubTexture(class FName ImageId);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_WeaponGadgetPiece_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_WeaponGadgetPiece_C")
	}
	static class UWDT_WeaponGadgetPiece_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_WeaponGadgetPiece_C>();
	}
};
DUMPER7_ASSERTS_UWDT_WeaponGadgetPiece_C;

}

