#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigMenuSwitchPiece

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WDT_ConfigPieceBase_classes.hpp"
#include "Extensions_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ConfigMenuSwitchPiece.WDT_ConfigMenuSwitchPiece_C
// 0x0068 (0x06A0 - 0x0638)
class UWDT_ConfigMenuSwitchPiece_C final : public UWDT_ConfigPieceBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WDT_ConfigMenuSwitchPiece_C;        // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWDT_ConfigSwitchPiece_C*               WDT_ConfigSwitchPice;                              // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigTextElement_C*               WDT_ConfigTextElement;                             // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_LeftArrowPiece_C*                  WDT_LeftArrowPiece;                                // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_RightArrowPiece_C*                 WDT_RightArrowPiece;                               // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bDefaultOnOff;                                     // 0x0660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UTexture2D>>      ImageTexture;                                      // 0x0668(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         MoviePath;                                         // 0x0678(0x0010)(Edit, BlueprintVisible)
	EPhotoModeBoolParameter                       PhotoModeBoolParamType;                            // 0x0688(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_689[0x3];                                      // 0x0689(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           DisableColor;                                      // 0x068C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OldOnOff;                                          // 0x069C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTextStyle();
	void SetIsEditable(bool InFlag);
	void SetDefaultOnOff(bool InInitializeValue, bool InDefaultValue);
	void Set_on_Off(bool IsOn);
	bool Select(bool PlayAnimation_0);
	void PreConstruct(bool IsDesignTime);
	void OnRightPressed(bool bInIsPressStarted);
	void OnMouseLeftClickSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeaveSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseEnterSubPiece(class UMenuPieceBase* MenuPiece);
	void OnLeftPressed(bool bInIsPressStarted);
	void OnDecideReleased();
	void InitializeToDefaultValue();
	void GetPhotoModeBoolParameterType(EPhotoModeBoolParameter* OutType);
	void GetLogTexture(TSoftObjectPtr<class UTexture2D>* OutTexture, bool* OutIsSuccess);
	void GetLogMoviePath(class FString* OutPath, bool* OutIsSuccess);
	void GetIsOn(bool* IsOn);
	void GetDefaultValue(bool* IsOn);
	void ExecuteUbergraph_WDT_ConfigMenuSwitchPiece(int32 EntryPoint);
	bool Deselect(bool PlayAnimation_0);
	void ChangeTextStyle(bool bIsChange);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ConfigMenuSwitchPiece_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ConfigMenuSwitchPiece_C")
	}
	static class UWDT_ConfigMenuSwitchPiece_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ConfigMenuSwitchPiece_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ConfigMenuSwitchPiece_C;

}

