#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Status_Health

#include "Basic.hpp"

#include "WDT_Status_PieceBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_Status_Health.WDT_Status_Health_C
// 0x0028 (0x06F0 - 0x06C8)
class UWDT_Status_Health_C final : public UWDT_Status_PieceBase_C
{
public:
	class UCommonTextBlock*                       CommonText_BuddyPoint;                             // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_BuddyPointMax;                          // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_HP;                                     // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_MaxHP;                                  // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_SlashHP;                                // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Set_HP(double InCurrentHP, double InMaxHP);
	void SetLP(int32 InCurrentLP, int32 InMaxLP);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_Status_Health_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_Status_Health_C")
	}
	static class UWDT_Status_Health_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_Status_Health_C>();
	}
};
DUMPER7_ASSERTS_UWDT_Status_Health_C;

}

