#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_DescriptionTitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_DescriptionTitle.WDT_DescriptionTitle_C
// 0x0028 (0x05F0 - 0x05C8)
class UWDT_DescriptionTitle_C final : public UMenuPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                DescriptionSelectionFilter;                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DescriptionTitleText;                              // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DescriptionTitleText_1;                            // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_86;                                          // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	bool SetTexts(const TArray<class FText>& LocalTexts);
	bool SetText(const class FText& LocalText);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void GetTexts(TArray<class FText>* LocalTexts);
	void GetText(class FText* LocalText);
	void ExecuteUbergraph_WDT_DescriptionTitle(int32 EntryPoint);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_DescriptionTitle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_DescriptionTitle_C")
	}
	static class UWDT_DescriptionTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_DescriptionTitle_C>();
	}
};
DUMPER7_ASSERTS_UWDT_DescriptionTitle_C;

}

