#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_SimplifiedArticleInfo

#include "Basic.hpp"

#include "BasicUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_SimplifiedArticleInfo.WDT_SimplifiedArticleInfo_C
// 0x0040 (0x0608 - 0x05C8)
class UWDT_SimplifiedArticleInfo_C final : public UMenuPieceBase
{
public:
	class UTextBlock*                             ArticleName;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       EnchantIcon;                                       // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Article;                                      // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_alterate;                                    // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemEnchantText;                                   // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemLevelText;                                     // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_143;                                 // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_1;                                  // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void EnhanceInfo(int32 EnhanceLevel, TSoftObjectPtr<class UTexture2D> EnchantIcon_0, const struct FGameplayTag& EnchantTag);
	void IsEmpty(bool* NewParam);
	void SetArticleInfo(const struct FUIArticleInfo& ArticleInfo, int32 EnhancementLevel, TSoftObjectPtr<class UTexture2D> EnchantLcon, const struct FGameplayTag& InEnchantTag);
	void SetEmpty();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_SimplifiedArticleInfo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_SimplifiedArticleInfo_C")
	}
	static class UWDT_SimplifiedArticleInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_SimplifiedArticleInfo_C>();
	}
};
DUMPER7_ASSERTS_UWDT_SimplifiedArticleInfo_C;

}

