#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ListTextPiece

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.Uncheck
// 0x0002 (0x0002 - 0x0000)
struct WDT_ListTextPiece_C_Uncheck final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_Uncheck;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.SetTexture
// 0x0010 (0x0010 - 0x0000)
struct WDT_ListTextPiece_C_SetTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_SetTexture;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.SetTexts
// 0x0018 (0x0018 - 0x0000)
struct WDT_ListTextPiece_C_SetTexts final
{
public:
	TArray<class FText>                           LocalTexts;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_SetTexts;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.SetTextFunction
// 0x0018 (0x0018 - 0x0000)
struct WDT_ListTextPiece_C_SetTextFunction final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_SetTextFunction;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WDT_ListTextPiece_C_SetText final
{
public:
	class FText                                   LocalText;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetTextFunction_ReturnValue;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_SetText;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.SetSubTexture
// 0x0018 (0x0018 - 0x0000)
struct WDT_ListTextPiece_C_SetSubTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_SetSubTexture;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.SetSubLazyTexture
// 0x0038 (0x0038 - 0x0000)
struct WDT_ListTextPiece_C_SetSubLazyTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              LazyTexture;                                       // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_SetSubLazyTexture;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.SetLazyTexture
// 0x0030 (0x0030 - 0x0000)
struct WDT_ListTextPiece_C_SetLazyTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              LazyTexture;                                       // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_SetLazyTexture;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.Select
// 0x0002 (0x0002 - 0x0000)
struct WDT_ListTextPiece_C_Select final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_Select;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_ListTextPiece_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_PreConstruct;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WDT_ListTextPiece_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_OnListItemObjectSet;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.IsChecked
// 0x0001 (0x0001 - 0x0000)
struct WDT_ListTextPiece_C_IsChecked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_IsChecked;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.GetTexts
// 0x0010 (0x0010 - 0x0000)
struct WDT_ListTextPiece_C_GetTexts final
{
public:
	TArray<class FText>                           LocalTexts;                                        // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_GetTexts;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.GetText
// 0x0010 (0x0010 - 0x0000)
struct WDT_ListTextPiece_C_GetText final
{
public:
	class FText                                   LocalText;                                         // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_GetText;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.FlipTexture
// 0x0002 (0x0002 - 0x0000)
struct WDT_ListTextPiece_C_FlipTexture final
{
public:
	bool                                          IsInverse;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_FlipTexture;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.ExecuteUbergraph_WDT_ListTextPiece
// 0x0018 (0x0018 - 0x0000)
struct WDT_ListTextPiece_C_ExecuteUbergraph_WDT_ListTextPiece final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Select_ReturnValue;                       // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Deselect_ReturnValue;                     // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_ExecuteUbergraph_WDT_ListTextPiece;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.Deselect
// 0x0002 (0x0002 - 0x0000)
struct WDT_ListTextPiece_C_Deselect final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_Deselect;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.ClearTexture
// 0x0001 (0x0001 - 0x0000)
struct WDT_ListTextPiece_C_ClearTexture final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_ClearTexture;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.ClearSubTexture
// 0x000C (0x000C - 0x0000)
struct WDT_ListTextPiece_C_ClearSubTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_ClearSubTexture;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.Check
// 0x0003 (0x0003 - 0x0000)
struct WDT_ListTextPiece_C_Check final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AnotherAppearance;                                 // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_Check;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_ListTextPiece_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_BP_OnItemSelectionChanged;

// Function WDT_ListTextPiece.WDT_ListTextPiece_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_ListTextPiece_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ListTextPiece_C_BP_OnItemExpansionChanged;

}

