#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigHeader

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.TabNext
// 0x0003 (0x0003 - 0x0000)
struct WDT_ConfigHeader_C_TabNext final
{
public:
	bool                                          bInCanWarp;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutIsChangeIndex;                                  // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Next_bOutIsChangeIndex;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_TabNext;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.TabBack
// 0x0003 (0x0003 - 0x0000)
struct WDT_ConfigHeader_C_TabBack final
{
public:
	bool                                          bInCanWarp;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutIsChangeIndex;                                  // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Back_bOutIsChangeIndex;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_TabBack;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.SetTitleText
// 0x0010 (0x0010 - 0x0000)
struct WDT_ConfigHeader_C_SetTitleText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_SetTitleText;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.SetTabVisibility
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigHeader_C_SetTabVisibility final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_SetTabVisibility;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.SetLanguageIconTextVisibility
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigHeader_C_SetLanguageIconTextVisibility final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_SetLanguageIconTextVisibility;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.SetIsInitializeClicked
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigHeader_C_SetIsInitializeClicked final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_SetIsInitializeClicked;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.SetIsBackClicked
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigHeader_C_SetIsBackClicked final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_SetIsBackClicked;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.SetInitializeIconTextVisibility
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigHeader_C_SetInitializeIconTextVisibility final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_SetInitializeIconTextVisibility;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.SetBackText
// 0x0010 (0x0010 - 0x0000)
struct WDT_ConfigHeader_C_SetBackText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_SetBackText;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.SetBackIconTextVisibility
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigHeader_C_SetBackIconTextVisibility final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_SetBackIconTextVisibility;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigHeader_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_PreConstruct;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.OnMouseLeftClickSubPiece
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigHeader_C_OnMouseLeftClickSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_OnMouseLeftClickSubPiece;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.OnMouseLeaveSubPiece
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigHeader_C_OnMouseLeaveSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_OnMouseLeaveSubPiece;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.OnMouseEnterSubPiece
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigHeader_C_OnMouseEnterSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_OnMouseEnterSubPiece;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.GetTabIndex
// 0x0004 (0x0004 - 0x0000)
struct WDT_ConfigHeader_C_GetTabIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_GetTabIndex;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.GetIsInitializeClicked
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigHeader_C_GetIsInitializeClicked final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_GetIsInitializeClicked;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.GetIsBackClicked
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigHeader_C_GetIsBackClicked final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_GetIsBackClicked;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.ExecuteUbergraph_WDT_ConfigHeader
// 0x0060 (0x0060 - 0x0000)
struct WDT_ConfigHeader_C_ExecuteUbergraph_WDT_ConfigHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuPieceBase*                         K2Node_Event_MenuPiece_2;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_ConfigIconTextPiece_C*             K2Node_DynamicCast_AsWDT_Config_Icon_Text_Piece;   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_TabIndex;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuPieceBase*                         K2Node_Event_MenuPiece_1;                          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISelectableInterface>  CallFunc_Deselect_self_CastInput;                  // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Deselect_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuPieceBase*                         K2Node_Event_MenuPiece;                            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISelectableInterface>  CallFunc_Select_self_CastInput;                    // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Select_ReturnValue;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_ExecuteUbergraph_WDT_ConfigHeader;

// Function WDT_ConfigHeader.WDT_ConfigHeader_C.BndEvt__WDT_ConfigHeader_WDT_ConfigTab_K2Node_ComponentBoundEvent_0_OnTabItemClickedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WDT_ConfigHeader_C_BndEvt__WDT_ConfigHeader_WDT_ConfigTab_K2Node_ComponentBoundEvent_0_OnTabItemClickedEvent__DelegateSignature final
{
public:
	int32                                         TabIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigHeader_C_BndEvt__WDT_ConfigHeader_WDT_ConfigTab_K2Node_ComponentBoundEvent_0_OnTabItemClickedEvent__DelegateSignature;

}

