#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_SaveDataSelectTrgGuide

#include "Basic.hpp"

#include "BasicUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_SaveDataSelectTrgGuide.WDT_SaveDataSelectTrgGuide_C
// 0x0030 (0x04F0 - 0x04C0)
class UWDT_SaveDataSelectTrgGuide_C final : public UUIElementBase
{
public:
	class UWDT_ConfigIconTextPiece_C*             TrgGuide_Delete;                                   // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigIconTextPiece_C*             TrgGuide_History;                                  // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigIconTextPiece_C*             TrgGuide_Select;                                   // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_Piece_TrgText_C*                   WDT_Piece_TrgText;                                 // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MI_InitializeHoldGauge;                            // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MI_InitializeAllOnlyHoldGauge;                     // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void SetVisibilityHistoryGuide(ESlateVisibility InVisibility);
	void RefreshKeyImage();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_SaveDataSelectTrgGuide_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_SaveDataSelectTrgGuide_C")
	}
	static class UWDT_SaveDataSelectTrgGuide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_SaveDataSelectTrgGuide_C>();
	}
};
DUMPER7_ASSERTS_UWDT_SaveDataSelectTrgGuide_C;

}

