#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Status_Fraction

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_Status_Fraction.WDT_Status_Fraction_C.ExecuteUbergraph_WDT_Status_Fraction
// 0x0008 (0x0008 - 0x0000)
struct WDT_Status_Fraction_C_ExecuteUbergraph_WDT_Status_Fraction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Status_Fraction_C_ExecuteUbergraph_WDT_Status_Fraction;

// Function WDT_Status_Fraction.WDT_Status_Fraction_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_Status_Fraction_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Status_Fraction_C_PreConstruct;

// Function WDT_Status_Fraction.WDT_Status_Fraction_C.SetValueFloat
// 0x0058 (0x0058 - 0x0000)
struct WDT_Status_Fraction_C_SetValueFloat final
{
public:
	double                                        InIchor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InMaxIchor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x0010(0x0010)()
	double                                        CallFunc_MakeLiteralDouble_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x0048(0x0010)()
};
DUMPER7_ASSERTS_WDT_Status_Fraction_C_SetValueFloat;

// Function WDT_Status_Fraction.WDT_Status_Fraction_C.SetValueFloatComparison
// 0x0018 (0x0018 - 0x0000)
struct WDT_Status_Fraction_C_SetValueFloatComparison final
{
public:
	double                                        InMaxIchorCurrent;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InMaxIchor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Status_Fraction_C_SetValueFloatComparison;

// Function WDT_Status_Fraction.WDT_Status_Fraction_C.SetValueInt
// 0x0028 (0x0028 - 0x0000)
struct WDT_Status_Fraction_C_SetValueInt final
{
public:
	int32                                         InStamina;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxStamina;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0018(0x0010)()
};
DUMPER7_ASSERTS_WDT_Status_Fraction_C_SetValueInt;

// Function WDT_Status_Fraction.WDT_Status_Fraction_C.SetValueIntComparison
// 0x0008 (0x0008 - 0x0000)
struct WDT_Status_Fraction_C_SetValueIntComparison final
{
public:
	int32                                         InMaxStaminaCurrent;                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxStamina;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Status_Fraction_C_SetValueIntComparison;

}

