#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_MapFeatureSymbol

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_MapFeatureSymbol.WDT_MapFeatureSymbol_C
// 0x0030 (0x05F8 - 0x05C8)
class UWDT_MapFeatureSymbol_C : public UMenuPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Prohibited;                                        // 0x05D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0x3];                                      // 0x05D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           DefaultPinColor;                                   // 0x05D4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GrayOutPinColor;                                   // 0x05E4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool SetTexture(class UTexture2D* Texture);
	bool SetSubTexture(class FName ImageId, class UTexture2D* Texture);
	bool SetSubLazyTexture(class FName ImageId, const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	void SetQuestIconVisibility(bool InIsVisible);
	void SetProhibited(bool InProhibited);
	bool SetLazyTexture(const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	void SetGrayOut(bool InIsGrayOut);
	void IsProhibited(bool* OutProhibited);
	void GetWidth(double* OutWidth);
	void GetHeight(double* OutHeight);
	bool FlipTexture(bool IsInverse);
	void ExecuteUbergraph_WDT_MapFeatureSymbol(int32 EntryPoint);
	void Construct();
	bool ClearTexture();
	bool ClearSubTexture(class FName ImageId);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_MapFeatureSymbol_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_MapFeatureSymbol_C")
	}
	static class UWDT_MapFeatureSymbol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_MapFeatureSymbol_C>();
	}
};
DUMPER7_ASSERTS_UWDT_MapFeatureSymbol_C;

}

