#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigKeyDisplayPiece

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WDT_ConfigKeyDisplayPiece.WDT_ConfigKeyDisplayPiece_C.SetKeyText
// 0x0028 (0x0028 - 0x0000)
struct WDT_ConfigKeyDisplayPiece_C_SetKeyText final
{
public:
	TArray<struct FKey>                           InKeys;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 KeyLabels;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigKeyDisplayPiece_C_SetKeyText;

// Function WDT_ConfigKeyDisplayPiece.WDT_ConfigKeyDisplayPiece_C.SetDuplicationIconVisibility
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigKeyDisplayPiece_C_SetDuplicationIconVisibility final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigKeyDisplayPiece_C_SetDuplicationIconVisibility;

// Function WDT_ConfigKeyDisplayPiece.WDT_ConfigKeyDisplayPiece_C.SetAssignEnable
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigKeyDisplayPiece_C_SetAssignEnable final
{
public:
	bool                                          InAssignEnable;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigKeyDisplayPiece_C_SetAssignEnable;

// Function WDT_ConfigKeyDisplayPiece.WDT_ConfigKeyDisplayPiece_C.Select
// 0x0002 (0x0002 - 0x0000)
struct WDT_ConfigKeyDisplayPiece_C_Select final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigKeyDisplayPiece_C_Select;

// Function WDT_ConfigKeyDisplayPiece.WDT_ConfigKeyDisplayPiece_C.Deselect
// 0x0002 (0x0002 - 0x0000)
struct WDT_ConfigKeyDisplayPiece_C_Deselect final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigKeyDisplayPiece_C_Deselect;

}

