#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_MapRegionIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_MapRegionIcon.WDT_MapRegionIcon_C
// 0x0050 (0x0618 - 0x05C8)
class UWDT_MapRegionIcon_C final : public UMenuPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SelectMoveAnimation;                               // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DecideAnimation;                                   // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BoxCursorBG;                                       // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BoxCursorEffect;                                   // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BoxCursorImage;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseArea;                                         // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       TargetImage;                                       // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollerItem*                          ScrollerItem;                                      // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             RegionTexture;                                     // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void WidgetAnimationEvt_SelectMoveAnimation_K2Node_WidgetAnimationEvent_0();
	bool Unhighlight(bool PlayAnimation_0);
	bool SetTexture(class UTexture2D* Texture);
	bool SetSubTexture(class FName ImageId, class UTexture2D* Texture);
	bool SetSubLazyTexture(class FName ImageId, const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	void SetScrollerItem(class UScrollerItem* InItem);
	bool SetLazyTexture(const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	bool Select(bool PlayAnimation_0);
	bool Reset();
	void PreConstruct(bool IsDesignTime);
	void PlayDecideAnimation();
	void OnListItemObjectSet(class UObject* ListItemObject);
	bool IsSelected();
	bool Highlight(bool PlayAnimation_0);
	void GetScrollerItem(class UScrollerItem** OutItem);
	bool FlipTexture(bool IsInverse);
	void ExecuteUbergraph_WDT_MapRegionIcon(int32 EntryPoint);
	bool Enable();
	bool Disable();
	bool Deselect(bool PlayAnimation_0);
	bool ClearTexture();
	bool ClearSubTexture(class FName ImageId);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	bool Blink();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_MapRegionIcon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_MapRegionIcon_C")
	}
	static class UWDT_MapRegionIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_MapRegionIcon_C>();
	}
};
DUMPER7_ASSERTS_UWDT_MapRegionIcon_C;

}

