#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_BuddyThumbnailPiece

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_BuddyThumbnailPiece.WDT_BuddyThumbnailPiece_C
// 0x0038 (0x0600 - 0x05C8)
class UWDT_BuddyThumbnailPiece_C final : public UMenuPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BoxCursorBG;                                       // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BoxCursorImage;                                    // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonLazyImage*                       BuddyIcon;                                         // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CantCallOverride;                                  // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EquipIcon;                                         // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseArea;                                         // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	bool Uncheck(bool PlayAnimation_0);
	bool SetTexture(class UTexture2D* Texture);
	bool SetSubTexture(class FName ImageId, class UTexture2D* Texture);
	bool SetSubLazyTexture(class FName ImageId, const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	bool SetLazyTexture(const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	void SetInfo(class UMaterialInstance* IconMaterial, bool IsCantCall);
	bool Select(bool PlayAnimation_0);
	bool Reset();
	void OnListItemObjectSet(class UObject* ListItemObject);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	bool IsChecked();
	bool FlipTexture(bool IsInverse);
	void ExecuteUbergraph_WDT_BuddyThumbnailPiece(int32 EntryPoint);
	bool Deselect(bool PlayAnimation_0);
	bool ClearTexture();
	bool ClearSubTexture(class FName ImageId);
	bool Check(bool PlayAnimation_0, bool AnotherAppearance);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_BuddyThumbnailPiece_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_BuddyThumbnailPiece_C")
	}
	static class UWDT_BuddyThumbnailPiece_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_BuddyThumbnailPiece_C>();
	}
};
DUMPER7_ASSERTS_UWDT_BuddyThumbnailPiece_C;

}

