#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_MapUserMarker

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "Engine_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_MapUserMarker.WDT_MapUserMarker_C
// 0x0068 (0x0630 - 0x05C8)
class UWDT_MapUserMarker_C final : public UMenuPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MakerRemoveAnimation;                              // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MakerAddAnimation;                                 // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MarkerDeselectAnimation;                           // 0x05E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MarkerIdleAnimation;                               // 0x05E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MarkerSelectedAnimation;                           // 0x05F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 FeatureSymbolImage;                                // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FFieldTargetHandle                     MapUserHandle;                                     // 0x0600(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          SelectFlag;                                        // 0x0608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_609[0x3];                                      // 0x0609(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UserIndex;                                         // 0x060C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AddAnimationFlag;                                  // 0x0610(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UWDT_MapUserMarker_C* InMaker)> OnRemoveAnimationFinished;   // 0x0618(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          RemoveAnimationFlag;                               // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void WidgetAnimationEvt_MakerRemoveAnimation_K2Node_WidgetAnimationEvent_3();
	void WidgetAnimationEvt_MakerAddAnimation_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_MakerAddAnimation_K2Node_WidgetAnimationEvent_0();
	void SetUserIndex(int32 InUserIndex);
	void PlaySelectAnimation();
	void PlayRemoveAnimation();
	void PlayDeselectAnimation();
	void PlayAddAnimation();
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void GetIsPlayAddAnimation(bool* OutFlag);
	void ExecuteUbergraph_WDT_MapUserMarker(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_MapUserMarker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_MapUserMarker_C")
	}
	static class UWDT_MapUserMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_MapUserMarker_C>();
	}
};
DUMPER7_ASSERTS_UWDT_MapUserMarker_C;

}

