#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_BuddyInfo

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WDT_BuddyInfo.WDT_BuddyInfo_C.SetBuddyInfo
// 0x0090 (0x0090 - 0x0000)
struct WDT_BuddyInfo_C_SetBuddyInfo final
{
public:
	struct FUIBuddyInfo                           NewParam1;                                         // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<struct FUIBuddyFeatureInfo>            L_SynergyArray;                                    // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<struct FUIBuddyFeatureInfo>            L_FeatureArray;                                    // 0x0060(0x0010)(Edit, BlueprintVisible)
	class FText                                   CallFunc_Get_Feature_Text_Output_Get;              // 0x0070(0x0010)()
	class FText                                   CallFunc_Get_Feature_Text_Output_Get_1;            // 0x0080(0x0010)()
};
DUMPER7_ASSERTS_WDT_BuddyInfo_C_SetBuddyInfo;

// Function WDT_BuddyInfo.WDT_BuddyInfo_C.ExecuteUbergraph_WDT_BuddyInfo
// 0x0004 (0x0004 - 0x0000)
struct WDT_BuddyInfo_C_ExecuteUbergraph_WDT_BuddyInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_BuddyInfo_C_ExecuteUbergraph_WDT_BuddyInfo;

// Function WDT_BuddyInfo.WDT_BuddyInfo_C.Get Feature Text
// 0x0138 (0x0138 - 0x0000)
struct WDT_BuddyInfo_C_Get_Feature_Text final
{
public:
	TArray<struct FUIBuddyFeatureInfo>            Array;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   Output_Get;                                        // 0x0010(0x0010)(Parm, OutParm)
	class FText                                   L_FeatureText;                                     // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIBuddyFeatureInfo                    CallFunc_Array_Get_Item;                           // 0x0040(0x0028)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0070(0x0010)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0088(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00D0(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0118(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0128(0x0010)()
};
DUMPER7_ASSERTS_WDT_BuddyInfo_C_Get_Feature_Text;

}

