#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigIconTextPiece

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ConfigIconTextPiece.WDT_ConfigIconTextPiece_C
// 0x0048 (0x0610 - 0x05C8)
class UWDT_ConfigIconTextPiece_C final : public UMenuPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       ConfigCancelText;                                  // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ConfigCancelText_Shadow;                           // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         IconText_L;                                        // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectImage;                                       // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TitleText;                                         // 0x05F0(0x0010)(Edit, BlueprintVisible)
	class FText                                   IconText;                                          // 0x0600(0x0010)(Edit, BlueprintVisible)

public:
	void SetText(const class FText& SetText_0);
	bool Select(bool PlayAnimation_0);
	void RefreshKeyImage();
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WDT_ConfigIconTextPiece(int32 EntryPoint);
	bool Deselect(bool PlayAnimation_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ConfigIconTextPiece_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ConfigIconTextPiece_C")
	}
	static class UWDT_ConfigIconTextPiece_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ConfigIconTextPiece_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ConfigIconTextPiece_C;

}

