#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ParameterHelp

#include "Basic.hpp"

#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function WDT_ParameterHelp.WDT_ParameterHelp_C.SetBuddyInfo
// 0x0050 (0x0050 - 0x0000)
struct WDT_ParameterHelp_C_SetBuddyInfo final
{
public:
	struct FUIBuddyInfo                           InBuddyInfo;                                       // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WDT_ParameterHelp_C_SetBuddyInfo;

// Function WDT_ParameterHelp.WDT_ParameterHelp_C.SetHelpText
// 0x0020 (0x0020 - 0x0000)
struct WDT_ParameterHelp_C_SetHelpText final
{
public:
	class FText                                   InHelpTItleText;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InHelpText;                                        // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WDT_ParameterHelp_C_SetHelpText;

// Function WDT_ParameterHelp.WDT_ParameterHelp_C.SetWeaponGadgetInfo
// 0x0108 (0x0108 - 0x0000)
struct WDT_ParameterHelp_C_SetWeaponGadgetInfo final
{
public:
	struct FUIWeaponGadgetInfo                    InGadgetInfo;                                      // 0x0000(0x00D0)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x00D0(0x0010)()
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00E8(0x0010)()
	class FText                                   CallFunc_EnumToWeaponGadgetCategoryText_NewParam;  // 0x00F8(0x0010)()
};
DUMPER7_ASSERTS_WDT_ParameterHelp_C_SetWeaponGadgetInfo;

}

