#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigLog

#include "Basic.hpp"

#include "BasicUI_classes.hpp"
#include "EN_ConfigPieceEditableType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ConfigLog.WDT_ConfigLog_C
// 0x0040 (0x0500 - 0x04C0)
class UWDT_ConfigLog_C final : public UUIElementBase
{
public:
	class UImage*                                 LogImage;                                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         LogText;                                           // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       LogTitleText;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              NewEventDispatcher;                                // 0x04D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UBinkMediaTexture*                      BinkTexture;                                       // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   EditTitleOnlyText;                                 // 0x04F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetVisibilityLogImage(bool InFlag);
	void SetLogTitleText(const class FText& Text);
	void SetLogMovie(const class FString& Path);
	void SetImageTexture(TSoftObjectPtr<class UTexture2D> Textue);
	void Set_Log_Text(bool InIsEditable, EN_ConfigPieceEditableType InEditableType, const class FText& Text);
	void RefreshKeyImage();
	void CloseLogMovie();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ConfigLog_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ConfigLog_C")
	}
	static class UWDT_ConfigLog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ConfigLog_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ConfigLog_C;

}

