#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigMenuTypeSelectPiece

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.UpdateTextStyle
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_UpdateTextStyle final
{
public:
	int32                                         CallFunc_GetSelectIndex_OutIndex;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_UpdateTextStyle;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.SetupTypeSelectElementSettings
// 0x0010 (0x0010 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_SetupTypeSelectElementSettings final
{
public:
	TArray<class FText>                           InTextList;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_SetupTypeSelectElementSettings;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.SetSelectIndex
// 0x0004 (0x0004 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_SetSelectIndex final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_SetSelectIndex;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.SetIsEditable
// 0x0003 (0x0003 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_SetIsEditable final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetEnableColor_OutFlag;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetDisableColor_OutFlag;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_SetIsEditable;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.SetEnableColor
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_SetEnableColor final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_SetEnableColor;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.SetEditableGrayOut
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_SetEditableGrayOut final
{
public:
	bool                                          Flag;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_SetEditableGrayOut;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.SetDisableColor
// 0x0018 (0x0018 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_SetDisableColor final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_SetDisableColor;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.SetDefaultSelectIndex
// 0x000C (0x000C - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_SetDefaultSelectIndex final
{
public:
	int32                                         InInitializeIndex;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InDefaultIndex;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEditable_OutFlag;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_SetDefaultSelectIndex;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.SetButtonIconVisibility
// 0x0002 (0x0002 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_SetButtonIconVisibility final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_SetButtonIconVisibility;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.Select
// 0x0002 (0x0002 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_Select final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_Select;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_PreConstruct;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.OnRightPressed
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_OnRightPressed final
{
public:
	bool                                          bInIsPressStarted;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_OnRightPressed;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.OnMouseWheelUpSubPiece
// 0x0010 (0x0010 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_OnMouseWheelUpSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_OnMouseWheelUpSubPiece;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.OnMouseWheelDownSubPiece
// 0x0010 (0x0010 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_OnMouseWheelDownSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_OnMouseWheelDownSubPiece;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.OnMouseLeftClickSubPiece
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_OnMouseLeftClickSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_OnMouseLeftClickSubPiece;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.OnMouseLeaveSubPiece
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_OnMouseLeaveSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_OnMouseLeaveSubPiece;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.OnMouseEnterSubPiece
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_OnMouseEnterSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_OnMouseEnterSubPiece;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.OnLeftPressed
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_OnLeftPressed final
{
public:
	bool                                          bInIsPressStarted;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_OnLeftPressed;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.Next
// 0x0018 (0x0018 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_Next final
{
public:
	bool                                          bInCanWarp;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectIndex_OutIndex;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectIndex_OutIndex_1;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayUIAudioEvent_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEditable_OutFlag;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_Next;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.GetSelectItem
// 0x0018 (0x0018 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_GetSelectItem final
{
public:
	class FText                                   SelectText;                                        // 0x0000(0x0010)(Parm, OutParm)
	int32                                         SelectIndex;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_GetSelectItem;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.GetSelectIndex
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_GetSelectIndex final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectIndex_OutIndex;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_GetSelectIndex;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.GetPhotoModeIntParameterType
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_GetPhotoModeIntParameterType final
{
public:
	EPhotoModeIntParameter                        NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_GetPhotoModeIntParameterType;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.GetLogTexture
// 0x0030 (0x0030 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_GetLogTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              OutTexture;                                        // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          OutIsSuccess;                                      // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_GetLogTexture;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.GetLogMoviePath
// 0x0018 (0x0018 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_GetLogMoviePath final
{
public:
	class FString                                 OutPath;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          OutIsSuccess;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_GetLogMoviePath;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.GetLastIndex
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_GetLastIndex final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_GetLastIndex;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.GetDefaultSelectIndex
// 0x0004 (0x0004 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_GetDefaultSelectIndex final
{
public:
	int32                                         OutDefaultIndex;                                   // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_GetDefaultSelectIndex;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.ExecuteUbergraph_WDT_ConfigMenuTypeSelectPiece
// 0x00C8 (0x00C8 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_ExecuteUbergraph_WDT_ConfigMenuTypeSelectPiece final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsPressStarted_1;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsPressStarted;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_ConfigTypeSelectMiniTabElement_C*  CallFunc_SpawnObject_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMenuPieceBase*                         K2Node_Event_MenuPiece_4;                          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuPieceBase*                         K2Node_Event_MenuPiece_3;                          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Level_1;                              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuPieceBase*                         K2Node_Event_MenuPiece_2;                          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Level;                                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayUIAudioEvent_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMenuPieceBase*                         K2Node_Event_MenuPiece_1;                          // 0x0070(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_OutIndex;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISelectableInterface>  CallFunc_Select_self_CastInput;                    // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Select_ReturnValue;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuPieceBase*                         K2Node_Event_MenuPiece;                            // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEditable_OutFlag;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISelectableInterface>  CallFunc_Deselect_self_CastInput;                  // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Deselect_ReturnValue;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectIndex_OutIndex;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectIndex_OutIndex_1;                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_ExecuteUbergraph_WDT_ConfigMenuTypeSelectPiece;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.Deselect
// 0x0002 (0x0002 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_Deselect final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_Deselect;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.BndEvt__WDT_ConfigMenuTypeSelectPiece_WDT_MiniTabPiece_K2Node_ComponentBoundEvent_0_OnItemClickedEvent__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_BndEvt__WDT_ConfigMenuTypeSelectPiece_WDT_MiniTabPiece_K2Node_ComponentBoundEvent_0_OnItemClickedEvent__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_BndEvt__WDT_ConfigMenuTypeSelectPiece_WDT_MiniTabPiece_K2Node_ComponentBoundEvent_0_OnItemClickedEvent__DelegateSignature;

// Function WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C.Back
// 0x0018 (0x0018 - 0x0000)
struct WDT_ConfigMenuTypeSelectPiece_C_Back final
{
public:
	bool                                          bInCanWarp;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectIndex_OutIndex;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectIndex_OutIndex_1;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayUIAudioEvent_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEditable_OutFlag;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTypeSelectPiece_C_Back;

}

