#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_StatusSummary_Resistant

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WDT_StatusSummary_Resistant.WDT_StatusSummary_Resistant_C.ExecuteUbergraph_WDT_StatusSummary_Resistant
// 0x0008 (0x0008 - 0x0000)
struct WDT_StatusSummary_Resistant_C_ExecuteUbergraph_WDT_StatusSummary_Resistant final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_StatusSummary_Resistant_C_ExecuteUbergraph_WDT_StatusSummary_Resistant;

// Function WDT_StatusSummary_Resistant.WDT_StatusSummary_Resistant_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_StatusSummary_Resistant_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_StatusSummary_Resistant_C_PreConstruct;

// Function WDT_StatusSummary_Resistant.WDT_StatusSummary_Resistant_C.SetValue
// 0x0028 (0x0028 - 0x0000)
struct WDT_StatusSummary_Resistant_C_SetValue final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor;    // 0x0004(0x0014)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
};
DUMPER7_ASSERTS_WDT_StatusSummary_Resistant_C_SetValue;

// Function WDT_StatusSummary_Resistant.WDT_StatusSummary_Resistant_C.SetValueComparison
// 0x0020 (0x0020 - 0x0000)
struct WDT_StatusSummary_Resistant_C_SetValueComparison final
{
public:
	int32                                         InCurrentValue;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InTargetValue;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_CompareInteger_CompareResult;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor;    // 0x000C(0x0014)()
};
DUMPER7_ASSERTS_WDT_StatusSummary_Resistant_C_SetValueComparison;

}

