#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigMeterPiece

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ConfigMeterPiece.WDT_ConfigMeterPiece_C
// 0x0090 (0x0678 - 0x05E8)
class UWDT_ConfigMeterPiece_C final : public UMeterPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonTextBlock*                       MeterNumberText;                                   // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectImage;                                       // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_233;                                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Value;                                             // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DisplayMultiplierValue;                            // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ValueStride;                                       // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnSliderValueChangedEvent;                         // 0x0620(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsMouseCapture;                                   // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsTimeMeter;                                      // 0x0631(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_632[0x6];                                      // 0x0632(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NormalizeValue;                                    // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DecimalDigitMultiplier;                            // 0x0640(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MI_MeterBar_Normal;                                // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MI_MeterBar_Hovered;                               // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        OldValue;                                          // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DisplayAddValue;                                   // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   TimeHourFormat;                                    // 0x0668(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateMeterMaterial();
	void SetStrideValue(double InValue);
	void SetMinValue(double Value_0);
	void SetMaxValue(double Value_0);
	bool Select(bool PlayAnimation_0);
	void RoundMeterValue(double InValue, double* OutValue);
	void PreConstruct(bool IsDesignTime);
	void OnMeterValueChanged(float MeterValueToNotify, float Percentage, float DisplayNumber, bool PlayAnimation_0);
	bool IncreaseValue(bool PlayAnimation_0);
	void GetMeterValueTime(struct FTimespan* OutTime);
	float GetMeterValue();
	float GetMeterDisplayValue();
	void GetIsAM(bool* OutFlag);
	void ExecuteUbergraph_WDT_ConfigMeterPiece(int32 EntryPoint);
	void DisplayValueToMeterValue(double InDisplayValue, double* OutMeterValue);
	bool Deselect(bool PlayAnimation_0);
	bool DecreaseValue(bool PlayAnimation_0);
	void Construct();
	void BndEvt__WDT_ConfigMeterPiece_Slider_233_K2Node_ComponentBoundEvent_2_OnMouseCaptureEndEvent__DelegateSignature();
	void BndEvt__WDT_ConfigMeterPiece_Slider_233_K2Node_ComponentBoundEvent_1_OnMouseCaptureBeginEvent__DelegateSignature();
	void BndEvt__WDT_ConfigMeterElement_Slider_233_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ConfigMeterPiece_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ConfigMeterPiece_C")
	}
	static class UWDT_ConfigMeterPiece_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ConfigMeterPiece_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ConfigMeterPiece_C;

}

