#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Article_GadgetCapacity

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WDT_Article_GadgetCapacity.WDT_Article_GadgetCapacity_C.SetConductivityValue
// 0x0008 (0x0008 - 0x0000)
struct WDT_Article_GadgetCapacity_C_SetConductivityValue final
{
public:
	int32                                         InCapacityValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadValue;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Article_GadgetCapacity_C_SetConductivityValue;

// Function WDT_Article_GadgetCapacity.WDT_Article_GadgetCapacity_C.SetConductivityValueComparison
// 0x0014 (0x0014 - 0x0000)
struct WDT_Article_GadgetCapacity_C_SetConductivityValueComparison final
{
public:
	int32                                         InCapacityCurrentValue;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCapacityValue;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadCurrentValue;                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadValue;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CapacitySwapComparisons;                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LoadSwapComparisons;                               // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Article_GadgetCapacity_C_SetConductivityValueComparison;

// Function WDT_Article_GadgetCapacity.WDT_Article_GadgetCapacity_C.SetConductivityValueComparisonLoadOnly
// 0x000C (0x000C - 0x0000)
struct WDT_Article_GadgetCapacity_C_SetConductivityValueComparisonLoadOnly final
{
public:
	int32                                         InLoadCurrentValue;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadValue;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LoadSwapComparisons;                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Article_GadgetCapacity_C_SetConductivityValueComparisonLoadOnly;

// Function WDT_Article_GadgetCapacity.WDT_Article_GadgetCapacity_C.SetEfficiencyValue
// 0x0008 (0x0008 - 0x0000)
struct WDT_Article_GadgetCapacity_C_SetEfficiencyValue final
{
public:
	int32                                         InCapacityValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadValue;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Article_GadgetCapacity_C_SetEfficiencyValue;

// Function WDT_Article_GadgetCapacity.WDT_Article_GadgetCapacity_C.SetEfficiencyValueComparison
// 0x0014 (0x0014 - 0x0000)
struct WDT_Article_GadgetCapacity_C_SetEfficiencyValueComparison final
{
public:
	int32                                         InCapacityCurrentValue;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCapacityValue;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadCurrentValue;                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadValue;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CapacitySwapComparisons;                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LoadSwapComparisons;                               // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Article_GadgetCapacity_C_SetEfficiencyValueComparison;

// Function WDT_Article_GadgetCapacity.WDT_Article_GadgetCapacity_C.SetEfficiencyValueComparisonLoadOnly
// 0x000C (0x000C - 0x0000)
struct WDT_Article_GadgetCapacity_C_SetEfficiencyValueComparisonLoadOnly final
{
public:
	int32                                         InLoadCurrentValue;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadValue;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LoadSwapComparisons;                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Article_GadgetCapacity_C_SetEfficiencyValueComparisonLoadOnly;

// Function WDT_Article_GadgetCapacity.WDT_Article_GadgetCapacity_C.SetHandlingValue
// 0x0008 (0x0008 - 0x0000)
struct WDT_Article_GadgetCapacity_C_SetHandlingValue final
{
public:
	int32                                         InCapacityValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadValue;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Article_GadgetCapacity_C_SetHandlingValue;

// Function WDT_Article_GadgetCapacity.WDT_Article_GadgetCapacity_C.SetHandlingValueComparison
// 0x0014 (0x0014 - 0x0000)
struct WDT_Article_GadgetCapacity_C_SetHandlingValueComparison final
{
public:
	int32                                         InCapacityCurrentValue;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCapacityValue;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadCurrentValue;                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadValue;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CapacitySwapComparisons;                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LoadSwapComparisons;                               // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Article_GadgetCapacity_C_SetHandlingValueComparison;

// Function WDT_Article_GadgetCapacity.WDT_Article_GadgetCapacity_C.SetHandlingValueComparisonLoadOnly
// 0x000C (0x000C - 0x0000)
struct WDT_Article_GadgetCapacity_C_SetHandlingValueComparisonLoadOnly final
{
public:
	int32                                         InLoadCurrentValue;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadValue;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LoadSwapComparisons;                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Article_GadgetCapacity_C_SetHandlingValueComparisonLoadOnly;

// Function WDT_Article_GadgetCapacity.WDT_Article_GadgetCapacity_C.SetReliabilityValue
// 0x0008 (0x0008 - 0x0000)
struct WDT_Article_GadgetCapacity_C_SetReliabilityValue final
{
public:
	int32                                         InCapacityValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadValue;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Article_GadgetCapacity_C_SetReliabilityValue;

// Function WDT_Article_GadgetCapacity.WDT_Article_GadgetCapacity_C.SetReliabilityValueComparison
// 0x0014 (0x0014 - 0x0000)
struct WDT_Article_GadgetCapacity_C_SetReliabilityValueComparison final
{
public:
	int32                                         InCapacityCurrentValue;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCapacityValue;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadCurrentValue;                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadValue;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CapacitySwapComparisons;                           // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LoadSwapComparisons;                               // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Article_GadgetCapacity_C_SetReliabilityValueComparison;

// Function WDT_Article_GadgetCapacity.WDT_Article_GadgetCapacity_C.SetReliabilityValueComparisonLoadOnly
// 0x000C (0x000C - 0x0000)
struct WDT_Article_GadgetCapacity_C_SetReliabilityValueComparisonLoadOnly final
{
public:
	int32                                         InLoadCurrentValue;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadValue;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LoadSwapComparisons;                               // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Article_GadgetCapacity_C_SetReliabilityValueComparisonLoadOnly;

// Function WDT_Article_GadgetCapacity.WDT_Article_GadgetCapacity_C.SetValue
// 0x0060 (0x0060 - 0x0000)
struct WDT_Article_GadgetCapacity_C_SetValue final
{
public:
	int32                                         InCapacityValue;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadValue;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CapacityText;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             LoadText;                                          // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0028(0x0010)()
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor;    // 0x0038(0x0014)()
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor_1;  // 0x004C(0x0014)()
};
DUMPER7_ASSERTS_WDT_Article_GadgetCapacity_C_SetValue;

// Function WDT_Article_GadgetCapacity.WDT_Article_GadgetCapacity_C.SetValueComparison
// 0x0058 (0x0058 - 0x0000)
struct WDT_Article_GadgetCapacity_C_SetValueComparison final
{
public:
	int32                                         InCapacityCurrentValue;                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InCapacityValue;                                   // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadCurrentValue;                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadValue;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             CapacityText;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             LoadText;                                          // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         Allow;                                             // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CapacitySwapComparisons;                           // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LoadSwapComparisons;                               // 0x0029(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_CompareInteger_CompareResult;             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_CompareInteger_CompareResult_1;           // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor;    // 0x002C(0x0014)()
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor_1;  // 0x0040(0x0014)()
};
DUMPER7_ASSERTS_WDT_Article_GadgetCapacity_C_SetValueComparison;

// Function WDT_Article_GadgetCapacity.WDT_Article_GadgetCapacity_C.SetValueComparisonLoadOnly
// 0x0028 (0x0028 - 0x0000)
struct WDT_Article_GadgetCapacity_C_SetValueComparisonLoadOnly final
{
public:
	int32                                         InLoadCurrentValue;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InLoadValue;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             LoadText;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          LoadSwapComparisons;                               // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_CompareInteger_CompareResult;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor;    // 0x0014(0x0014)()
};
DUMPER7_ASSERTS_WDT_Article_GadgetCapacity_C_SetValueComparisonLoadOnly;

}

