#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_AccumulateIndicator

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function WDT_AccumulateIndicator.WDT_AccumulateIndicator_C.ExecuteUbergraph_WDT_AccumulateIndicator
// 0x0030 (0x0030 - 0x0000)
struct WDT_AccumulateIndicator_C_ExecuteUbergraph_WDT_AccumulateIndicator final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWDT_AccumulateGauge_C*                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWDT_AccumulateGauge_C*>         K2Node_MakeArray_Array;                            // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_WDT_AccumulateIndicator_C_ExecuteUbergraph_WDT_AccumulateIndicator;

// Function WDT_AccumulateIndicator.WDT_AccumulateIndicator_C.IsVisble_Override
// 0x0010 (0x0010 - 0x0000)
struct WDT_AccumulateIndicator_C_IsVisble_Override final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVisible_0;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_AccumulateIndicator_C_IsVisble_Override;

// Function WDT_AccumulateIndicator.WDT_AccumulateIndicator_C.UpdateAccumulate
// 0x01F0 (0x01F0 - 0x0000)
struct WDT_AccumulateIndicator_C_UpdateAccumulate final
{
public:
	struct FAccumulateGaugeInfo                   GaugeInfo;                                         // 0x0000(0x00E0)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FAccumulateAttributeUIInfo             AttributeInfo;                                     // 0x00E0(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FAccumulateAttributeUIInfo             LocalAttributeInfo;                                // 0x00F0(0x0010)(Edit, BlueprintVisible, NoDestructor)
	struct FAccumulateGaugeInfo                   LocalGaugeInfo;                                    // 0x0100(0x00E0)(Edit, BlueprintVisible)
	class UWDT_AccumulateGauge_C*                 CallFunc_Array_Get_Item;                           // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_AccumulateIndicator_C_UpdateAccumulate;

}

