#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_SupportMenuTab

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_SupportMenuTab.WDT_SupportMenuTab_C
// 0x0078 (0x0538 - 0x04C0)
class UWDT_SupportMenuTab_C final : public UUIElementBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URichTextBlock*                         IconText_SwitchLeft;                               // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         IconText_SwitchRight;                              // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectImage;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectImage_1;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectImage_2;                                     // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListView*                              TabList;                                           // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           TabTextList;                                       // 0x04F8(0x0010)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void(int32 InIndex)> OnTabItemCliked;                                   // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UBP_SupportMenuTabItemData_C*>   TabItemDataList;                                   // 0x0518(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(int32 InInitializedIndex)> OnEntryInitialized;                     // 0x0528(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SetTabIndex(int32 InIndex);
	void Set_New_Flag(int32 InIndex, bool InFlag);
	void RefreshKeyImage();
	void PreConstruct(bool IsDesignTime);
	void MoveTabIndex(int32 InIncrement);
	void Initialize();
	void ExecuteUbergraph_WDT_SupportMenuTab(int32 EntryPoint);
	void BndEvt__WDT_SupportMenuTab_TabList_K2Node_ComponentBoundEvent_2_OnItemIsHoveredChangedDynamic__DelegateSignature(class UObject* Item, bool bIsHovered);
	void BndEvt__WDT_SupportMenuTab_TabList_K2Node_ComponentBoundEvent_1_OnListEntryInitializedDynamic__DelegateSignature(class UObject* Item, class UUserWidget* Widget);
	void BndEvt__WDT_SupportMenuTab_TabList_K2Node_ComponentBoundEvent_0_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_SupportMenuTab_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_SupportMenuTab_C")
	}
	static class UWDT_SupportMenuTab_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_SupportMenuTab_C>();
	}
};
DUMPER7_ASSERTS_UWDT_SupportMenuTab_C;

}

