#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_GeneralYesNoDialog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_GeneralYesNoDialog.WDT_GeneralYesNoDialog_C
// 0x0050 (0x0670 - 0x0620)
class UWDT_GeneralYesNoDialog_C final : public UDialogBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0620(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GeneralYesNoDialog_Cancel;                         // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GeneralYesNoDialog_Close;                          // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       GeneralYesNoDialog_Open;                           // 0x0638(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       DialogCommonText;                                  // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DialogTitleCommonText;                             // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfirmOptionButton_C*             Option1;                                           // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfirmOptionButton_C*             Option2;                                           // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_SelectPice;                            // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DecidePressed;                                     // 0x0668(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void WidgetAnimationEvt_GeneralYesNoDialog_Close_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_GeneralYesNoDialog_Cancel_K2Node_WidgetAnimationEvent_0();
	void SetSelectOption(const uint8 InSelectOption);
	void SetSelectDialogIndex(int32 Index_0);
	void SequenceEvent__ENTRYPOINTWDT_GeneralYesNoDialog(class UCanvasPanel* CanvasPanel_23);
	void OnUpPressed();
	void OnSetDialogInfo(const struct FDialogInfo& InDialogInfo);
	void OnOpening();
	void OnOpened();
	void OnMouseLeftClickMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseEnterMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMenuInitialized();
	class UWidgetAnimation* OnGetOpenAnimation();
	void OnDownPressed();
	void OnDecidePressed();
	void OnClosing();
	void OnClosed();
	void OnCancelPressed();
	void InpActEvt_IA_UI_Up_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Down_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Decide_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Cancel_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void Initialize();
	void GeneralYesNoDialogOpenAnim_Event(class UCanvasPanel* CanvasPanel_23);
	void ExecuteUbergraph_WDT_GeneralYesNoDialog(int32 EntryPoint);
	void BP_OnDeactivated();
	void BP_OnActivated();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_GeneralYesNoDialog_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_GeneralYesNoDialog_C")
	}
	static class UWDT_GeneralYesNoDialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_GeneralYesNoDialog_C>();
	}
};
DUMPER7_ASSERTS_UWDT_GeneralYesNoDialog_C;

}

