#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Article_Attribute

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WDT_Article_Attribute.WDT_Article_Attribute_C.ExecuteUbergraph_WDT_Article_Attribute
// 0x0008 (0x0008 - 0x0000)
struct WDT_Article_Attribute_C_ExecuteUbergraph_WDT_Article_Attribute final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Article_Attribute_C_ExecuteUbergraph_WDT_Article_Attribute;

// Function WDT_Article_Attribute.WDT_Article_Attribute_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_Article_Attribute_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Article_Attribute_C_PreConstruct;

// Function WDT_Article_Attribute.WDT_Article_Attribute_C.SetValue
// 0x0030 (0x0030 - 0x0000)
struct WDT_Article_Attribute_C_SetValue final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor;    // 0x0018(0x0014)()
};
DUMPER7_ASSERTS_WDT_Article_Attribute_C_SetValue;

// Function WDT_Article_Attribute.WDT_Article_Attribute_C.SetValueComparison
// 0x0020 (0x0020 - 0x0000)
struct WDT_Article_Attribute_C_SetValueComparison final
{
public:
	int32                                         InCurrentValue;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InTargetValue;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SwapComparisons;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_CompareInteger_CompareResult;             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_GetTextColorByCompareResult_TextColor;    // 0x000C(0x0014)()
};
DUMPER7_ASSERTS_WDT_Article_Attribute_C_SetValueComparison;

}

