#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ExplorationDialog

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WDT_ExplorationDialog.WDT_ExplorationDialog_C.ApplyConfiguration
// 0x0058 (0x0058 - 0x0000)
struct WDT_ExplorationDialog_C_ApplyConfiguration final
{
public:
	class UConfigurationManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConfigurationAccessibilitySaveData    CallFunc_GetConfigAccessibilitySaveData_ReturnValue; // 0x000C(0x0024)(ConstParm, NoDestructor)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetUserSpecifiedScale_InUserSpecifiedScale_ImplicitCast; // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetRenderOpacity_InOpacity_ImplicitCast;  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ExplorationDialog_C_ApplyConfiguration;

// Function WDT_ExplorationDialog.WDT_ExplorationDialog_C.HideExplorationDialog
// 0x0040 (0x0040 - 0x0000)
struct WDT_ExplorationDialog_C_HideExplorationDialog final
{
public:
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAppUIManager*                          CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInBattle_ReturnValue;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIObjectBase*                          CallFunc_GetUIObjectByClass_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_BuddyIndicatorUIObject_C*           K2Node_DynamicCast_AsBP_Buddy_Indicator_UIObject;  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_BuddyIndicator_C*                  CallFunc_GetBuddyIndicator_OutIndicator;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ExplorationDialog_C_HideExplorationDialog;

// Function WDT_ExplorationDialog.WDT_ExplorationDialog_C.IsShow
// 0x0001 (0x0001 - 0x0000)
struct WDT_ExplorationDialog_C_IsShow final
{
public:
	bool                                          OutIsShow;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ExplorationDialog_C_IsShow;

// Function WDT_ExplorationDialog.WDT_ExplorationDialog_C.SetTalkText
// 0x0050 (0x0050 - 0x0000)
struct WDT_ExplorationDialog_C_SetTalkText final
{
public:
	class FText                                   InSpeaker;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InStatement;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UConfigurationManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FConfigurationAccessibilitySaveData    CallFunc_GetConfigAccessibilitySaveData_ReturnValue; // 0x0028(0x0024)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ExplorationDialog_C_SetTalkText;

// Function WDT_ExplorationDialog.WDT_ExplorationDialog_C.ShowExplorationDialog
// 0x00B8 (0x00B8 - 0x0000)
struct WDT_ExplorationDialog_C_ShowExplorationDialog final
{
public:
	class FText                                   InSpeaker;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InStatement;                                       // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	double                                        InDuration;                                        // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_FormatTextWithPlayerInfo_ReturnValue;     // 0x0038(0x0010)()
	class FText                                   CallFunc_FormatTextWithPlayerInfo_ReturnValue_1;   // 0x0048(0x0010)()
	class UUIManager*                             CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUIObjectBase*                          CallFunc_GetUIObjectByClass_ReturnValue;           // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_BuddyIndicatorUIObject_C*           K2Node_DynamicCast_AsBP_Buddy_Indicator_UIObject;  // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_BuddyIndicator_C*                  CallFunc_GetBuddyIndicator_OutIndicator;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UConfigurationManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FConfigurationAccessibilitySaveData    CallFunc_GetConfigAccessibilitySaveData_ReturnValue; // 0x008C(0x0024)(ConstParm, NoDestructor)
	float                                         CallFunc_K2_SetTimer_Time_ImplicitCast;            // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ExplorationDialog_C_ShowExplorationDialog;

// Function WDT_ExplorationDialog.WDT_ExplorationDialog_C.UpdateSpeakerVisibility
// 0x0001 (0x0001 - 0x0000)
struct WDT_ExplorationDialog_C_UpdateSpeakerVisibility final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ExplorationDialog_C_UpdateSpeakerVisibility;

}

