#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ActionInputTrgGuide

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function WDT_ActionInputTrgGuide.WDT_ActionInputTrgGuide_C.UpdateTrgImage
// 0x02A0 (0x02A0 - 0x0000)
struct WDT_ActionInputTrgGuide_C_UpdateTrgImage final
{
public:
	TArray<struct FKey>                           InKeys;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FKey                                   L_Key;                                             // 0x0010(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_K2_GetKeyImageBrushByKey_ReturnValue;     // 0x0030(0x00D0)(ConstParm)
	class UTexture2D*                             CallFunc_Map_Find_Value;                           // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Map_Find_Value_1;                         // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue_1;               // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_GetBrushResourceAsTexture2D_ReturnValue;  // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   CallFunc_Array_Get_Item;                           // 0x0130(0x0018)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_K2_GetKeyImageBrushByKey_ReturnValue_1;   // 0x0150(0x00D0)(ConstParm)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlatformDataManager*                   CallFunc_GetEngineSubsystem_ReturnValue;           // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_232[0x6];                                      // 0x0232(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UConfigurationManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FConfigurationLanguageSaveData         CallFunc_GetConfigLanguageSaveData_ReturnValue;    // 0x0240(0x0002)(ConstParm, NoDestructor)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UConfigurationManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FConfigurationLanguageSaveData         CallFunc_GetConfigLanguageSaveData_ReturnValue_1;  // 0x0250(0x0002)(ConstParm, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0252(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0253(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Temp_struct_Variable;                              // 0x0258(0x0018)(ConstParm, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_272[0x6];                                      // 0x0272(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   Temp_struct_Variable_1;                            // 0x0278(0x0018)(ConstParm, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0296(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_297[0x1];                                      // 0x0297(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ActionInputTrgGuide_C_UpdateTrgImage;

// Function WDT_ActionInputTrgGuide.WDT_ActionInputTrgGuide_C.UpdateInputActionTrgImage
// 0x0018 (0x0018 - 0x0000)
struct WDT_ActionInputTrgGuide_C_UpdateInputActionTrgImage final
{
public:
	bool                                          CallFunc_K2_IsCurrentInputDeviceGamePad_ReturnValue; // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           CallFunc_GetAssignKeys_ReturnValue;                // 0x0008(0x0010)(ConstParm, ReferenceParm)
};
DUMPER7_ASSERTS_WDT_ActionInputTrgGuide_C_UpdateInputActionTrgImage;

// Function WDT_ActionInputTrgGuide.WDT_ActionInputTrgGuide_C.SetKeys
// 0x0010 (0x0010 - 0x0000)
struct WDT_ActionInputTrgGuide_C_SetKeys final
{
public:
	TArray<struct FKey>                           InKeys;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WDT_ActionInputTrgGuide_C_SetKeys;

// Function WDT_ActionInputTrgGuide.WDT_ActionInputTrgGuide_C.SetHideKey
// 0x0018 (0x0018 - 0x0000)
struct WDT_ActionInputTrgGuide_C_SetHideKey final
{
public:
	struct FKey                                   InHideKey;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ActionInputTrgGuide_C_SetHideKey;

// Function WDT_ActionInputTrgGuide.WDT_ActionInputTrgGuide_C.SetBrushImageSize
// 0x02A0 (0x02A0 - 0x0000)
struct WDT_ActionInputTrgGuide_C_SetBrushImageSize final
{
public:
	struct FVector2D                              InSize;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0010(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x00E0(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x01B0(0x00D0)()
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast;          // 0x0280(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast_1;        // 0x0288(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FDeprecateSlateVector2D                K2Node_MakeStruct_ImageSize_ImplicitCast_2;        // 0x0290(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ActionInputTrgGuide_C_SetBrushImageSize;

// Function WDT_ActionInputTrgGuide.WDT_ActionInputTrgGuide_C.SetAllIconImageBrushTintColor
// 0x0014 (0x0014 - 0x0000)
struct WDT_ActionInputTrgGuide_C_SetAllIconImageBrushTintColor final
{
public:
	struct FSlateColor                            InTintColor;                                       // 0x0000(0x0014)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WDT_ActionInputTrgGuide_C_SetAllIconImageBrushTintColor;

// Function WDT_ActionInputTrgGuide.WDT_ActionInputTrgGuide_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_ActionInputTrgGuide_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ActionInputTrgGuide_C_PreConstruct;

// Function WDT_ActionInputTrgGuide.WDT_ActionInputTrgGuide_C.InitializeTag
// 0x0020 (0x0020 - 0x0000)
struct WDT_ActionInputTrgGuide_C_InitializeTag final
{
public:
	struct FInputActionTag                        InInputActionTag;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsCurrentInputDeviceGamePad_ReturnValue; // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           CallFunc_GetAssignKeys_ReturnValue;                // 0x0010(0x0010)(ConstParm, ReferenceParm)
};
DUMPER7_ASSERTS_WDT_ActionInputTrgGuide_C_InitializeTag;

// Function WDT_ActionInputTrgGuide.WDT_ActionInputTrgGuide_C.GetAssignKey
// 0x0028 (0x0028 - 0x0000)
struct WDT_ActionInputTrgGuide_C_GetAssignKey final
{
public:
	TArray<struct FKey>                           OutAssignKey;                                      // 0x0000(0x0010)(Parm, OutParm)
	bool                                          CallFunc_K2_IsCurrentInputDeviceGamePad_ReturnValue; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           CallFunc_GetAssignKeys_ReturnValue;                // 0x0018(0x0010)(ConstParm, ReferenceParm)
};
DUMPER7_ASSERTS_WDT_ActionInputTrgGuide_C_GetAssignKey;

// Function WDT_ActionInputTrgGuide.WDT_ActionInputTrgGuide_C.ExecuteUbergraph_WDT_ActionInputTrgGuide
// 0x0030 (0x0030 - 0x0000)
struct WDT_ActionInputTrgGuide_C_ExecuteUbergraph_WDT_ActionInputTrgGuide final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsCurrentInputDeviceGamePad_ReturnValue; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           CallFunc_GetAssignKeys_ReturnValue;                // 0x0020(0x0010)(ConstParm, ReferenceParm)
};
DUMPER7_ASSERTS_WDT_ActionInputTrgGuide_C_ExecuteUbergraph_WDT_ActionInputTrgGuide;

}

