#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigMatchingRegionSelectPage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WDT_ConfigStandardPageBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ConfigMatchingRegionSelectPage.WDT_ConfigMatchingRegionSelectPage_C
// 0x0040 (0x0618 - 0x05D8)
class UWDT_ConfigMatchingRegionSelectPage_C final : public UWDT_ConfigStandardPageBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           ConfigMenuBox;                                     // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigIconTextPiece_C*             Decide;                                            // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigMenuTypeSelectPiece_C*       MatchingRegion;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigHeader_C*                    WDT_ConfigHeader;                                  // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigLog_C*                       WDT_ConfigurationLog;                              // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   HeaderBackMatchingMenuText;                        // 0x0608(0x0010)(Edit, BlueprintVisible)

public:
	void BndEvt__WDT_ConfigGamePage_WDT_ConfigHeader_K2Node_ComponentBoundEvent_1_OnInitializeClickedEvent__DelegateSignature();
	void BndEvt__WDT_ConfigGamePage_WDT_ConfigHeader_K2Node_ComponentBoundEvent_2_OnBackClickedEvent__DelegateSignature();
	void ExecuteUbergraph_WDT_ConfigMatchingRegionSelectPage(int32 EntryPoint);
	void InpActEvt_IA_UI_DecideOnRelease_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Down_K2Node_EnhancedInputActionEvent_6(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Left_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Left_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_MenuSpecial1_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Right_K2Node_EnhancedInputActionEvent_4(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Right_K2Node_EnhancedInputActionEvent_5(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Up_K2Node_EnhancedInputActionEvent_7(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void OnClosed();
	void OnInputDeviceChanged();
	void OnMenuInitialized();
	void OnMouseEnterMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeaveMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeftClickMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnOpened();
	void OnOpening();
	void SaveConfigValue();
	void SetupConfigPieceList();
	void SetupConfigPieceValue();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ConfigMatchingRegionSelectPage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ConfigMatchingRegionSelectPage_C")
	}
	static class UWDT_ConfigMatchingRegionSelectPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ConfigMatchingRegionSelectPage_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ConfigMatchingRegionSelectPage_C;

}

