#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Status_Capacity

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WDT_Status_Capacity.WDT_Status_Capacity_C.ExecuteUbergraph_WDT_Status_Capacity
// 0x0008 (0x0008 - 0x0000)
struct WDT_Status_Capacity_C_ExecuteUbergraph_WDT_Status_Capacity final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Status_Capacity_C_ExecuteUbergraph_WDT_Status_Capacity;

// Function WDT_Status_Capacity.WDT_Status_Capacity_C.GetComparisonColorForCapacity
// 0x005C (0x005C - 0x0000)
struct WDT_Status_Capacity_C_GetComparisonColorForCapacity final
{
public:
	int32                                         Current;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         After;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            SlateColor;                                        // 0x0008(0x0014)(Parm, OutParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x001C(0x0014)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0034(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0048(0x0014)()
};
DUMPER7_ASSERTS_WDT_Status_Capacity_C_GetComparisonColorForCapacity;

// Function WDT_Status_Capacity.WDT_Status_Capacity_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_Status_Capacity_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Status_Capacity_C_PreConstruct;

// Function WDT_Status_Capacity.WDT_Status_Capacity_C.SetValue
// 0x0030 (0x0030 - 0x0000)
struct WDT_Status_Capacity_C_SetValue final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	struct FSlateColor                            CallFunc_GetComparisonColorForCapacity_SlateColor; // 0x0018(0x0014)()
};
DUMPER7_ASSERTS_WDT_Status_Capacity_C_SetValue;

// Function WDT_Status_Capacity.WDT_Status_Capacity_C.SetValueComparison
// 0x0030 (0x0030 - 0x0000)
struct WDT_Status_Capacity_C_SetValueComparison final
{
public:
	int32                                         InCurrentValue;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InTargetValue;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CallFunc_GetComparisonColorForCapacity_SlateColor; // 0x0008(0x0014)()
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0010)()
};
DUMPER7_ASSERTS_WDT_Status_Capacity_C_SetValueComparison;

}

