#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_WeaponEquipmentMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_WeaponEquipmentMenu.WDT_WeaponEquipmentMenu_C
// 0x0670 (0x0C28 - 0x05B8)
class UWDT_WeaponEquipmentMenu_C final : public UAppMenuBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CloseAnim;                                         // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OpenAnim;                                          // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWDT_ArticleInfo_C*                     ArticleInfoPanel;                                  // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_FieldMenuCloser_C*                 FieldMenuCloser;                                   // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           FullscreenCanvas;                                  // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_EquipmentDisable;                            // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ListOrEmptySwitcher;                               // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MenuWindowZ;                                       // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_CategoryPallet_C*                  WDT_CategoryPallet;                                // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_GridBoxEmptyText_C*                WDT_GridBoxEmptyText;                              // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_SpecialBuffList_C*                 WDT_SpecialBuffList;                               // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           WeaponEquipContainer;                              // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           WeaponEquipMenuCanvas;                             // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridScroller*                          WeaponGridBox;                                     // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFieldMenuUIObject*                     FieldMenuUIObject;                                 // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              EmptyTexture;                                      // 0x0638(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	struct FUIWeaponInfo                          EmptyWeaponInfo;                                   // 0x0660(0x05B8)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsInputSwitchFirstStarted;                         // 0x0C18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C19[0x3];                                      // 0x0C19(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PrevCategory;                                      // 0x0C1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInputHorizonFirstStarted;                        // 0x0C20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C21[0x3];                                      // 0x0C21(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LazyScrollTargetIndex;                             // 0x0C24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BackToFieldMenu(int32 WeaponSlotIndex);
	void BndEvt__WDT_WeaponEquipmentMenu_WeaponGridBox_K2Node_ComponentBoundEvent_0_OnItemIsHoveredChangedDynamic__DelegateSignature(class UObject* Item, bool bIsHovered);
	void BndEvt__WDT_WeaponEquipmentMenu_WeaponGridBox_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature(class UObject* Item, class UUserWidget* Widget);
	void BndEvt__WDT_WeaponEquipmentMenu_WeaponGridBox_K2Node_ComponentBoundEvent_1_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__WDT_WeaponEquipmentMenu_WeaponGridBox_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__WDT_WeaponEquipmentMenu_WeaponGridBox_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void BP_OnItemScrolledIntoView_Event(class UObject* Item, class UUserWidget* Widget);
	void Construct();
	void ExecuteUbergraph_WDT_WeaponEquipmentMenu(int32 EntryPoint);
	int32 GetCategoryNumber(int32 CategoryIndex);
	EUIWeaponCategory GetCurrentCategory();
	void GetEquippedWeaponIndexInCategory(EUIWeaponSlot InSlot, int32* IndexInCategory);
	void GetQueryWeaponInfo(const struct FUIWeaponQueryInfo& Query, struct FUIWeaponInfo* WeaponInfo);
	void Initialize();
	void InpActEvt_IA_UI_CancelOnRelease_K2Node_EnhancedInputActionEvent_15(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_DecideOnRelease_K2Node_EnhancedInputActionEvent_16(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Down_K2Node_EnhancedInputActionEvent_13(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_FieldMenu_K2Node_EnhancedInputActionEvent_8(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Left_K2Node_EnhancedInputActionEvent_11(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Left_K2Node_EnhancedInputActionEvent_12(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_MenuSpecial2_K2Node_EnhancedInputActionEvent_7(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_MenuSpecial3_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_MenuSpecial4_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Right_K2Node_EnhancedInputActionEvent_10(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Right_K2Node_EnhancedInputActionEvent_9(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchLeft_K2Node_EnhancedInputActionEvent_5(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchLeft_K2Node_EnhancedInputActionEvent_6(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchRight_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchRight_K2Node_EnhancedInputActionEvent_4(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_TriggerRight_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Up_K2Node_EnhancedInputActionEvent_14(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	bool IsShowSpecialBuffList();
	void MakeCheckedIndexMap(int32 InEquippedWeaponIndex, TMap<int32, bool>* OutCheckedIndexMap);
	void MakeSelectionWeaponQuery(int32 Index_0, struct FUIWeaponQueryInfo* NewQuery);
	void OnCancelReleased();
	void OnChangedCategoryIndex(int32 CategoryIndex);
	void OnClosed();
	void OnDecideReleased();
	void OnDownPressed();
	void OnFieldMenuButtonReleased();
	void OnFieldMenuCloseAnimationFinish();
	class UWidgetAnimation* OnGetCloseAnimation();
	class UWidgetAnimation* OnGetOpenAnimation();
	void OnInputDeviceChanged();
	void OnLazyScroll();
	void OnLeftPressed(bool InCanWarp);
	void OnMenuInitialized();
	void OnMenuSpecial2Pressed();
	void OnNotifyPlayerHealthUpdated(double InCurrentHealth, double InMaxHealth);
	void OnNotifyPlayerStaminaUpdated(int32 InCurrentStamina, int32 InMaxStamina);
	void OnNotifyPlayerStatusUpdated();
	void OnOpening();
	void OnRightPressed(bool InCanWarp);
	void OnUpdateDisplay();
	void OnUpdateDisplayImplement();
	void OnUpPressed();
	void PreConstruct(bool IsDesignTime);
	void Reset();
	void SequenceEvent__ENTRYPOINTWDT_WeaponEquipmentMenu(class UCanvasPanel* WeaponEquipMenuCanvas_0);
	void SequenceEvent__ENTRYPOINTWDT_WeaponEquipmentMenu_0(class UCanvasPanel* WeaponEquipMenuCanvas_0);
	void SetProhibited(bool InProhibited);
	void UpdateArticleInfo(const int32 InWeaponIndex);
	void UpdateProhibited();
	void WeaponEquipMenuCanvas_Event(class UCanvasPanel* WeaponEquipMenuCanvas_0);
	void WeaponEquipMenuCanvas_Event_Close(class UCanvasPanel* WeaponEquipMenuCanvas_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_WeaponEquipmentMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_WeaponEquipmentMenu_C")
	}
	static class UWDT_WeaponEquipmentMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_WeaponEquipmentMenu_C>();
	}
};
DUMPER7_ASSERTS_UWDT_WeaponEquipmentMenu_C;

}

