#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigConsentPage

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "BasicUI_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ConfigConsentPage.WDT_ConfigConsentPage_C
// 0x0158 (0x0710 - 0x05B8)
class UWDT_ConfigConsentPage_C final : public UAppMenuBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Consent_CloseCancel;                               // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Consent_CloseNo;                                   // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Consent_CloseYes;                                  // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Consent_Open;                                      // 0x05D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWDT_ConfigIconTextPiece_C*             Cancel;                                            // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigMenuTypeSelectPiece_C*       ConsentAnalyticsTypeSelect;                        // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ConsentImage;                                      // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigIconTextPiece_C*             Decide;                                            // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           FieldMenuCanvas;                                   // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_FieldMenuCloser_C*                 FieldMenuCloser;                                   // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_1;                                       // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigHeader_C*                    WDT_ConfigHeader;                                  // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FConfigurationConsentTypeTags          ConsentTypeTag;                                    // 0x0628(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsStartUp;                                        // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, class FText>        HeaderTitileTextMap;                               // 0x0638(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        ScrollBaseSpeed;                                   // 0x0688(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScrollAccelerationSpeed;                           // 0x0690(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsOpenLanguageSelect;                             // 0x0698(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_699[0x7];                                      // 0x0699(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_ConfigLanguageSelectMenu_C*        ConsentLanguageSelectMenu;                         // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           ConsentLanguageSelectMenuContext;                  // 0x06A8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bIsVisibleTypeSelect;                              // 0x06E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnConsentTypeeChangeEvent;                         // 0x06E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsPressedDecide;                                  // 0x06F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F9[0x7];                                      // 0x06F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ConfigurationUIObject_C*            ConfigurationUIObject;                             // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressStarted;                                   // 0x0708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WDT_ConfigConsentPage_WDT_ConfigHeader_K2Node_ComponentBoundEvent_0_OnLanguageClickedEvent__DelegateSignature();
	void BndEvt__WDT_ConfigGamePage_WDT_ConfigHeader_K2Node_ComponentBoundEvent_2_OnBackClickedEvent__DelegateSignature();
	void ChangeSelectPieceVisibility(const struct FConfigurationConsentTypeTags& InTag);
	void ExecuteUbergraph_WDT_ConfigConsentPage(int32 EntryPoint);
	void GetConsentType(struct FGameplayTag* OutTag);
	void GetIsVisibleTypeSelect(const struct FGameplayTag& InConsentTypeTag, bool* NewParam);
	void InitializeLanguageSelectMenu();
	void InpActEvt_IA_UI_CancelOnRelease_K2Node_EnhancedInputActionEvent_8(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_DecideOnRelease_K2Node_EnhancedInputActionEvent_9(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Down_K2Node_EnhancedInputActionEvent_4(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Down_K2Node_EnhancedInputActionEvent_5(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Left_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_MenuSpecial2_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_MenuSpecial4_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Right_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Up_K2Node_EnhancedInputActionEvent_6(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Up_K2Node_EnhancedInputActionEvent_7(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void OnCancelRelease();
	void OnClose();
	void OnClosed();
	void OnCloseLanguageSelectMenu();
	void OnClosing();
	void OnConsentTypeChange();
	void OnDecideRelease();
	void OnDownPressed(double InElapsedSecond);
	void OnFieldMenuCloseAnimationFinish();
	class UWidgetAnimation* OnGetCloseAnimation();
	class UWidgetAnimation* OnGetOpenAnimation();
	void OnInitialized();
	void OnInputDeviceChanged();
	void OnLeftPressed();
	void OnMenuScecial4();
	void OnMouseEnterMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeaveMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeftClickMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnOpen();
	void OnOpened();
	void OnOpening();
	void OnRightPressed();
	void OnUpPressed(double InElapsedSecond);
	void OpenLanguageSelectMenu();
	void PreConstruct(bool IsDesignTime);
	void SaveConsentData();
	void ScrollDown(double InElapsedSecond);
	void ScrollUp(double InElapsedSecond);
	void SetConsentType(const struct FConfigurationConsentTypeTags& InTag, bool InIsStartUp);
	void UpdateHeader();
	void UpdateImageTexture();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ConfigConsentPage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ConfigConsentPage_C")
	}
	static class UWDT_ConfigConsentPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ConfigConsentPage_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ConfigConsentPage_C;

}

