#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_MatchingSelectableTextPiece

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EN_MatchingMenuType_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_MatchingSelectableTextPiece.WDT_MatchingSelectableTextPiece_C
// 0x0038 (0x0600 - 0x05C8)
class UWDT_MatchingSelectableTextPiece_C final : public UMenuPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ButtonBg;                                          // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                SelectionBack;                                     // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EN_MatchingMenuType                           MatchingMenuType;                                  // 0x05E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E9[0x7];                                      // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Title;                                             // 0x05F0(0x0010)(Edit, BlueprintVisible)

public:
	bool Select(bool PlayAnimation_0);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_WDT_MatchingSelectableTextPiece(int32 EntryPoint);
	bool Deselect(bool PlayAnimation_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_MatchingSelectableTextPiece_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_MatchingSelectableTextPiece_C")
	}
	static class UWDT_MatchingSelectableTextPiece_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_MatchingSelectableTextPiece_C>();
	}
};
DUMPER7_ASSERTS_UWDT_MatchingSelectableTextPiece_C;

}

