#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_VerticalResourceBar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_VerticalResourceBar.WDT_VerticalResourceBar_C
// 0x0100 (0x0700 - 0x0600)
class UWDT_VerticalResourceBar_C final : public UHudPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AmountAttentionAnimation;                          // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Effect;                                            // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ResourceBar;                                       // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentResource;                                   // 0x0620(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxResource;                                       // 0x0624(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RecoverableResource;                               // 0x0628(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62C[0x4];                                      // 0x062C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            StyleGaugeImage;                                   // 0x0630(0x00D0)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WDT_VerticalResourceBar(int32 EntryPoint);
	void GetFillBrush(struct FSlateBrush* NewParam);
	void GetResourcese(int32* CurrentResource_0, int32* MaxResource_0);
	void GetScrollerItem(class UScrollerItem** OutItem);
	void PreConstruct(bool IsDesignTime);
	void SetFillBrush(const struct FSlateBrush& NewParam);
	void SetMaxResource(int32 MaxResource_0);
	void SetResource(int32 CurrentResource_0);
	void SetScrollerItem(class UScrollerItem* InItem);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Update_Gauges();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_VerticalResourceBar_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_VerticalResourceBar_C")
	}
	static class UWDT_VerticalResourceBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_VerticalResourceBar_C>();
	}
};
DUMPER7_ASSERTS_UWDT_VerticalResourceBar_C;

}

