#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigMenuTextPiece

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_ConfigMenuTextPiece.WDT_ConfigMenuTextPiece_C.SetTitleText
// 0x0018 (0x0018 - 0x0000)
struct WDT_ConfigMenuTextPiece_C_SetTitleText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTextPiece_C_SetTitleText;

// Function WDT_ConfigMenuTextPiece.WDT_ConfigMenuTextPiece_C.SetEnableColor
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigMenuTextPiece_C_SetEnableColor final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTextPiece_C_SetEnableColor;

// Function WDT_ConfigMenuTextPiece.WDT_ConfigMenuTextPiece_C.SetDisableColor
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigMenuTextPiece_C_SetDisableColor final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTextPiece_C_SetDisableColor;

// Function WDT_ConfigMenuTextPiece.WDT_ConfigMenuTextPiece_C.Select
// 0x0002 (0x0002 - 0x0000)
struct WDT_ConfigMenuTextPiece_C_Select final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTextPiece_C_Select;

// Function WDT_ConfigMenuTextPiece.WDT_ConfigMenuTextPiece_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigMenuTextPiece_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTextPiece_C_PreConstruct;

// Function WDT_ConfigMenuTextPiece.WDT_ConfigMenuTextPiece_C.GetLogTexture
// 0x0030 (0x0030 - 0x0000)
struct WDT_ConfigMenuTextPiece_C_GetLogTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              OutTexture;                                        // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          OutIsSuccess;                                      // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTextPiece_C_GetLogTexture;

// Function WDT_ConfigMenuTextPiece.WDT_ConfigMenuTextPiece_C.GetLogMoviePath
// 0x0018 (0x0018 - 0x0000)
struct WDT_ConfigMenuTextPiece_C_GetLogMoviePath final
{
public:
	class FString                                 OutPath;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          OutIsSuccess;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTextPiece_C_GetLogMoviePath;

// Function WDT_ConfigMenuTextPiece.WDT_ConfigMenuTextPiece_C.ExecuteUbergraph_WDT_ConfigMenuTextPiece
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigMenuTextPiece_C_ExecuteUbergraph_WDT_ConfigMenuTextPiece final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTextPiece_C_ExecuteUbergraph_WDT_ConfigMenuTextPiece;

// Function WDT_ConfigMenuTextPiece.WDT_ConfigMenuTextPiece_C.Deselect
// 0x0002 (0x0002 - 0x0000)
struct WDT_ConfigMenuTextPiece_C_Deselect final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuTextPiece_C_Deselect;

}

