#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_LicenseDisplayMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_LicenseDisplayMenu.WDT_LicenseDisplayMenu_C
// 0x0030 (0x05E8 - 0x05B8)
class UWDT_LicenseDisplayMenu_C final : public UAppMenuBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URichTextBlock*                         IconText_Direction_Y;                              // 0x05C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_1;                                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TextBackGround;                                    // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_Piece_TrgText_C*                   WDT_Piece_TrgText;                                 // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        ScrollSpeed;                                       // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void OnOpening();
	void OnOpened();
	void OnMouseRightClickMenu();
	void OnMouseLeftClickMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeaveMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseEnterMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnInputDeviceChanged();
	void OnClosing();
	void OnClosed();
	void InpActEvt_IA_UI_Up_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Down_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Cancel_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void ExecuteUbergraph_WDT_LicenseDisplayMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_LicenseDisplayMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_LicenseDisplayMenu_C")
	}
	static class UWDT_LicenseDisplayMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_LicenseDisplayMenu_C>();
	}
};
DUMPER7_ASSERTS_UWDT_LicenseDisplayMenu_C;

}

