#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_TitleMenuEntryPiece

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_TitleMenuEntryPiece.WDT_TitleMenuEntryPiece_C.Blink
// 0x0010 (0x0010 - 0x0000)
struct WDT_TitleMenuEntryPiece_C_Blink final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_TitleMenuEntryPiece_C_Blink;

// Function WDT_TitleMenuEntryPiece.WDT_TitleMenuEntryPiece_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_TitleMenuEntryPiece_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_TitleMenuEntryPiece_C_BP_OnItemExpansionChanged;

// Function WDT_TitleMenuEntryPiece.WDT_TitleMenuEntryPiece_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_TitleMenuEntryPiece_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_TitleMenuEntryPiece_C_BP_OnItemSelectionChanged;

// Function WDT_TitleMenuEntryPiece.WDT_TitleMenuEntryPiece_C.Deselect
// 0x0002 (0x0002 - 0x0000)
struct WDT_TitleMenuEntryPiece_C_Deselect final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_TitleMenuEntryPiece_C_Deselect;

// Function WDT_TitleMenuEntryPiece.WDT_TitleMenuEntryPiece_C.ExecuteUbergraph_WDT_TitleMenuEntryPiece
// 0x0018 (0x0018 - 0x0000)
struct WDT_TitleMenuEntryPiece_C_ExecuteUbergraph_WDT_TitleMenuEntryPiece final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_TitleMenuEntryPiece_C_ExecuteUbergraph_WDT_TitleMenuEntryPiece;

// Function WDT_TitleMenuEntryPiece.WDT_TitleMenuEntryPiece_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WDT_TitleMenuEntryPiece_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_TitleMenuEntryPiece_C_OnListItemObjectSet;

// Function WDT_TitleMenuEntryPiece.WDT_TitleMenuEntryPiece_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_TitleMenuEntryPiece_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_TitleMenuEntryPiece_C_PreConstruct;

// Function WDT_TitleMenuEntryPiece.WDT_TitleMenuEntryPiece_C.Select
// 0x0010 (0x0010 - 0x0000)
struct WDT_TitleMenuEntryPiece_C_Select final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_TitleMenuEntryPiece_C_Select;

}

