#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Article_GadgetCapacity

#include "Basic.hpp"

#include "WDT_Status_PieceBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_Article_GadgetCapacity.WDT_Article_GadgetCapacity_C
// 0x0060 (0x0728 - 0x06C8)
class UWDT_Article_GadgetCapacity_C final : public UWDT_Status_PieceBase_C
{
public:
	class UWDT_ArticleDiffArrowElement_C*         Arrow_Conductivity;                                // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_Efficiency;                                  // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_Handling;                                    // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_Relicability;                                // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GadgeCapacity_Conductivity;                        // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GadgeCapacity_Efficiency;                          // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GadgeCapacity_Handling;                            // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GadgeCapacity_Reliability;                         // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GadgeLoad_Conductivity;                            // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GadgeLoad_Efficiency;                              // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GadgeLoad_Handling;                                // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             GadgeLoad_Reliability;                             // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetConductivityValue(int32 InCapacityValue, int32 InLoadValue);
	void SetConductivityValueComparison(int32 InCapacityCurrentValue, int32 InCapacityValue, int32 InLoadCurrentValue, int32 InLoadValue, bool CapacitySwapComparisons, bool LoadSwapComparisons);
	void SetConductivityValueComparisonLoadOnly(int32 InLoadCurrentValue, int32 InLoadValue, bool LoadSwapComparisons);
	void SetEfficiencyValue(int32 InCapacityValue, int32 InLoadValue);
	void SetEfficiencyValueComparison(int32 InCapacityCurrentValue, int32 InCapacityValue, int32 InLoadCurrentValue, int32 InLoadValue, bool CapacitySwapComparisons, bool LoadSwapComparisons);
	void SetEfficiencyValueComparisonLoadOnly(int32 InLoadCurrentValue, int32 InLoadValue, bool LoadSwapComparisons);
	void SetHandlingValue(int32 InCapacityValue, int32 InLoadValue);
	void SetHandlingValueComparison(int32 InCapacityCurrentValue, int32 InCapacityValue, int32 InLoadCurrentValue, int32 InLoadValue, bool CapacitySwapComparisons, bool LoadSwapComparisons);
	void SetHandlingValueComparisonLoadOnly(int32 InLoadCurrentValue, int32 InLoadValue, bool LoadSwapComparisons);
	void SetReliabilityValue(int32 InCapacityValue, int32 InLoadValue);
	void SetReliabilityValueComparison(int32 InCapacityCurrentValue, int32 InCapacityValue, int32 InLoadCurrentValue, int32 InLoadValue, bool CapacitySwapComparisons, bool LoadSwapComparisons);
	void SetReliabilityValueComparisonLoadOnly(int32 InLoadCurrentValue, int32 InLoadValue, bool LoadSwapComparisons);
	void SetValue(int32 InCapacityValue, int32 InLoadValue, class UTextBlock* CapacityText, class UTextBlock* LoadText);
	void SetValueComparison(int32 InCapacityCurrentValue, int32 InCapacityValue, int32 InLoadCurrentValue, int32 InLoadValue, class UTextBlock* CapacityText, class UTextBlock* LoadText, class UWDT_ArticleDiffArrowElement_C* Allow, bool CapacitySwapComparisons, bool LoadSwapComparisons);
	void SetValueComparisonLoadOnly(int32 InLoadCurrentValue, int32 InLoadValue, class UTextBlock* LoadText, bool LoadSwapComparisons);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_Article_GadgetCapacity_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_Article_GadgetCapacity_C")
	}
	static class UWDT_Article_GadgetCapacity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_Article_GadgetCapacity_C>();
	}
};
DUMPER7_ASSERTS_UWDT_Article_GadgetCapacity_C;

}

