#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_StatusUpEffectIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_StatusUpEffectIcon.WDT_StatusUpEffectIcon_C
// 0x0028 (0x0628 - 0x0600)
class UWDT_StatusUpEffectIcon_C final : public UHudPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_EffectType;                                  // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StatusEffectImage;                                 // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FStatusEffectIconHandle                IconHandle;                                        // 0x0618(0x0008)(Edit, BlueprintVisible, NoDestructor)
	class UMaterialInstanceDynamic*               DMI_StatusEffectIcon;                              // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	bool ClearSubTexture(class FName ImageId);
	bool ClearTexture();
	void Construct();
	void ExecuteUbergraph_WDT_StatusUpEffectIcon(int32 EntryPoint);
	bool FlipTexture(bool IsInverse);
	void MakeDMI();
	void PreConstruct(bool IsDesignTime);
	bool SetLazyTexture(const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	void SetStatusEffectIconInfo(const struct FStatusEffectIconHandle& InHandle, class UTexture2D* InTexture, class UTexture2D* InFrame);
	void SetStatusTimeElapsed(double InTimeElapsed, double InTimeTotal);
	bool SetSubLazyTexture(class FName ImageId, const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	bool SetSubTexture(class FName ImageId, class UTexture2D* Texture);
	bool SetTexture(class UTexture2D* Texture);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_StatusUpEffectIcon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_StatusUpEffectIcon_C")
	}
	static class UWDT_StatusUpEffectIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_StatusUpEffectIcon_C>();
	}
};
DUMPER7_ASSERTS_UWDT_StatusUpEffectIcon_C;

}

