#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_MapPhotoLogSymbol

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_MapPhotoLogSymbol.WDT_MapPhotoLogSymbol_C.SetTexture
// 0x0010 (0x0010 - 0x0000)
struct WDT_MapPhotoLogSymbol_C_SetTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapPhotoLogSymbol_C_SetTexture;

// Function WDT_MapPhotoLogSymbol.WDT_MapPhotoLogSymbol_C.SetSubTexture
// 0x0018 (0x0018 - 0x0000)
struct WDT_MapPhotoLogSymbol_C_SetSubTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapPhotoLogSymbol_C_SetSubTexture;

// Function WDT_MapPhotoLogSymbol.WDT_MapPhotoLogSymbol_C.SetSubLazyTexture
// 0x0038 (0x0038 - 0x0000)
struct WDT_MapPhotoLogSymbol_C_SetSubLazyTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              LazyTexture;                                       // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapPhotoLogSymbol_C_SetSubLazyTexture;

// Function WDT_MapPhotoLogSymbol.WDT_MapPhotoLogSymbol_C.SetLazyTexture
// 0x0030 (0x0030 - 0x0000)
struct WDT_MapPhotoLogSymbol_C_SetLazyTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              LazyTexture;                                       // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapPhotoLogSymbol_C_SetLazyTexture;

// Function WDT_MapPhotoLogSymbol.WDT_MapPhotoLogSymbol_C.GetWidth
// 0x0010 (0x0010 - 0x0000)
struct WDT_MapPhotoLogSymbol_C_GetWidth final
{
public:
	double                                        OutWidth;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_OutWidth_ImplicitCast;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapPhotoLogSymbol_C_GetWidth;

// Function WDT_MapPhotoLogSymbol.WDT_MapPhotoLogSymbol_C.GetHeight
// 0x0010 (0x0010 - 0x0000)
struct WDT_MapPhotoLogSymbol_C_GetHeight final
{
public:
	double                                        OutHeight;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_FunctionResult_OutHeight_ImplicitCast;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapPhotoLogSymbol_C_GetHeight;

// Function WDT_MapPhotoLogSymbol.WDT_MapPhotoLogSymbol_C.FlipTexture
// 0x0002 (0x0002 - 0x0000)
struct WDT_MapPhotoLogSymbol_C_FlipTexture final
{
public:
	bool                                          IsInverse;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapPhotoLogSymbol_C_FlipTexture;

// Function WDT_MapPhotoLogSymbol.WDT_MapPhotoLogSymbol_C.ClearTexture
// 0x0001 (0x0001 - 0x0000)
struct WDT_MapPhotoLogSymbol_C_ClearTexture final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapPhotoLogSymbol_C_ClearTexture;

// Function WDT_MapPhotoLogSymbol.WDT_MapPhotoLogSymbol_C.ClearSubTexture
// 0x000C (0x000C - 0x0000)
struct WDT_MapPhotoLogSymbol_C_ClearSubTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapPhotoLogSymbol_C_ClearSubTexture;

}

