#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_StatusSummary_Health

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_StatusSummary_Health.WDT_StatusSummary_Health_C.ExecuteUbergraph_WDT_StatusSummary_Health
// 0x0004 (0x0004 - 0x0000)
struct WDT_StatusSummary_Health_C_ExecuteUbergraph_WDT_StatusSummary_Health final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_StatusSummary_Health_C_ExecuteUbergraph_WDT_StatusSummary_Health;

// Function WDT_StatusSummary_Health.WDT_StatusSummary_Health_C.SetHealth
// 0x0050 (0x0050 - 0x0000)
struct WDT_StatusSummary_Health_C_SetHealth final
{
public:
	double                                        InHealth;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InMaxHealth;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0010)()
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_InRange_FloatFloat_ReturnValue;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0030(0x0010)()
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0040(0x0010)()
};
DUMPER7_ASSERTS_WDT_StatusSummary_Health_C_SetHealth;

// Function WDT_StatusSummary_Health.WDT_StatusSummary_Health_C.SetHealthComparison
// 0x0010 (0x0010 - 0x0000)
struct WDT_StatusSummary_Health_C_SetHealthComparison final
{
public:
	int32                                         InMaxHealthCurrent;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxHealth;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxLPCurrent;                                    // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxLP;                                           // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_StatusSummary_Health_C_SetHealthComparison;

// Function WDT_StatusSummary_Health.WDT_StatusSummary_Health_C.SetLP
// 0x0028 (0x0028 - 0x0000)
struct WDT_StatusSummary_Health_C_SetLP final
{
public:
	int32                                         InLP;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InMaxLP;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0018(0x0010)()
};
DUMPER7_ASSERTS_WDT_StatusSummary_Health_C_SetLP;

}

