#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfirmOptionButton

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_ConfirmOptionButton.WDT_ConfirmOptionButton_C.Deselect
// 0x0002 (0x0002 - 0x0000)
struct WDT_ConfirmOptionButton_C_Deselect final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfirmOptionButton_C_Deselect;

// Function WDT_ConfirmOptionButton.WDT_ConfirmOptionButton_C.OnMenuPieceHighlight
// 0x0002 (0x0002 - 0x0000)
struct WDT_ConfirmOptionButton_C_OnMenuPieceHighlight final
{
public:
	bool                                          bPlayAnimation;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfirmOptionButton_C_OnMenuPieceHighlight;

// Function WDT_ConfirmOptionButton.WDT_ConfirmOptionButton_C.OnMenuPieceUnhighlight
// 0x0002 (0x0002 - 0x0000)
struct WDT_ConfirmOptionButton_C_OnMenuPieceUnhighlight final
{
public:
	bool                                          bPlayAnimation;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfirmOptionButton_C_OnMenuPieceUnhighlight;

// Function WDT_ConfirmOptionButton.WDT_ConfirmOptionButton_C.Select
// 0x0002 (0x0002 - 0x0000)
struct WDT_ConfirmOptionButton_C_Select final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfirmOptionButton_C_Select;

// Function WDT_ConfirmOptionButton.WDT_ConfirmOptionButton_C.SetOptionText
// 0x0010 (0x0010 - 0x0000)
struct WDT_ConfirmOptionButton_C_SetOptionText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WDT_ConfirmOptionButton_C_SetOptionText;

}

