#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_InventoryMenu

#include "Basic.hpp"

#include "EN_InventoryMenuDialogType_structs.hpp"
#include "Engine_structs.hpp"
#include "STR_InventoryCategoryPalletInfo_structs.hpp"
#include "BasicUI_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_InventoryMenu.WDT_InventoryMenu_C
// 0x0228 (0x07E0 - 0x05B8)
class UWDT_InventoryMenu_C final : public UAppMenuBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CloseAnim;                                         // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OpenAnim;                                          // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWDT_ArticleInfo_C*                     ArticleInfoPanel;                                  // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_FieldMenuCloser_C*                 FieldMenuCloser;                                   // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           FullscreenCanvas;                                  // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_EquipmentDisable;                            // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           InventoryContainer;                                // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridScroller*                          InventoryGridBox;                                  // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ListOrEmptySwitcher;                               // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MenuWindowZ;                                       // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_Piece_TrgText_C*                   TrgGuidePartsUse;                                  // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_CategoryPallet_C*                  WDT_CategoryPallet;                                // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_GridBoxEmptyText_C*                WDT_GridBoxEmptyText;                              // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_SpecialBuffList_C*                 WDT_SpecialBuffList;                               // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFieldMenuUIObject*                     FieldMenuUIObject;                                 // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSTR_InventoryCategoryPalletInfo> CategoryInfos;                                   // 0x0638(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsInputFirstStarted;                               // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x3];                                      // 0x0649(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PrevCategory;                                      // 0x064C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInputHorizonFirstStarted;                        // 0x0650(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_651[0x7];                                      // 0x0651(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuContext                           InventoryMenuContext;                              // 0x0658(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FText                                   UseOneText;                                        // 0x0690(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UseAllText;                                        // 0x06A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DiscardOneText;                                    // 0x06B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DiscardAllText;                                    // 0x06C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EN_InventoryMenuDialogType>            MenuTypes;                                         // 0x06D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         LazyScrollTargetIndex;                             // 0x06E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E4[0x4];                                      // 0x06E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CloseText;                                         // 0x06E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UnequippedWeaponText;                              // 0x06F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UnequippedJailText;                                // 0x0708(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UnequippedBoosterText;                             // 0x0718(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UnequippedWeaponGadgetText;                        // 0x0728(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UnequippedDefensiveGadgetText;                     // 0x0738(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UnequippedIndependentGadgetText;                   // 0x0748(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UseAndDiscardText;                                 // 0x0758(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   UseText;                                           // 0x0768(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DiscardText;                                       // 0x0778(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         LastSelectionListIndex;                            // 0x0788(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastSelectingCategoryIndex;                        // 0x078C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EN_InventoryMenuDialogType                    MenuDialogDecideType;                              // 0x0790(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_791[0x7];                                      // 0x0791(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWDT_InventoryMenuDialog_C*             InventoryMenuDialog;                               // 0x0798(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FMenuContext                           DiscardConfirmDialogContext;                       // 0x07A0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          InInitializeStep;                                  // 0x07D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BackToFieldMenu(int32 WeaponSlotIndex);
	void BndEvt__WDT_InventoryMenu_InventoryGridBox_K2Node_ComponentBoundEvent_0_OnListEntryInitializedDynamic__DelegateSignature(class UObject* Item, class UUserWidget* Widget);
	void BndEvt__WDT_InventoryMenu_InventoryGridBox_K2Node_ComponentBoundEvent_1_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__WDT_InventoryMenu_InventoryGridBox_K2Node_ComponentBoundEvent_2_OnItemIsHoveredChangedDynamic__DelegateSignature(class UObject* Item, bool bIsHovered);
	void BndEvt__WDT_InventoryMenu_InventoryGridBox_K2Node_ComponentBoundEvent_3_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void BP_OnItemScrolledIntoView_Event(class UObject* Item, class UUserWidget* Widget);
	void Construct();
	void ExecuteUbergraph_WDT_InventoryMenu(int32 EntryPoint);
	void GetArticleCategory(int32 CategoryIndex, EUIMainCategory* MainCategory, EUIArticleCategory* ArticleCategory, EUIItemCategory* ItemCategory);
	void GetArticleName(int32 InIndex, class FText* Name_0);
	void GetArticleNameForRecentlyObtained(int32 InIndex, class FText* OutName);
	const int32 GetCategoryNumber();
	void GetDialogCaptionText(TArray<EN_InventoryMenuDialogType>& InMenuTypes, class FText* Caption);
	void GetSubMenuGuideText(int32 InArticleCategory, int32 InSelectArticleIndex, class FText* GuideText);
	bool In_Item_Usable(EUIMainCategory InMainCategory, int32 InIndex);
	void Initialize();
	void InpActEvt_IA_UI_CancelOnRelease_K2Node_EnhancedInputActionEvent_17(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_DecideOnRelease_K2Node_EnhancedInputActionEvent_18(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Down_K2Node_EnhancedInputActionEvent_13(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Down_K2Node_EnhancedInputActionEvent_14(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_FieldMenu_K2Node_EnhancedInputActionEvent_8(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Left_K2Node_EnhancedInputActionEvent_11(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Left_K2Node_EnhancedInputActionEvent_12(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_MenuSpecial2_K2Node_EnhancedInputActionEvent_7(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_MenuSpecial3_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_MenuSpecial4_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Right_K2Node_EnhancedInputActionEvent_10(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Right_K2Node_EnhancedInputActionEvent_9(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchLeft_K2Node_EnhancedInputActionEvent_5(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchLeft_K2Node_EnhancedInputActionEvent_6(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchRight_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchRight_K2Node_EnhancedInputActionEvent_4(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_TriggerRight_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Up_K2Node_EnhancedInputActionEvent_15(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Up_K2Node_EnhancedInputActionEvent_16(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InventoryMenuCanvas_Event(class UCanvasPanel* InventoryMenuCanvas);
	void InventoryMenuCanvas_Event_Close(class UCanvasPanel* InventoryMenuCanvas);
	bool IsShowSpecialBuffList();
	void IsVisibleSubMenuGuide(int32 InArticleCategory, bool* IsVisible_0);
	void MakeArticleMenu(int32 InIndex, TArray<EN_InventoryMenuDialogType>* OptionTypes);
	void MakeArticleMenuForRecentlyObtained(int32 InIndex, TArray<EN_InventoryMenuDialogType>* OptionTypes);
	void MakeMenuOptionTexts(TArray<EN_InventoryMenuDialogType>& OptionTypes, TArray<class FText>* OptionTextArray);
	void OnCancelReleased();
	void OnCategoryIndexChanged(int32 Index_0);
	void OnClosed();
	void OnDecideReleased();
	void OnDiscardArticle(bool IsSingle);
	void OnDiscardArticleForRecentlyObtained(int32 InIndex, bool InIsSingle);
	void OnDiscardDialogDecided(uint8 DecideOptionNumber);
	void OnDownPressed(bool InCanWrap);
	void OnFieldMenuButtonReleased();
	void OnFieldMenuCloseAnimationFinish();
	class UWidgetAnimation* OnGetCloseAnimation();
	class UWidgetAnimation* OnGetOpenAnimation();
	void OnInputDeviceChanged();
	void OnInventoryMenuDialogClosed();
	void OnInventoryMenuDialogDecided(uint8 DecideOptionNumber);
	void OnLazyScroll();
	void OnLeftPressed(bool InCanWarp);
	void OnMenuInitialized();
	void OnMenuSpecial2Pressed();
	void OnNotifyPlayerHealthUpdated(double InCurrentHealth, double InMaxHealth);
	void OnNotifyPlayerStaminaUpdated(int32 InCurrentStamina, int32 InMaxStamina);
	void OnNotifyPlayerStatusUpdated();
	void OnOpening();
	void OnRightPressed(bool InCanWarp);
	void OnUpdateDisplay();
	void OnUpdateDisplayImplement();
	void OnUpPressed(bool InCanWrap);
	void OnUseArticle(bool IsSingle);
	void PreConstruct(bool IsDesignTime);
	void SelectByDirection(EDirectionKey InDirection);
	void SequenceEvent__ENTRYPOINTWDT_InventoryMenu(class UCanvasPanel* InventoryMenuCanvas);
	void SequenceEvent__ENTRYPOINTWDT_InventoryMenu_0(class UCanvasPanel* InventoryMenuCanvas);
	void SetArticleInfo(const int32 InIndex);
	void SetArticleInfoForRecentlyObtained(int32 InIndex);
	void SetProhibited(bool InProhibited);
	void Update_List_Thumbnail_for_Recentrly_Obtained(class UUserWidget* InTarget, int32 InIndex);
	void UpdateListThumbnail(class UUserWidget* InTarget, const int32 InIndex);
	void UpdateProhibited();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_InventoryMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_InventoryMenu_C")
	}
	static class UWDT_InventoryMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_InventoryMenu_C>();
	}
};
DUMPER7_ASSERTS_UWDT_InventoryMenu_C;

}

