#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigMenuInputTextPiece

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WDT_ConfigPieceBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ConfigMenuInputTextPiece.WDT_ConfigMenuInputTextPiece_C
// 0x0060 (0x0698 - 0x0638)
class UWDT_ConfigMenuInputTextPiece_C final : public UWDT_ConfigPieceBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WDT_ConfigMenuInputTextPiece_C;     // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWDT_ConfigTextElement_C*               WDT_ConfigTextElement;                             // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigTextInputPiece_C*            WDT_ConfigTextInputElement;                        // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DefaultText;                                       // 0x0650(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UTexture2D>              ImageTexture;                                      // 0x0660(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FString                                 MoviePath;                                         // 0x0688(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void UpdateTextStyle();
	void SetText(const class FText& InText);
	void SetIsEditable(bool InFlag);
	void SetInputModeCancell();
	void SetDefaultText(const class FText& InInitializeText, const class FText& InDefaultText);
	void Set_Input_Mode();
	bool Select(bool PlayAnimation_0);
	void RefreshKeyImage();
	void PreConstruct(bool IsDesignTime);
	void OnMouseLeaveSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseEnterSubPiece(class UMenuPieceBase* MenuPiece);
	void OnDecideReleased();
	void OnCancelReleased();
	void InitializeToDefaultValue();
	void GetText(class FText* OutText);
	void GetLogTexture(TSoftObjectPtr<class UTexture2D>* OutTexture, bool* OutIsSuccess);
	void GetLogMoviePath(class FString* OutPath, bool* OutIsSuccess);
	void ExecuteUbergraph_WDT_ConfigMenuInputTextPiece(int32 EntryPoint);
	bool Deselect(bool PlayAnimation_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ConfigMenuInputTextPiece_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ConfigMenuInputTextPiece_C")
	}
	static class UWDT_ConfigMenuInputTextPiece_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ConfigMenuInputTextPiece_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ConfigMenuInputTextPiece_C;

}

