#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Status_PieceBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_classes.hpp"
#include "EN_Anchor_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_Status_PieceBase.WDT_Status_PieceBase_C
// 0x0100 (0x06C8 - 0x05C8)
class UWDT_Status_PieceBase_C : public UArticleInfoMenuPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             ExtensionSlot;                                     // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MouseArea;                                         // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectImage;                                       // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   HelpTitle;                                         // 0x05E8(0x0010)(Edit, BlueprintVisible)
	class FText                                   HelpText;                                          // 0x05F8(0x0010)(Edit, BlueprintVisible)
	class FText                                   HelpTextArg;                                       // 0x0608(0x0010)(Edit, BlueprintVisible)
	EN_Anchor                                     TargetAnchor;                                      // 0x0618(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_619[0x7];                                      // 0x0619(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UClass*, EN_Anchor>                OverrideTargetAnchor;                              // 0x0620(0x0050)(Edit, BlueprintVisible)
	EN_Anchor                                     HelpAnchor;                                        // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_671[0x7];                                      // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UClass*, EN_Anchor>                OverrideHelpAnchor;                                // 0x0678(0x0050)(Edit, BlueprintVisible)

public:
	void GetActualAnchor(EN_Anchor InDefaultAnchor, class UClass*& InParentMenuClass, TMap<class UClass*, EN_Anchor>& InOverrideAnchorMap, EN_Anchor* OutAnchor);
	void MakeAlignment(EN_Anchor InAnchor, struct FVector2D* Alignment);
	void MakeCoordinate(class UWidget* Widget, EN_Anchor Anchor, struct FVector2D* Coordinate);
	bool IsSelectable();
	bool Deselect(bool PlayAnimation_0);
	bool Select(bool PlayAnimation_0);
	void SetHelpWindowPosition(class UWDT_ParameterHelp_C* InHelpWindow, class UClass* InParentClass);
	void ExecuteUbergraph_WDT_Status_PieceBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_Status_PieceBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_Status_PieceBase_C")
	}
	static class UWDT_Status_PieceBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_Status_PieceBase_C>();
	}
};
DUMPER7_ASSERTS_UWDT_Status_PieceBase_C;

}

