#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_DescriptionLog

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_DescriptionLog.WDT_DescriptionLog_C
// 0x00B0 (0x0570 - 0x04C0)
class UWDT_DescriptionLog_C final : public UUIElementBase
{
public:
	class UImage*                                 DescriptionImage;                                  // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         DescriptionText;                                   // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       DescriptionTitle;                                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Bokashi;                                     // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MI_UI_DesVFX2;                                     // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentPageIndex;                                  // 0x04E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDescriptionInfoTable                  CurrentDescriptionData;                            // 0x04F0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FInstructionInfoTable                  CurrentInstructionData;                            // 0x0528(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void UpdateInstruction();
	void UpdateDescription();
	void ToRightPage();
	void ToLeftPage();
	void SetPageIndex(int32 InIndex);
	void SetInstruction(const struct FInstructionInfoTable& InInstructionData);
	void SetDescription(const struct FDescriptionInfoTable& InDescriptionData);
	void ClearDescription();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_DescriptionLog_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_DescriptionLog_C")
	}
	static class UWDT_DescriptionLog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_DescriptionLog_C>();
	}
};
DUMPER7_ASSERTS_UWDT_DescriptionLog_C;

}

