#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_MatchingCharacterIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_MatchingCharacterIndicator.WDT_MatchingCharacterIndicator_C
// 0x0048 (0x0508 - 0x04C0)
class UWDT_MatchingCharacterIndicator_C final : public UUIElementBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Name_0;                                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           RootBox;                                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   TargetSocket;                                      // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 TargetSkeletalMesh;                                // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AttachOffset;                                      // 0x04F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WDT_MatchingCharacterIndicator(int32 EntryPoint);
	void SetName(const class FText& InName);
	bool SetPosition(const struct FVector& InWorldPosition);
	bool SetTargetActor(class AActor* InTargetActor, class FName InTargetSocket);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateHUDPosition();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_MatchingCharacterIndicator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_MatchingCharacterIndicator_C")
	}
	static class UWDT_MatchingCharacterIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_MatchingCharacterIndicator_C>();
	}
};
DUMPER7_ASSERTS_UWDT_MatchingCharacterIndicator_C;

}

