#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_DescriptionLog

#include "Basic.hpp"

#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function WDT_DescriptionLog.WDT_DescriptionLog_C.UpdateDescription
// 0x0001 (0x0001 - 0x0000)
struct WDT_DescriptionLog_C_UpdateDescription final
{
public:
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_DescriptionLog_C_UpdateDescription;

// Function WDT_DescriptionLog.WDT_DescriptionLog_C.ToRightPage
// 0x0010 (0x0010 - 0x0000)
struct WDT_DescriptionLog_C_ToRightPage final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_DescriptionLog_C_ToRightPage;

// Function WDT_DescriptionLog.WDT_DescriptionLog_C.ToLeftPage
// 0x0008 (0x0008 - 0x0000)
struct WDT_DescriptionLog_C_ToLeftPage final
{
public:
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_DescriptionLog_C_ToLeftPage;

// Function WDT_DescriptionLog.WDT_DescriptionLog_C.SetPageIndex
// 0x0004 (0x0004 - 0x0000)
struct WDT_DescriptionLog_C_SetPageIndex final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_DescriptionLog_C_SetPageIndex;

// Function WDT_DescriptionLog.WDT_DescriptionLog_C.SetInstruction
// 0x0048 (0x0048 - 0x0000)
struct WDT_DescriptionLog_C_SetInstruction final
{
public:
	struct FInstructionInfoTable                  InInstructionData;                                 // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WDT_DescriptionLog_C_SetInstruction;

// Function WDT_DescriptionLog.WDT_DescriptionLog_C.SetDescription
// 0x0038 (0x0038 - 0x0000)
struct WDT_DescriptionLog_C_SetDescription final
{
public:
	struct FDescriptionInfoTable                  InDescriptionData;                                 // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WDT_DescriptionLog_C_SetDescription;

}

