#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_SaveDataSelectMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicUI_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_SaveDataSelectMenu.WDT_SaveDataSelectMenu_C
// 0x01C0 (0x0778 - 0x05B8)
class UWDT_SaveDataSelectMenu_C final : public UAppMenuBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       GameStart_Close;                                   // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Overlay_SelectedSaveData_Close;                    // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Overlay_SelectedSaveData_Open;                     // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_SelectedSaveData;                          // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListScroller*                          SaveDataList;                                      // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_SaveDataSelectListElementPiece_C*  SelectedSaveDataElementPiece;                      // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_Piece_TrgText_C*                   WDT_Piece_TrgText;                                 // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_SaveDataSelectTrgGuide_C*          WDT_SaveDataSelectTrgGuide;                        // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UBP_SaveDataSelectItem_C*>       SaveDataListItems;                                 // 0x0608(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_SaveDataMenuUIObject_C*             SaveDataSelectUIObject;                            // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 Index)>   OnSaveDataSelectEvent;                             // 0x0620(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FMenuContext                           DialogContext;                                     // 0x0630(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FText                                   SelectDialogText;                                  // 0x0668(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DeleteDialogText;                                  // 0x0678(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DeleteDialogTextForCleared;                        // 0x0688(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FMenuContext                           WarningDialogContext;                              // 0x0698(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FText                                   WarningDialogText;                                 // 0x06D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsGameStart;                                       // 0x06E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameFlowTitleMenuType                        L_MenuType;                                        // 0x06E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E2[0x6];                                      // 0x06E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuContext                           HistorySlotDialog;                                 // 0x06E8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                         CurrentSelectionSaveSlot;                          // 0x0720(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAddMappingContext;                               // 0x0724(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_725[0x3];                                      // 0x0725(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentSelectionSaveIndex;                         // 0x0728(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72C[0x4];                                      // 0x072C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuContext                           ErrorDialog;                                       // 0x0730(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FText                                   NotEnoughDLCErrorText;                             // 0x0768(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__WDT_SaveDataSelectMenu_SaveDataList_K2Node_ComponentBoundEvent_0_OnItemIsHoveredChangedDynamic__DelegateSignature(class UObject* Item, bool bIsHovered);
	void BndEvt__WDT_SaveDataSelectMenu_SaveDataList_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__WDT_SaveDataSelectMenu_SaveDataList_K2Node_ComponentBoundEvent_2_OnListEntryReleasedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__WDT_SaveDataSelectMenu_SaveDataList_K2Node_ComponentBoundEvent_3_OnListEntryInitializedDynamic__DelegateSignature(class UObject* Item, class UUserWidget* Widget);
	void ExecuteUbergraph_WDT_SaveDataSelectMenu(int32 EntryPoint);
	void HideSelectedSaveDataElement();
	void InpActEvt_IA_UI_CancelOnRelease_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_DecideOnRelease_K2Node_EnhancedInputActionEvent_5(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Down_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_MenuSpecial1_K2Node_EnhancedInputActionEvent_4(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_MenuSpecial2_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Up_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void OnClosed();
	void OnClosedDeleteDialog();
	void OnClosedErrorDialog();
	void OnClosedHistorySaveDataDialog();
	void OnClosedSelectDialog();
	void OnDecidedDeleteDialog(uint8 DecideOptionNumber);
	void OnDecidedReleased();
	void OnDecidedSelectDialog(uint8 DecideOptionNumber);
	void OnDecidedSelectHistorySaveData(uint8 DecideOptionNumber);
	void OnDecidedWarningDialog(uint8 DecideOptionNumber);
	void OnDeleteSaveData();
	void OnGameStart(int32 InSelectSlot);
	void OnInputDeviceChanged();
	void OnMenuInitialized();
	void OnMouseEnterMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeaveMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeftClickMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnOpened();
	void OnScreenMaskCompleted();
	void OpenInvalidSlotDialog(EUISaveDataStatus InSlotStatus);
	void OpenNotEnoughDLCErrorDialog(TArray<EDLCType>& NotEnoughDLCs);
	void ShowHistorySaveDataSlotDialog();
	void ShowSelectedSaveDataElement();
	void WidgetAnimationEvt_GameStart_Close_K2Node_WidgetAnimationEvent_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_SaveDataSelectMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_SaveDataSelectMenu_C")
	}
	static class UWDT_SaveDataSelectMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_SaveDataSelectMenu_C>();
	}
};
DUMPER7_ASSERTS_UWDT_SaveDataSelectMenu_C;

}

