#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigKeyAssignPage

#include "Basic.hpp"

#include "STR_ConfigKeyAssignDuplicationKeyItem_structs.hpp"
#include "Engine_structs.hpp"
#include "BasicUI_structs.hpp"
#include "STR_ConfigKeyAssignEntryBaseList_structs.hpp"
#include "WDT_ConfigStandardPageBase_classes.hpp"
#include "Extensions_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ConfigKeyAssignPage.WDT_ConfigKeyAssignPage_C
// 0x0528 (0x0B00 - 0x05D8)
class UWDT_ConfigKeyAssignPage_C final : public UWDT_ConfigStandardPageBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_FieldMenuCloser_C*                 FieldMenuCloser;                                   // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_193;                                 // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_KeyboardAndMouse;                    // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListScroller*                          ListScroller_88;                                   // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_DuplicationText;                           // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_ConsoleOnly;                                // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_GamePad;                                      // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigHeader_C*                    WDT_ConfigHeader;                                  // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigKeyAssignEditSelect_C*       WDT_ConfigKeyAssignEditSelect;                     // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigKeyAssignTrgGuide_C*         WDT_ConfigKeyAssignTrgGuide;                       // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigLog_C*                       WDT_ConfigLog;                                     // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_GamePadDualshock_C*                WDT_GamePadDualshock;                              // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_GamePadXController_C*              WDT_GamePadXController;                            // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_40;                                 // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsEditMode;                                       // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ConfigurationUIObject_C*            ConfigurationUIObject;                             // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FSTR_ConfigKeyAssignEntryBaseList> MainKeyEntryList;                    // 0x0668(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FSTR_ConfigKeyAssignEntryBaseList> PlayerKeyEntryList;                  // 0x06B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FSTR_ConfigKeyAssignEntryBaseList> MountKeyEntryList;                   // 0x0708(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FKey>                           AddKeyList;                                        // 0x0758(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FKey>                           ReleaseKeyList;                                    // 0x0768(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSTR_ConfigKeyAssignDuplicationKeyItem> NewDuplicationKeyEntryList;                // 0x0778(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSTR_ConfigKeyAssignDuplicationKeyItem> OldDuplicationEntryList;                   // 0x0788(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsAssignGamePad;                                  // 0x0798(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_799[0x3];                                      // 0x0799(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxAssignKey;                                      // 0x079C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxDuplicationKeyItemNameDisplayNum;               // 0x07A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A4[0x4];                                      // 0x07A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, class FText>        RequiredAssignInpuActionTextMap;                   // 0x07A8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly)
	double                                        GameMessageDuration;                               // 0x07F8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDialogBase*                            InitializeAllDialog;                               // 0x0800(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDialogBase*                            DuplicationKeyDialog;                              // 0x0808(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FDialogInfo                            InitializeAllDialogInfo;                           // 0x0810(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FDialogInfo                            DuplicationKeyDialogInfo;                          // 0x0868(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FMenuContext                           DuplicationDialogContext;                          // 0x08C0(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FMenuContext                           DuplicationKeyYesNoDialogContext;                  // 0x08F8(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FDialogInfo                            DuplicationKeyYesNoDialogInfo;                     // 0x0930(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsOpenDialog;                                     // 0x0988(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsOpenDuplicationDialog;                          // 0x0989(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSelectYesDuplicationDialog;                     // 0x098A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_98B[0x5];                                      // 0x098B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        KeyAssignAllInitializePressedTime;                 // 0x0990(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        KeyAsignInitializeReceptionTime;                   // 0x0998(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   DuplicationKeyEtcText;                             // 0x09A0(0x0010)(Edit, BlueprintVisible)
	TArray<struct FGameplayTag>                   DefaultDuplicationKeyList;                         // 0x09B0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TArray<struct FSTR_ConfigKeyAssignDuplicationKeyItem> NewChangeDuplicationKeyEntryList;          // 0x09C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSTR_ConfigKeyAssignDuplicationKeyItem> OldChangeDuplicationKeyEntryList;          // 0x09D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   EditKeyAssignMessageText;                          // 0x09E0(0x0010)(Edit, BlueprintVisible)
	class FText                                   ApplyKeyAssignMessageText;                         // 0x09F0(0x0010)(Edit, BlueprintVisible)
	class FText                                   InitializeKeyAssignMessageText;                    // 0x0A00(0x0010)(Edit, BlueprintVisible)
	class FText                                   InitializeAllKeyAssignMessageText;                 // 0x0A10(0x0010)(Edit, BlueprintVisible)
	class FText                                   SwapKeyAssignMessageText;                          // 0x0A20(0x0010)(Edit, BlueprintVisible)
	class FText                                   CancelKeyAssignMessageText;                        // 0x0A30(0x0010)(Edit, BlueprintVisible)
	EConfigKeyType                                AssignKeyType;                                     // 0x0A40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A41[0x7];                                      // 0x0A41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, class FText>        AssignDisableMessageTextMap;                       // 0x0A48(0x0050)(Edit, BlueprintVisible)
	struct FMenuContext                           InitializeAllDialogContext;                        // 0x0A98(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<struct FKey>                           ProhibitedKeyList;                                 // 0x0AD0(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FKey                                   ProhibitedKey_QWERTZ;                              // 0x0AE0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bIsInputPressedGamePadKey;                         // 0x0AF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddMountKeyAssignEntryMap(class FName InCategoryKey, class UBP_ConfigKeyAssignEntryBase_C* InItem);
	void AddPlayerKeyAssignEntryMap(class FName InCategoryKey, class UBP_ConfigKeyAssignEntryBase_C* InItem);
	void ApplyAllKey();
	void AssignCancelCheck();
	void BndEvt__WDT_ConfigGamePage_WDT_ConfigHeader_K2Node_ComponentBoundEvent_2_OnBackClickedEvent__DelegateSignature();
	void BndEvt__WDT_ConfigKeyAssignPage_ListScroller_88_K2Node_ComponentBoundEvent_4_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__WDT_ConfigKeyAssignPage_ListScroller_88_K2Node_ComponentBoundEvent_5_OnItemIsHoveredChangedDynamic__DelegateSignature(class UObject* Item, bool bIsHovered);
	void BndEvt__WDT_ConfigKeyAssignPage_WDT_ConfigHeader_K2Node_ComponentBoundEvent_0_OnTabItemClickedEvent__DelegateSignature(int32 TabIndex);
	void ChangeEditKeyAssign(const struct FKey& InKey, bool bIsReleaseKey);
	void CheckEqualKey(TArray<struct FKey>& InKey1, TArray<struct FKey>& InKey2, bool* OutFlag);
	void CheckIsAssignEnable(EConfigKeyAssignEnableType InAssignType, EConfigKeyType InKeyType, bool* OutFlag);
	void Construct();
	void DelayActivate();
	void EndEditMode();
	void ExecuteUbergraph_WDT_ConfigKeyAssignPage(int32 EntryPoint);
	void GetCurrentCategoryName(class FName* OutCategoryName);
	void GetDefaultMoveAndLookKey(class FName InRowName, TArray<struct FKey>* OutGamePadKey, TArray<struct FKey>* OutKeyboardKey_Main);
	void GetInitializeButtonAssignKey(const struct FGameplayTag& InTag, TArray<struct FKey>* OutGamePadKeyList, TArray<struct FKey>* OutKeyboardKeyList_Main, TArray<struct FKey>* OutKeyboardKeyList_Sub);
	void GetInitializeKey(const struct FGameplayTag& InTag, class FName InRowName, TArray<struct FKey>* OutDefaultGamePadKeyList, TArray<struct FKey>* OutDefaultKeyboardKeyList_Main, TArray<struct FKey>* OutDefaultKeyboardKeyList_Sub, TArray<struct FKey>* OutGamePadKeyList, TArray<struct FKey>* OutKeyboardKeyList_Main, TArray<struct FKey>* OutKeyboardKeyList_Sub);
	void GetInitializeMoveAndLookKey(class FName InRowName, TArray<struct FKey>* OutGamePadKey, TArray<struct FKey>* OutKeyboardKey_Main);
	void GetSelectKeyEntry(class UBP_ConfigKeyAssignEntryBase_C** OutKeyEntry);
	void HasUneditableKey(bool* bHasUneditableKey);
	void InitializeAllKeyAssign();
	void InitializeKeyAssign(class UBP_ConfigKeyAssignEntryBase_C* InKeyEntry);
	void InitializeKeyEntry();
	void InpActEvt_AnyKey_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_AnyKey_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_IA_UI_CancelOnRelease_K2Node_EnhancedInputActionEvent_15(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_DecideOnRelease_K2Node_EnhancedInputActionEvent_14(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Down_K2Node_EnhancedInputActionEvent_16(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Down_K2Node_EnhancedInputActionEvent_17(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_KeyAssignInitialize_K2Node_EnhancedInputActionEvent_10(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_KeyAssignInitialize_K2Node_EnhancedInputActionEvent_11(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_KeyAssignInitialize_K2Node_EnhancedInputActionEvent_12(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_KeyAssignRemove_K2Node_EnhancedInputActionEvent_9(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Left_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Left_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_MenuSpecial2_K2Node_EnhancedInputActionEvent_13(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_MenuSpecial4_K2Node_EnhancedInputActionEvent_8(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Right_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Right_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchLeft_K2Node_EnhancedInputActionEvent_6(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchLeft_K2Node_EnhancedInputActionEvent_7(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchRight_K2Node_EnhancedInputActionEvent_4(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchRight_K2Node_EnhancedInputActionEvent_5(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Up_K2Node_EnhancedInputActionEvent_18(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Up_K2Node_EnhancedInputActionEvent_19(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void IsKeyboardOnly(EConfigKeyAssignEnableType InKeyAssignEnableType, bool* OutIsKeyboardOnly);
	void MakeDuplicationEntryList(class UBP_ConfigKeyAssignEntryBase_C* InSelectKeyEntry, TArray<struct FKey>& InCheckKey, EConfigKeyType InAssignType, TArray<struct FSTR_ConfigKeyAssignDuplicationKeyItem>* OutDuplicateKeyEntry);
	void MoveAssignKeyType(int32 InIncrement, bool bInCanWarp);
	void MoveCategory(int32 InIncrement);
	void MoveSelectItem(int32 InIncrement, bool bInCanWarp);
	void OnCancelReleased();
	void OnClosed();
	void OnCloseDuplicationKeyDialog();
	void OnCloseDuplicationKeyYesNoDialog();
	void OnCloseInitializeAllDialog();
	void OnClosing();
	void OnDecideDuplicationKeyDialogOption(uint8 InSelectOption);
	void OnDecideDuplicationKeyYesNoDialogOption(uint8 InSelectOption);
	void OnDecideInitializeAllDialogOption(uint8 InSelectOption);
	void OnDecideRelease();
	void OnEndAssignMode();
	void OnFieldMenuCloseAnimationFinish();
	void OnInputDeviceChanged();
	void OnKeyAssignInitializeRelease(double InElapsedSeconds);
	void OnKeyAssignInitializeTriggered(double InElapsedSeconds);
	void OnKeyAssignRemove();
	void OnMenuInitialized();
	void OnMenuScecial4();
	void OnMenuSpecial2();
	void OnMouseKeyTypeChanged(class UBP_ConfigKeyAssignEntryBase_C* InEntry, EConfigKeyType InKeyType);
	void OnOpened();
	void OnOpening();
	void OnStartAssignMode();
	void OnSwitchLeft();
	void OnSwitchRight();
	void OpenDuplicationKeyDialog(bool bInHasUneditableKey);
	void OpenInitializeAllDialog();
	void PreConstruct(bool IsDesignTime);
	void RemoveDefaultDuplicationKey(TArray<struct FSTR_ConfigKeyAssignDuplicationKeyItem>& InOldDuplicationList, TArray<struct FSTR_ConfigKeyAssignDuplicationKeyItem>& InNewDuplicationList);
	void RemoveKeyAssign(class UBP_ConfigKeyAssignEntryBase_C* InKeyEntry, EConfigKeyType InKeyType);
	void SaveConfigKeyAssign();
	void SetEditKey(class UBP_ConfigKeyAssignEntryBase_C* InKeyEntry, TArray<struct FKey>& InKey, EConfigKeyType InAssignType);
	void StartEditMode();
	void SwapDuplicateKeyAssign();
	void UpdateAllDuplicationIcon();
	void UpdateCategoryExpansion();
	void UpdateChangeDuplicationEntryList(class UBP_ConfigKeyAssignEntryBase_C* InTargetEntry, TArray<struct FKey>& InAssignKey, EConfigKeyType InKeyType);
	void UpdateConfigLog();
	void UpdateDuplicationEntryList(class UBP_ConfigKeyAssignEntryBase_C* InTargetEntry, TArray<struct FKey>& InAssignKey, EConfigKeyType InKeyType);
	void UpdateDuplicationIcon(class UBP_ConfigKeyAssignEntryBase_C* InKeyEntry, EConfigKeyType InKeyType);
	void UpdateDuplicationTextVisibility();
	void UpdateGamePadAssignGuide();
	void UpdateListView();
	void UpdatePlatformDisplayType();
	void UpdateTrgGuide();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ConfigKeyAssignPage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ConfigKeyAssignPage_C")
	}
	static class UWDT_ConfigKeyAssignPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ConfigKeyAssignPage_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ConfigKeyAssignPage_C;

}

