#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_BackAttackMarker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_BackAttackMarker.WDT_BackAttackMarker_C
// 0x0040 (0x0500 - 0x04C0)
class UWDT_BackAttackMarker_C final : public UUIElementBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 MarkerImage;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector                                AttachOffset;                                      // 0x04D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   TargetSocket;                                      // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 TargetSkeletalMesh;                                // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WDT_BackAttackMarker(int32 EntryPoint);
	bool SetPosition(const struct FVector& InWorldPosition);
	bool SetTargetActor(class AActor* InTargetActor, class FName InTargetSocket);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Tick_Hud_Position(const struct FGeometry& InGeometry, double InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_BackAttackMarker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_BackAttackMarker_C")
	}
	static class UWDT_BackAttackMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_BackAttackMarker_C>();
	}
};
DUMPER7_ASSERTS_UWDT_BackAttackMarker_C;

}

