#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Status_Resistant

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_Status_Resistant.WDT_Status_Resistant_C.ExecuteUbergraph_WDT_Status_Resistant
// 0x0008 (0x0008 - 0x0000)
struct WDT_Status_Resistant_C_ExecuteUbergraph_WDT_Status_Resistant final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Status_Resistant_C_ExecuteUbergraph_WDT_Status_Resistant;

// Function WDT_Status_Resistant.WDT_Status_Resistant_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_Status_Resistant_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Status_Resistant_C_PreConstruct;

// Function WDT_Status_Resistant.WDT_Status_Resistant_C.SetResistantValue
// 0x0018 (0x0018 - 0x0000)
struct WDT_Status_Resistant_C_SetResistantValue final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
DUMPER7_ASSERTS_WDT_Status_Resistant_C_SetResistantValue;

}

