#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigTextElement

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WDT_ConfigTextElement.WDT_ConfigTextElement_C.SetTextSabPadding
// 0x0028 (0x0028 - 0x0000)
struct WDT_ConfigTextElement_C_SetTextSabPadding final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_2;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_3;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigTextElement_C_SetTextSabPadding;

// Function WDT_ConfigTextElement.WDT_ConfigTextElement_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct WDT_ConfigTextElement_C_SetText final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WDT_ConfigTextElement_C_SetText;

// Function WDT_ConfigTextElement.WDT_ConfigTextElement_C.SetColor
// 0x0024 (0x0024 - 0x0000)
struct WDT_ConfigTextElement_C_SetColor final
{
public:
	struct FLinearColor                           InColor;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0014)()
};
DUMPER7_ASSERTS_WDT_ConfigTextElement_C_SetColor;

// Function WDT_ConfigTextElement.WDT_ConfigTextElement_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigTextElement_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigTextElement_C_PreConstruct;

// Function WDT_ConfigTextElement.WDT_ConfigTextElement_C.ExecuteUbergraph_WDT_ConfigTextElement
// 0x0010 (0x0010 - 0x0000)
struct WDT_ConfigTextElement_C_ExecuteUbergraph_WDT_ConfigTextElement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigTextElement_C_ExecuteUbergraph_WDT_ConfigTextElement;

// Function WDT_ConfigTextElement.WDT_ConfigTextElement_C.ChangeStyle
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigTextElement_C_ChangeStyle final
{
public:
	bool                                          bIsDefaultStyle;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigTextElement_C_ChangeStyle;

}

