#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_MountGlideGauge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BasicUI_classes.hpp"
#include "Extensions_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_MountGlideGauge.WDT_MountGlideGauge_C
// 0x0078 (0x0538 - 0x04C0)
class UWDT_MountGlideGauge_C final : public UUIElementBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWDT_ResourceBar_C*                     HealthBar;                                         // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           IndicatorBox;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   TargetSocket;                                      // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 TargetSkeletalMesh;                                // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                AttachOffset;                                      // 0x04F0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LastMaxHealth;                                     // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LastHealth;                                        // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LastRealHealth;                                    // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AccumulatedDamage;                                 // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageAccumulateTime;                              // 0x0524(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DamageAccumulateTimerHandle;                       // 0x0528(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        OffsetFromEdge;                                    // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WDT_MountGlideGauge(int32 EntryPoint);
	bool NotifyBleedingAttackSucceeded();
	bool SetBloodAmount(const float InBloodAmount, const float InMaxBloodAmount, const EResourceChangeFactor InFactor);
	void SetGaugePositionInDisplay(const struct FVector2D& InPosition);
	bool SetHealth(const float InHealth, const float InMaxHealth, const float InRecoverableHealth, const EResourceChangeFactor InFactor);
	bool SetPosition(const struct FVector& InWorldPosition);
	struct FStatusEffectIconHandle SetStatusDownEffectApplied(const EStatusDownEffectIconType InType);
	bool SetStatusEffectRemoved(const struct FStatusEffectIconHandle& InIconHandle);
	bool SetStatusEffectTimeElapsed(const struct FStatusEffectIconHandle& InIconHandle, const float InRemainingTime, const float InTotalTime);
	struct FStatusEffectIconHandle SetStatusUpEffectApplied(const EStatusUpEffectIconType InType);
	bool SetTargetActor(class AActor* InTargetActor, class FName InTargetSocket);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TickHudPosition(const struct FGeometry& InGeometry, double InDeltaTime);
	bool UpdateAccumulateStateValue(const struct FAccumulateGaugeInfo& InGaugeInfo, const struct FAccumulateAttributeUIInfo& InAttributeInfo);
	bool UpdateVisibleBloodAmount(const bool InbVisible);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_MountGlideGauge_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_MountGlideGauge_C")
	}
	static class UWDT_MountGlideGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_MountGlideGauge_C>();
	}
};
DUMPER7_ASSERTS_UWDT_MountGlideGauge_C;

}

