#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigPieceBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicUI_classes.hpp"
#include "EN_ConfigMenuPiceType_structs.hpp"
#include "EN_ConfigPieceEditableType_structs.hpp"
#include "Extensions_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ConfigPieceBase.WDT_ConfigPieceBase_C
// 0x0070 (0x0638 - 0x05C8)
class UWDT_ConfigPieceBase_C : public UMenuPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FText                                   ItemTitle;                                         // 0x05D0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	EN_ConfigMenuPiceType                         PiceType;                                          // 0x05E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EN_ConfigPieceEditableType                    EditType;                                          // 0x05E1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E2[0x6];                                      // 0x05E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   LogTitleText;                                      // 0x05E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	class FText                                   LogText;                                           // 0x05F8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          bSetValueChangeTextStyle;                          // 0x0608(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_609[0x7];                                      // 0x0609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnValueChangeEvent;                                // 0x0610(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsEditable;                                       // 0x0620(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseToggle;                                        // 0x0621(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseTextSabPadding;                                // 0x0622(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseMoveImage;                                     // 0x0623(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseButtonIcon;                                    // 0x0624(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsException;                                      // 0x0625(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_626[0x2];                                      // 0x0626(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnValueSetDefaultEvent;                            // 0x0628(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void SetTitleText(const class FText& InText, bool* Success);
	void SetIsEditable(bool InFlag);
	void SetEnableColor(bool* OutFlag);
	void SetEditableGrayOut(bool* Flag);
	void SetDisableColor(bool* OutFlag);
	void OnRightPressed(bool bInIsPressStarted);
	void OnLeftPressed(bool bInIsPressStarted);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnDecideReleased();
	void OnCancelReleased();
	void InitializeToDefaultValue();
	void Initialize();
	void GetUseMoveImage(bool* OutFlag);
	void GetPhotoModeIntParameterType(EPhotoModeIntParameter* NewParam);
	void GetPhotoModeBoolParameterType(EPhotoModeBoolParameter* OutType);
	void GetLogTexture(TSoftObjectPtr<class UTexture2D>* OutTexture, bool* OutIsSuccess);
	void GetLogMoviePath(class FString* OutPath, bool* OutIsSuccess);
	void GetIsException(bool* OutFlag);
	void GetIsEditable(bool* OutFlag);
	void ExecuteUbergraph_WDT_ConfigPieceBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ConfigPieceBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ConfigPieceBase_C")
	}
	static class UWDT_ConfigPieceBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ConfigPieceBase_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ConfigPieceBase_C;

}

