#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ArticleThumbnailPiece

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.Unhighlight
// 0x0002 (0x0002 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_Unhighlight final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_Unhighlight;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.Uncheck
// 0x0002 (0x0002 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_Uncheck final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_Uncheck;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.SetTexture
// 0x0010 (0x0010 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_SetTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_SetTexture;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.SetSubTexture
// 0x0018 (0x0018 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_SetSubTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_SetSubTexture;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.SetSubLazyTexture
// 0x0038 (0x0038 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_SetSubLazyTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              LazyTexture;                                       // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_SetSubLazyTexture;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.SetScrollerItem
// 0x0008 (0x0008 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_SetScrollerItem final
{
public:
	class UScrollerItem*                          InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_SetScrollerItem;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.SetLazyTexture
// 0x0030 (0x0030 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_SetLazyTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              LazyTexture;                                       // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_SetLazyTexture;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.SetInteger
// 0x0028 (0x0028 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_SetInteger final
{
public:
	int32                                         Number_0;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NumberID;                                          // 0x0004(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0010)()
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_SetInteger;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.SetFlag
// 0x0010 (0x0010 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_SetFlag final
{
public:
	class FName                                   FlagName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FlagValue;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFireEvent;                                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_SetFlag;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.Select
// 0x0010 (0x0010 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_Select final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_Select;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.Reset
// 0x0003 (0x0003 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_Reset final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClearSubTexture_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetInteger_ReturnValue;                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_Reset;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.PlayDecideAnimation
// 0x0008 (0x0008 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_PlayDecideAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_PlayDecideAnimation;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_OnListItemObjectSet;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x00F8(0x00B8)()
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_OnFocusReceived;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.IsChecked
// 0x0001 (0x0001 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_IsChecked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_IsChecked;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.Highlight
// 0x0002 (0x0002 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_Highlight final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_Highlight;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.GetScrollerItem
// 0x0008 (0x0008 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_GetScrollerItem final
{
public:
	class UScrollerItem*                          OutItem;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_GetScrollerItem;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.GetInteger
// 0x0014 (0x0014 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_GetInteger final
{
public:
	class FName                                   NumberID;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_GetInteger;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.FlipTexture
// 0x0002 (0x0002 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_FlipTexture final
{
public:
	bool                                          IsInverse;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_FlipTexture;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.ExecuteUbergraph_WDT_ArticleThumbnailPiece
// 0x0028 (0x0028 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_ExecuteUbergraph_WDT_ArticleThumbnailPiece final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollerItem*                          K2Node_Event_InItem;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Select_ReturnValue;                       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Deselect_ReturnValue;                     // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_ExecuteUbergraph_WDT_ArticleThumbnailPiece;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.Enable
// 0x0002 (0x0002 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_Enable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Enable_ReturnValue;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_Enable;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.Disable
// 0x0002 (0x0002 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_Disable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Disable_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_Disable;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.Deselect
// 0x0002 (0x0002 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_Deselect final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_Deselect;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.ClearTexture
// 0x0001 (0x0001 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_ClearTexture final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_ClearTexture;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.ClearSubTexture
// 0x000C (0x000C - 0x0000)
struct WDT_ArticleThumbnailPiece_C_ClearSubTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_ClearSubTexture;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.Check
// 0x0003 (0x0003 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_Check final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AnotherAppearance;                                 // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_Check;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_BP_OnItemSelectionChanged;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_BP_OnItemExpansionChanged;

// Function WDT_ArticleThumbnailPiece.WDT_ArticleThumbnailPiece_C.Blink
// 0x0001 (0x0001 - 0x0000)
struct WDT_ArticleThumbnailPiece_C_Blink final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ArticleThumbnailPiece_C_Blink;

}

