#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_BuddyInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_BuddyInfo.WDT_BuddyInfo_C
// 0x0038 (0x0600 - 0x05C8)
class UWDT_BuddyInfo_C final : public UMenuPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             BuddyName;                                         // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Characteristic_Feature;                            // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Characteristic_Synergy;                            // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PossessBuffDescriptionText;                        // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DisActiveFeatureText;                              // 0x05F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void SetBuddyInfo(const struct FUIBuddyInfo& NewParam1);
	void ExecuteUbergraph_WDT_BuddyInfo(int32 EntryPoint);
	void Construct();

	void Get_Feature_Text(TArray<struct FUIBuddyFeatureInfo>& Array, class FText* Output_Get) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_BuddyInfo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_BuddyInfo_C")
	}
	static class UWDT_BuddyInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_BuddyInfo_C>();
	}
};
DUMPER7_ASSERTS_UWDT_BuddyInfo_C;

}

