#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ItemSynthetic_RawMaterialMenu

#include "Basic.hpp"

#include "BasicUI_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ItemSynthetic_RawMaterialMenu.WDT_ItemSynthetic_RawMaterialMenu_C
// 0x0070 (0x0530 - 0x04C0)
class UWDT_ItemSynthetic_RawMaterialMenu_C final : public UUIElementBase
{
public:
	class UCommonLazyImage*                       CommonLazyImage_84;                                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             InventryNum;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MaterialName;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MaterialName_CommonText;                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NeedNum;                                           // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NeedNum_x;                                         // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UnderLine;                                         // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             WareHouseNum;                                      // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            CanCreateColor;                                    // 0x0500(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            CanNotCreateColor;                                 // 0x0514(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CanCreate;                                         // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetMaterialInfo(const struct FRawMaterialUIInfo& RawMaterialUIInfo, int32 Count, bool UseSotrage);
	void IsMaterialsShortage(bool* Can_tCreate);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ItemSynthetic_RawMaterialMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ItemSynthetic_RawMaterialMenu_C")
	}
	static class UWDT_ItemSynthetic_RawMaterialMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ItemSynthetic_RawMaterialMenu_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ItemSynthetic_RawMaterialMenu_C;

}

