#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_FieldMenuCloser

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_FieldMenuCloser.WDT_FieldMenuCloser_C.PlayFieldMenuCloseAnimation
// 0x0008 (0x0008 - 0x0000)
struct WDT_FieldMenuCloser_C_PlayFieldMenuCloseAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuCloser_C_PlayFieldMenuCloseAnimation;

// Function WDT_FieldMenuCloser.WDT_FieldMenuCloser_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WDT_FieldMenuCloser_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuCloser_C_OnAnimationFinished;

// Function WDT_FieldMenuCloser.WDT_FieldMenuCloser_C.IsPlayingFieldMenuCloseAnimation
// 0x0002 (0x0002 - 0x0000)
struct WDT_FieldMenuCloser_C_IsPlayingFieldMenuCloseAnimation final
{
public:
	bool                                          OutPlaying;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuCloser_C_IsPlayingFieldMenuCloseAnimation;

// Function WDT_FieldMenuCloser.WDT_FieldMenuCloser_C.ExecuteUbergraph_WDT_FieldMenuCloser
// 0x0018 (0x0018 - 0x0000)
struct WDT_FieldMenuCloser_C_ExecuteUbergraph_WDT_FieldMenuCloser final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuCloser_C_ExecuteUbergraph_WDT_FieldMenuCloser;

}

