#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Status_Capacity

#include "Basic.hpp"

#include "WDT_Status_PieceBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_Status_Capacity.WDT_Status_Capacity_C
// 0x0040 (0x0708 - 0x06C8)
class UWDT_Status_Capacity_C final : public UWDT_Status_PieceBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WDT_Status_Capacity_C;              // 0x06C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             AttrValue;                                         // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock;                                   // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonTextBlock_1;                                 // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TitleText;                                         // 0x06E8(0x0010)(Edit, BlueprintVisible)
	class FText                                   IconText;                                          // 0x06F8(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WDT_Status_Capacity(int32 EntryPoint);
	void GetComparisonColorForCapacity(int32 Current, int32 After, struct FSlateColor* SlateColor);
	void PreConstruct(bool IsDesignTime);
	void SetValue(int32 InValue);
	void SetValueComparison(int32 InCurrentValue, int32 InTargetValue);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_Status_Capacity_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_Status_Capacity_C")
	}
	static class UWDT_Status_Capacity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_Status_Capacity_C>();
	}
};
DUMPER7_ASSERTS_UWDT_Status_Capacity_C;

}

