#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigConsentLanguageListItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WDT_ConfigConsentLanguageListItem.WDT_ConfigConsentLanguageListItem_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigConsentLanguageListItem_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigConsentLanguageListItem_C_OnListItemObjectSet;

// Function WDT_ConfigConsentLanguageListItem.WDT_ConfigConsentLanguageListItem_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WDT_ConfigConsentLanguageListItem_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x00F8(0x00B8)()
};
DUMPER7_ASSERTS_WDT_ConfigConsentLanguageListItem_C_OnFocusReceived;

// Function WDT_ConfigConsentLanguageListItem.WDT_ConfigConsentLanguageListItem_C.GetLanguageName
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigConsentLanguageListItem_C_GetLanguageName final
{
public:
	class FName                                   OutName;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigConsentLanguageListItem_C_GetLanguageName;

// Function WDT_ConfigConsentLanguageListItem.WDT_ConfigConsentLanguageListItem_C.ExecuteUbergraph_WDT_ConfigConsentLanguageListItem
// 0x0020 (0x0020 - 0x0000)
struct WDT_ConfigConsentLanguageListItem_C_ExecuteUbergraph_WDT_ConfigConsentLanguageListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWDT_ConfigConsentLanguageListItem_C*   K2Node_DynamicCast_AsWDT_Config_Consent_Language_List_Item; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigConsentLanguageListItem_C_ExecuteUbergraph_WDT_ConfigConsentLanguageListItem;

// Function WDT_ConfigConsentLanguageListItem.WDT_ConfigConsentLanguageListItem_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigConsentLanguageListItem_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigConsentLanguageListItem_C_BP_OnItemSelectionChanged;

// Function WDT_ConfigConsentLanguageListItem.WDT_ConfigConsentLanguageListItem_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigConsentLanguageListItem_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigConsentLanguageListItem_C_BP_OnItemExpansionChanged;

}

