#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_MiniMapWideModeImage

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_MiniMapWideModeImage.WDT_MiniMapWideModeImage_C.InitializeMiniMapImage
// 0x0020 (0x0020 - 0x0000)
struct WDT_MiniMapWideModeImage_C_InitializeMiniMapImage final
{
public:
	bool                                          CallFunc_SetWideMode_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_GetRadarImage_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MiniMapWideModeImage_C_InitializeMiniMapImage;

}

