#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Article_Characteristic

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_Article_Characteristic.WDT_Article_Characteristic_C.GetTextWithEmptyNone
// 0x0048 (0x0048 - 0x0000)
struct WDT_Article_Characteristic_C_GetTextWithEmptyNone final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FText                                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0028(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0038(0x0010)()
};
DUMPER7_ASSERTS_WDT_Article_Characteristic_C_GetTextWithEmptyNone;

// Function WDT_Article_Characteristic.WDT_Article_Characteristic_C.SetValue
// 0x0020 (0x0020 - 0x0000)
struct WDT_Article_Characteristic_C_SetValue final
{
public:
	class FText                                   InValue;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_GetTextWithEmptyNone_ReturnValue;         // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_WDT_Article_Characteristic_C_SetValue;

}

