#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigKeyAssignEditSelect

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function WDT_ConfigKeyAssignEditSelect.WDT_ConfigKeyAssignEditSelect_C.ExecuteUbergraph_WDT_ConfigKeyAssignEditSelect
// 0x0020 (0x0020 - 0x0000)
struct WDT_ConfigKeyAssignEditSelect_C_ExecuteUbergraph_WDT_ConfigKeyAssignEditSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISelectableInterface>  CallFunc_Select_self_CastInput;                    // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Select_ReturnValue;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigKeyAssignEditSelect_C_ExecuteUbergraph_WDT_ConfigKeyAssignEditSelect;

// Function WDT_ConfigKeyAssignEditSelect.WDT_ConfigKeyAssignEditSelect_C.InitializeKey
// 0x0048 (0x0048 - 0x0000)
struct WDT_ConfigKeyAssignEditSelect_C_InitializeKey final
{
public:
	class FText                                   ActionName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	EConfigKeyType                                InAssignKeyType;                                   // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FKey>                           InGamePadKey;                                      // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FKey>                           InKeyboardKey_Main;                                // 0x0028(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FKey>                           InKeyboardKey_Sub;                                 // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WDT_ConfigKeyAssignEditSelect_C_InitializeKey;

// Function WDT_ConfigKeyAssignEditSelect.WDT_ConfigKeyAssignEditSelect_C.SetKey
// 0x0018 (0x0018 - 0x0000)
struct WDT_ConfigKeyAssignEditSelect_C_SetKey final
{
public:
	TArray<struct FKey>                           InKey;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EConfigKeyType                                InKeyType;                                         // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigKeyAssignEditSelect_C_SetKey;

}

