#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_SupportMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "STR_SupportMenuItemBaseList_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_SupportMenu.WDT_SupportMenu_C
// 0x0298 (0x0850 - 0x05B8)
class UWDT_SupportMenu_C final : public UAppMenuBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SupportMenu_Close;                                 // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SupportMenu_Open;                                  // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USizeBox*                               DescriptionListSizeBox;                            // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_FieldMenuCloser_C*                 FieldMenuCloser;                                   // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_TrgGuideTypeA;                       // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_TrgGuideTypeB;                       // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListScroller*                          ListScroller_61;                                   // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_SupportMenuDescriptionLog_C*       LouDiaryLog;                                       // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SupportMenu;                                       // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_Piece_TrgText_C*                   WDT_Piece_TrgText;                                 // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_Piece_TrgText_C*                   WDT_Piece_TrgText_3;                               // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_Piece_TrgText_C*                   WDT_Piece_TrgText_5;                               // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_Piece_TrgText_C*                   WDT_Piece_TrgText_MapLocation;                     // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_Piece_TrgText_C*                   WDT_Piece_TrgText_MapLocation_1;                   // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_Piece_TrgText_C*                   WDT_Piece_TrgText_MapMenu;                         // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_SupportMenuDescriptionLog_C*       WDT_SupportMenuDescriptionLog;                     // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_SupportMenuKeywordLog_C*           WDT_SupportMenuKeywordLog;                         // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_SupportMenuTab_C*                  WDT_SupportMenuTab;                                // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcher_Log;                                // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<ESupportMenuType>                      TabElementOrder;                                   // 0x0658(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly)
	class UBP_SupportMenuUIObject_C*              SupportMenuUIObject;                               // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UInstructionIndicatorUIObject*          InstructionUIObject;                               // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDescriptionUIObject*                   DescriptionUIObject;                               // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FName                                   TODOKey;                                           // 0x0680(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   TODOFinishedKey;                                   // 0x0688(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NewGetKey;                                         // 0x0690(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FSTR_SupportMenuItemBaseList> MainItemDataMap;                          // 0x0698(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FSTR_SupportMenuItemBaseList> LouDiaryItemDataMap;                      // 0x06E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FSTR_SupportMenuItemBaseList> KeywordItemDataMap;                       // 0x0738(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, struct FSTR_SupportMenuItemBaseList> DescriptionItemDataMap;                   // 0x0788(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         LouDiaryLastSelectedIndex;                         // 0x07D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KeywordLastSelectedIndex;                          // 0x07DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DescriptionLastSelectedIndex;                      // 0x07E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasJustPressedSwitchKey;                           // 0x07E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasJustPressedHorizonKey;                          // 0x07E5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7E6[0x2];                                      // 0x07E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<struct FGameplayTag, struct FVector2D>   NewVar;                                            // 0x07E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          PressdMenuSpecialLeft;                             // 0x0838(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_839[0x7];                                      // 0x0839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ScrollSpeed;                                       // 0x0840(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerInputType                              PlayerInputType;                                   // 0x0848(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddCategory(TArray<class FName>& InCategoryList, class FName InNewCategory);
	void AddItemDataMap(class FName InCategory, class UBP_SupportMenuItemDataBase_C* InItem);
	void AddLouDiaryList(TArray<class FName>& InCategoryList, class FName InItemKey, const struct FLouDiaryDataTableRow& InLouDiaryData, bool InIsItemFinished);
	void AddNewAddItemDestructionData(class FName InDestructionIdArray);
	void AddNewAddItemInstructionData(class FName InInstructionIdArray);
	void BackupItemData();
	void BndEvt__WDT_SupportMenu_ListScroller_61_K2Node_ComponentBoundEvent_4_OnItemIsHoveredChangedDynamic__DelegateSignature(class UObject* Item, bool bIsHovered);
	void BndEvt__WDT_SupportMenu_ListScroller_61_K2Node_ComponentBoundEvent_5_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__WDT_SupportMenu_ListScroller_61_K2Node_ComponentBoundEvent_6_OnListItemSelectionChangedDynamic__DelegateSignature(class UObject* Item, bool bIsSelected);
	void BndEvt__WDT_SupportMenu_WDT_SupportMenuTab_K2Node_ComponentBoundEvent_3_OnTabItemCliked__DelegateSignature(int32 InIndex);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Build_Keyword_List_View();
	void BuildDescriptionListView();
	void BuildLouDiaryListView();
	void CategoryDataToDescriptionInfo(const class FText& TitleText, class FName CategoryKeyName, struct FDescriptionInfoTable* OutDescriptionInfo);
	void CategoryDataToKeywordData(const class FText& InTitleText, class FName InCategoryKeyName, struct FKeywordDataTableRow* OutKeywordData);
	void CategoryDataToLouDiaryData(const class FText& InTitleText, class FName InCategoryKeyName, struct FLouDiaryDataTableRow* OutLouDiaryData);
	void ChangeCategoryNewGetDescription(TArray<class FName>& InCategoryKeyList, class FName InKeywordID);
	void ChangeCategoryNewGetInstruction(TArray<class FName>& InCategoryKeyList, class FName InKeywordID);
	void ChangeCategoryNewGetKeyword(TArray<class FName>& InCategoryKeyList, class FName InKeywordID);
	void ChangeCategoryNewGetLouDiary(TArray<class FName>& InCategoryKeyList, class FName InKeywordID);
	void ChangeCategoryTODO(const struct FStoryFlagEvaluationFormula& InStoryFlag, TArray<class FName>& InCategoryList);
	void CheckDescriptionContainNewItem(bool* OutFlag);
	void CheckEnableTimeSeries(TArray<struct FGameplayTag>& InTimeSeriesTag, bool* OutIsEnable);
	void CheckKyewordContainNewItem(bool* OutFlag);
	void CheckLowDiaryContainNewItem(bool* OutFlag);
	void DisableNewFlag();
	void ExecuteUbergraph_WDT_SupportMenu(int32 EntryPoint);
	void FinalizeInput();
	void FindItemData(const TMap<class FName, struct FSTR_SupportMenuItemBaseList>& InItemDataMap, class FName InFindCategory, class FName InFindItemKey, class UBP_SupportMenuItemDataBase_C** OutItem, bool* OutSuccess);
	void ForcedTransitToMapMenu();
	void GetDisplayCategoryNameList(TArray<class FName>* OutNum);
	void GetDisplayCategoryNum(int32* OutNum);
	void GetLouDiaryFInishedText(class FName InID, class FText* OutText);
	void GetSelectCategory(class FName* OutCategoryName);
	void GetSelectMenuType(ESupportMenuType* OutType);
	void InitializeInput();
	void InitializeTabNewFlag(int32 InSupportMenuType);
	void InpActEvt_IA_UI_CancelOnRelease_K2Node_EnhancedInputActionEvent_8(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_DecideOnRelease_K2Node_EnhancedInputActionEvent_13(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_DescriptionScroll_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Down_K2Node_EnhancedInputActionEvent_14(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Left_K2Node_EnhancedInputActionEvent_4(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Left_K2Node_EnhancedInputActionEvent_5(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_MenuSpecial4_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Right_K2Node_EnhancedInputActionEvent_6(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Right_K2Node_EnhancedInputActionEvent_7(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchLeft_K2Node_EnhancedInputActionEvent_11(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchLeft_K2Node_EnhancedInputActionEvent_12(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchRight_K2Node_EnhancedInputActionEvent_10(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_SwitchRight_K2Node_EnhancedInputActionEvent_9(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_TransitMapMenu_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_TransitMapMenu_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Up_K2Node_EnhancedInputActionEvent_15(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void isFeatureIconGrayOut(TArray<struct FGameplayTag>& InFeatureTagList, TArray<struct FGameplayTag>& InTimeSeriesList, bool* OutFindValidFeaturetag);
	void IsFeatureReleased(TArray<struct FGameplayTag>& InFeatureTagList, bool InIsReleaseOnFeatureAppearance, bool* IsReleased);
	void IsFeatureTagListValid(TArray<struct FGameplayTag>& InFeatureTagList, bool* OutFindValidFeaturetag);
	void MakeDescriptionCategoryItemDataList();
	void MakeDescriptionChildItemDataList();
	void MakeInstrutionChildItemDataList();
	void MakeKeywordCategoryItemDataList();
	void MakeKeywordChildItemDataList();
	void MakeLouDiaryCategoryItemDataList();
	void MakeLouDiaryChildItemDataList();
	void MoveCategory(int32 InIncrement);
	void MoveTabIndex(int32 InIncrement);
	void OnClose();
	void OnClosing();
	void OnDecide();
	void OnDown();
	void OnFieldMenuCloseAnimationFinish();
	class UWidgetAnimation* OnGetCloseAnimation();
	class UWidgetAnimation* OnGetOpenAnimation();
	void OnInitialized();
	void OnInputDeviceChanged();
	void OnLeft();
	void OnMenuScecial4();
	void OnOpening();
	void OnRight();
	void OnSwitchLeft();
	void OnSwitchRight();
	void OnUp();
	void PreConstruct(bool IsDesignTime);
	void SelectCategoryChangeExpansion();
	void SequenceEvent__ENTRYPOINTWDT_SupportMenu();
	void SetSelectToItemID(class FName InSelectID);
	void SetupListViewListItem();
	void SetupTrgGuide();
	void SetupUIObject();
	void SupportMenuActive_Event();
	void SupportMenuFormat(const class FText& InText, class FText* OutText);
	void TransitToMapMenu(const struct FGameplayTag& InFeatureTag, class FName InSelectLouDiaryID);
	void UpdateCategoryDisplayNewFlag(class UBP_SupportMenuItemDataBase_C* InItem);
	void UpdateCategoryExpansion();
	void UpdateLog(class UBP_SupportMenuItemDataBase_C* InSuppotItemData);
	void UpdateLouDiaryDecideButtonGuide();
	void UpdateTabDisplay();
	void UpdateTabNewFlag(ESupportMenuType InSupportMenuType);
	void UpdateTrgGuide();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_SupportMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_SupportMenu_C")
	}
	static class UWDT_SupportMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_SupportMenu_C>();
	}
};
DUMPER7_ASSERTS_UWDT_SupportMenu_C;

}

