#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Status_Attack

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_Status_Attack.WDT_Status_Attack_C.SetIndependentAttack
// 0x0018 (0x0018 - 0x0000)
struct WDT_Status_Attack_C_SetIndependentAttack final
{
public:
	int32                                         InAttack;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
DUMPER7_ASSERTS_WDT_Status_Attack_C_SetIndependentAttack;

// Function WDT_Status_Attack.WDT_Status_Attack_C.SetJailAttack
// 0x0018 (0x0018 - 0x0000)
struct WDT_Status_Attack_C_SetJailAttack final
{
public:
	int32                                         InAttack;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
DUMPER7_ASSERTS_WDT_Status_Attack_C_SetJailAttack;

// Function WDT_Status_Attack.WDT_Status_Attack_C.SetWeapon1Attack
// 0x0018 (0x0018 - 0x0000)
struct WDT_Status_Attack_C_SetWeapon1Attack final
{
public:
	int32                                         InAttack;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
DUMPER7_ASSERTS_WDT_Status_Attack_C_SetWeapon1Attack;

// Function WDT_Status_Attack.WDT_Status_Attack_C.SetWeapon1Icon
// 0x0010 (0x0010 - 0x0000)
struct WDT_Status_Attack_C_SetWeapon1Icon final
{
public:
	class UTexture2D*                             InIcon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Status_Attack_C_SetWeapon1Icon;

// Function WDT_Status_Attack.WDT_Status_Attack_C.SetWeapon2Attack
// 0x0018 (0x0018 - 0x0000)
struct WDT_Status_Attack_C_SetWeapon2Attack final
{
public:
	int32                                         InAttack;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
DUMPER7_ASSERTS_WDT_Status_Attack_C_SetWeapon2Attack;

// Function WDT_Status_Attack.WDT_Status_Attack_C.SetWeapon2Icon
// 0x0010 (0x0010 - 0x0000)
struct WDT_Status_Attack_C_SetWeapon2Icon final
{
public:
	class UTexture2D*                             InIcon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Status_Attack_C_SetWeapon2Icon;

}

