#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_SupportMenuListItem

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.SetTextGrayOut
// 0x002C (0x002C - 0x0000)
struct WDT_SupportMenuListItem_C_SetTextGrayOut final
{
public:
	bool                                          InIsGrayOut;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_SetTextGrayOut;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.SetQuestClear
// 0x0001 (0x0001 - 0x0000)
struct WDT_SupportMenuListItem_C_SetQuestClear final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_SetQuestClear;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.SetIsFeatureIconVisibility
// 0x0001 (0x0001 - 0x0000)
struct WDT_SupportMenuListItem_C_SetIsFeatureIconVisibility final
{
public:
	bool                                          InVisible;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_SetIsFeatureIconVisibility;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.SetIsExpansion
// 0x0001 (0x0001 - 0x0000)
struct WDT_SupportMenuListItem_C_SetIsExpansion final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_SetIsExpansion;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.SetIsDeactivate
// 0x0001 (0x0001 - 0x0000)
struct WDT_SupportMenuListItem_C_SetIsDeactivate final
{
public:
	bool                                          InIsDeactivate;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_SetIsDeactivate;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.SetIsCategory
// 0x0001 (0x0001 - 0x0000)
struct WDT_SupportMenuListItem_C_SetIsCategory final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_SetIsCategory;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.SetFeatureIconGrayOut
// 0x002C (0x002C - 0x0000)
struct WDT_SupportMenuListItem_C_SetFeatureIconGrayOut final
{
public:
	bool                                          IsGrayOut;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0018(0x0014)()
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_SetFeatureIconGrayOut;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.Select
// 0x0002 (0x0002 - 0x0000)
struct WDT_SupportMenuListItem_C_Select final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_Select;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_SupportMenuListItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_PreConstruct;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WDT_SupportMenuListItem_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_OnListItemObjectSet;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WDT_SupportMenuListItem_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x00F8(0x00B8)()
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_OnFocusReceived;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.OnChangeNewFlag
// 0x0001 (0x0001 - 0x0000)
struct WDT_SupportMenuListItem_C_OnChangeNewFlag final
{
public:
	bool                                          InNewFlag;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_OnChangeNewFlag;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.OnChangeExpansion
// 0x0001 (0x0001 - 0x0000)
struct WDT_SupportMenuListItem_C_OnChangeExpansion final
{
public:
	bool                                          InIsExpansion;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_OnChangeExpansion;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.GetIsExpansion
// 0x0001 (0x0001 - 0x0000)
struct WDT_SupportMenuListItem_C_GetIsExpansion final
{
public:
	bool                                          OutIsExpansion;                                    // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_GetIsExpansion;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.GetIsCategory
// 0x0001 (0x0001 - 0x0000)
struct WDT_SupportMenuListItem_C_GetIsCategory final
{
public:
	bool                                          OutIsCategory;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_GetIsCategory;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.ExecuteUbergraph_WDT_SupportMenuListItem
// 0x0058 (0x0058 - 0x0000)
struct WDT_SupportMenuListItem_C_ExecuteUbergraph_WDT_SupportMenuListItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SupportMenuItemDataBase_C*          K2Node_DynamicCast_AsBP_Support_Menu_Item_Data_Base; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsQuestDeactivate_bOutIsQuestDisable;  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFeatureIconGrayOut_OutGrayOut;       // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsFeatureIconVisibility_OutVisibility; // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsQuestClear_IsEnable;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsExpansion_OutFlag;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsCategory_OutIsCategory;              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTitleText_OutText;                     // 0x0020(0x0010)()
	bool                                          CallFunc_GetDisplayNewFlag_OutFlag;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Select_ReturnValue;                       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Deselect_ReturnValue;                     // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool InIsExpansion)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Deselect_ReturnValue_1;                   // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool InIsNew)>                 K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_ExecuteUbergraph_WDT_SupportMenuListItem;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.Deselect
// 0x0002 (0x0002 - 0x0000)
struct WDT_SupportMenuListItem_C_Deselect final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_Deselect;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_SupportMenuListItem_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_BP_OnItemSelectionChanged;

// Function WDT_SupportMenuListItem.WDT_SupportMenuListItem_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_SupportMenuListItem_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuListItem_C_BP_OnItemExpansionChanged;

}

