#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_MatchingSelectableTextPiece

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_MatchingSelectableTextPiece.WDT_MatchingSelectableTextPiece_C.Select
// 0x0002 (0x0002 - 0x0000)
struct WDT_MatchingSelectableTextPiece_C_Select final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MatchingSelectableTextPiece_C_Select;

// Function WDT_MatchingSelectableTextPiece.WDT_MatchingSelectableTextPiece_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_MatchingSelectableTextPiece_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MatchingSelectableTextPiece_C_PreConstruct;

// Function WDT_MatchingSelectableTextPiece.WDT_MatchingSelectableTextPiece_C.ExecuteUbergraph_WDT_MatchingSelectableTextPiece
// 0x0008 (0x0008 - 0x0000)
struct WDT_MatchingSelectableTextPiece_C_ExecuteUbergraph_WDT_MatchingSelectableTextPiece final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MatchingSelectableTextPiece_C_ExecuteUbergraph_WDT_MatchingSelectableTextPiece;

// Function WDT_MatchingSelectableTextPiece.WDT_MatchingSelectableTextPiece_C.Deselect
// 0x0002 (0x0002 - 0x0000)
struct WDT_MatchingSelectableTextPiece_C_Deselect final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MatchingSelectableTextPiece_C_Deselect;

}

