#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ListTextPiece

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ListTextPiece.WDT_ListTextPiece_C
// 0x0030 (0x05F8 - 0x05C8)
class UWDT_ListTextPiece_C final : public UMenuPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 selection_glow;                                    // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text1;                                             // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       Text_Shadow;                                       // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Caption;                                           // 0x05E8(0x0010)(Edit, BlueprintVisible)

public:
	bool Uncheck(bool PlayAnimation_0);
	bool SetTexture(class UTexture2D* Texture);
	bool SetTexts(const TArray<class FText>& LocalTexts);
	bool SetTextFunction(const class FText& InText);
	bool SetText(const class FText& LocalText);
	bool SetSubTexture(class FName ImageId, class UTexture2D* Texture);
	bool SetSubLazyTexture(class FName ImageId, const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	bool SetLazyTexture(const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	bool Select(bool PlayAnimation_0);
	void PreConstruct(bool IsDesignTime);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnInitialized();
	bool IsChecked();
	void GetTexts(TArray<class FText>* LocalTexts);
	void GetText(class FText* LocalText);
	bool FlipTexture(bool IsInverse);
	void ExecuteUbergraph_WDT_ListTextPiece(int32 EntryPoint);
	bool Deselect(bool PlayAnimation_0);
	void Construct();
	bool ClearTexture();
	bool ClearSubTexture(class FName ImageId);
	bool Check(bool PlayAnimation_0, bool AnotherAppearance);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ListTextPiece_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ListTextPiece_C")
	}
	static class UWDT_ListTextPiece_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ListTextPiece_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ListTextPiece_C;

}

