#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigLanguageSelectMenu

#include "Basic.hpp"

#include "STR_ConfigConsentLanguageListSet_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BasicUI_classes.hpp"
#include "Extensions_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ConfigLanguageSelectMenu.WDT_ConfigLanguageSelectMenu_C
// 0x00D0 (0x0688 - 0x05B8)
class UWDT_ConfigLanguageSelectMenu_C final : public UMenuBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ConfigLanguageSelect_Close;                        // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ConfigLanguageSelect_Open;                         // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWDT_ConfigIconTextPiece_C*             CancelIconText;                                    // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigIconTextPiece_C*             DecideIconText;                                    // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_94;                                          // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UListScroller*                          ListScroller_149;                                  // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigIconTextPiece_C*             SelectIconText;                                    // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FName, struct FSTR_ConfigConsentLanguageListSet> LanguageTextureList;                 // 0x05F8(0x0050)(Edit, BlueprintVisible)
	struct FGameplayTag                           ConsentTag;                                        // 0x0648(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemIndex;                                         // 0x0650(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ItemIndexLength;                                   // 0x0654(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoop;                                            // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnDecideEvent;                                     // 0x0660(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsPressStarted;                                   // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_671[0x3];                                      // 0x0671(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CurrentLanguage;                                   // 0x0674(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67C[0x4];                                      // 0x067C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_ConfigurationUIObject_C*            ConfigUIObejct;                                    // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WDT_ConfigLanguageSelectMenu_ListScroller_149_K2Node_ComponentBoundEvent_2_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void BndEvt__WDT_ConfigLanguageSelectMenu_ListScroller_149_K2Node_ComponentBoundEvent_3_OnItemIsHoveredChangedDynamic__DelegateSignature(class UObject* Item, bool bIsHovered);
	void ExecuteUbergraph_WDT_ConfigLanguageSelectMenu(int32 EntryPoint);
	void GetSelectedLanguageIndex(int32* OutIndex);
	void GetSelectLanguageListItem(class UWDT_ConfigConsentLanguageListItem_C** OutItem);
	void GetSelectTexture(TSoftObjectPtr<class UTexture2D>* OutTexture);
	void Initialize_List_View(const struct FGameplayTag& InTag, class FName InSelectLanguage);
	void OnCancelRelease();
	void OnClosed();
	void OnDecideRelease();
	void OnInitialized();
	void OnInputDeviceChanged();
	void OnOpened();
	void RefreshKeyImage();
	void SelectDown(bool InCanWarp);
	void SelectToIndexItem(int32 InIndex);
	void SelectUp(bool InCanWarp);
	void SetVisible(bool InFlag);
	void WidgetAnimationEvt_ConfigLanguageSelect_Close_K2Node_WidgetAnimationEvent_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ConfigLanguageSelectMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ConfigLanguageSelectMenu_C")
	}
	static class UWDT_ConfigLanguageSelectMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ConfigLanguageSelectMenu_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ConfigLanguageSelectMenu_C;

}

