#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigMenuInputTextPiece

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WDT_ConfigMenuInputTextPiece.WDT_ConfigMenuInputTextPiece_C.UpdateTextStyle
// 0x0018 (0x0018 - 0x0000)
struct WDT_ConfigMenuInputTextPiece_C_UpdateTextStyle final
{
public:
	class FText                                   CallFunc_GetText_OutText;                          // 0x0000(0x0010)()
	bool                                          CallFunc_NotEqual_TextText_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuInputTextPiece_C_UpdateTextStyle;

// Function WDT_ConfigMenuInputTextPiece.WDT_ConfigMenuInputTextPiece_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct WDT_ConfigMenuInputTextPiece_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WDT_ConfigMenuInputTextPiece_C_SetText;

// Function WDT_ConfigMenuInputTextPiece.WDT_ConfigMenuInputTextPiece_C.SetIsEditable
// 0x0018 (0x0018 - 0x0000)
struct WDT_ConfigMenuInputTextPiece_C_SetIsEditable final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0004(0x0014)()
};
DUMPER7_ASSERTS_WDT_ConfigMenuInputTextPiece_C_SetIsEditable;

// Function WDT_ConfigMenuInputTextPiece.WDT_ConfigMenuInputTextPiece_C.SetDefaultText
// 0x0028 (0x0028 - 0x0000)
struct WDT_ConfigMenuInputTextPiece_C_SetDefaultText final
{
public:
	class FText                                   InInitializeText;                                  // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InDefaultText;                                     // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_GetIsEditable_OutFlag;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuInputTextPiece_C_SetDefaultText;

// Function WDT_ConfigMenuInputTextPiece.WDT_ConfigMenuInputTextPiece_C.Set Input Mode
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigMenuInputTextPiece_C_Set_Input_Mode final
{
public:
	bool                                          CallFunc_GetIsEditable_OutFlag;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuInputTextPiece_C_Set_Input_Mode;

// Function WDT_ConfigMenuInputTextPiece.WDT_ConfigMenuInputTextPiece_C.Select
// 0x0003 (0x0003 - 0x0000)
struct WDT_ConfigMenuInputTextPiece_C_Select final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEditable_OutFlag;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuInputTextPiece_C_Select;

// Function WDT_ConfigMenuInputTextPiece.WDT_ConfigMenuInputTextPiece_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigMenuInputTextPiece_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuInputTextPiece_C_PreConstruct;

// Function WDT_ConfigMenuInputTextPiece.WDT_ConfigMenuInputTextPiece_C.OnMouseLeaveSubPiece
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigMenuInputTextPiece_C_OnMouseLeaveSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuInputTextPiece_C_OnMouseLeaveSubPiece;

// Function WDT_ConfigMenuInputTextPiece.WDT_ConfigMenuInputTextPiece_C.OnMouseEnterSubPiece
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigMenuInputTextPiece_C_OnMouseEnterSubPiece final
{
public:
	class UMenuPieceBase*                         MenuPiece;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuInputTextPiece_C_OnMouseEnterSubPiece;

// Function WDT_ConfigMenuInputTextPiece.WDT_ConfigMenuInputTextPiece_C.GetText
// 0x0020 (0x0020 - 0x0000)
struct WDT_ConfigMenuInputTextPiece_C_GetText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0010)(Parm, OutParm)
	class FText                                   CallFunc_GetText_OutText;                          // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_WDT_ConfigMenuInputTextPiece_C_GetText;

// Function WDT_ConfigMenuInputTextPiece.WDT_ConfigMenuInputTextPiece_C.GetLogTexture
// 0x0030 (0x0030 - 0x0000)
struct WDT_ConfigMenuInputTextPiece_C_GetLogTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              OutTexture;                                        // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          OutIsSuccess;                                      // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuInputTextPiece_C_GetLogTexture;

// Function WDT_ConfigMenuInputTextPiece.WDT_ConfigMenuInputTextPiece_C.GetLogMoviePath
// 0x0018 (0x0018 - 0x0000)
struct WDT_ConfigMenuInputTextPiece_C_GetLogMoviePath final
{
public:
	class FString                                 OutPath;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          OutIsSuccess;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StrStr_ReturnValue;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuInputTextPiece_C_GetLogMoviePath;

// Function WDT_ConfigMenuInputTextPiece.WDT_ConfigMenuInputTextPiece_C.ExecuteUbergraph_WDT_ConfigMenuInputTextPiece
// 0x0028 (0x0028 - 0x0000)
struct WDT_ConfigMenuInputTextPiece_C_ExecuteUbergraph_WDT_ConfigMenuInputTextPiece final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMenuPieceBase*                         K2Node_Event_MenuPiece_1;                          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMenuPieceBase*                         K2Node_Event_MenuPiece;                            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWDT_ConfigTextInputPiece_C*            K2Node_DynamicCast_AsWDT_Config_Text_Input_Piece;  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuInputTextPiece_C_ExecuteUbergraph_WDT_ConfigMenuInputTextPiece;

// Function WDT_ConfigMenuInputTextPiece.WDT_ConfigMenuInputTextPiece_C.Deselect
// 0x0002 (0x0002 - 0x0000)
struct WDT_ConfigMenuInputTextPiece_C_Deselect final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigMenuInputTextPiece_C_Deselect;

}

