#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_MatchingSettingsText

#include "Basic.hpp"

#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function WDT_MatchingSettingsText.WDT_MatchingSettingsText_C.Update
// 0x00E0 (0x00E0 - 0x0000)
struct WDT_MatchingSettingsText_C_Update final
{
public:
	class UConfigurationManager*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FConfigurationNetworkUserSaveData      CallFunc_GetConfigNetworkUserSaveData_ReturnValue; // 0x0008(0x0020)(ConstParm)
	struct FConfigurationNetworkSaveData          CallFunc_GetConfigNetworkSaveData_ReturnValue;     // 0x0028(0x0020)(ConstParm)
	class FText                                   CallFunc_GetGestureName_ReturnValue;               // 0x0048(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0068(0x0010)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0080(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value_1;                         // 0x0098(0x0010)()
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UOnlineUserSubsystem*                   CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class UCommonUserInfo*                  CallFunc_GetUserInfoForLocalPlayerIndex_ReturnValue; // 0x00B8(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetNickname_ReturnValue;                  // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00D0(0x0010)()
};
DUMPER7_ASSERTS_WDT_MatchingSettingsText_C_Update;

// Function WDT_MatchingSettingsText.WDT_MatchingSettingsText_C.ExecuteUbergraph_WDT_MatchingSettingsText
// 0x0028 (0x0028 - 0x0000)
struct WDT_MatchingSettingsText_C_ExecuteUbergraph_WDT_MatchingSettingsText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_UIManager_C*                        CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUIObjectBase*                          CallFunc_GetUIObjectByClass_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMatchingUIObject*                      K2Node_DynamicCast_AsMatching_UIObject;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MatchingSettingsText_C_ExecuteUbergraph_WDT_MatchingSettingsText;

}

