#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigPieceBase

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WDT_ConfigPieceBase.WDT_ConfigPieceBase_C.SetTitleText
// 0x0018 (0x0018 - 0x0000)
struct WDT_ConfigPieceBase_C_SetTitleText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Success;                                           // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigPieceBase_C_SetTitleText;

// Function WDT_ConfigPieceBase.WDT_ConfigPieceBase_C.SetIsEditable
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigPieceBase_C_SetIsEditable final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigPieceBase_C_SetIsEditable;

// Function WDT_ConfigPieceBase.WDT_ConfigPieceBase_C.SetEnableColor
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigPieceBase_C_SetEnableColor final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigPieceBase_C_SetEnableColor;

// Function WDT_ConfigPieceBase.WDT_ConfigPieceBase_C.SetEditableGrayOut
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigPieceBase_C_SetEditableGrayOut final
{
public:
	bool                                          Flag;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigPieceBase_C_SetEditableGrayOut;

// Function WDT_ConfigPieceBase.WDT_ConfigPieceBase_C.SetDisableColor
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigPieceBase_C_SetDisableColor final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigPieceBase_C_SetDisableColor;

// Function WDT_ConfigPieceBase.WDT_ConfigPieceBase_C.OnRightPressed
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigPieceBase_C_OnRightPressed final
{
public:
	bool                                          bInIsPressStarted;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigPieceBase_C_OnRightPressed;

// Function WDT_ConfigPieceBase.WDT_ConfigPieceBase_C.OnLeftPressed
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigPieceBase_C_OnLeftPressed final
{
public:
	bool                                          bInIsPressStarted;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigPieceBase_C_OnLeftPressed;

// Function WDT_ConfigPieceBase.WDT_ConfigPieceBase_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct WDT_ConfigPieceBase_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_Unhandled_ReturnValue;                    // 0x00F8(0x00B8)()
};
DUMPER7_ASSERTS_WDT_ConfigPieceBase_C_OnFocusReceived;

// Function WDT_ConfigPieceBase.WDT_ConfigPieceBase_C.GetUseMoveImage
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigPieceBase_C_GetUseMoveImage final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigPieceBase_C_GetUseMoveImage;

// Function WDT_ConfigPieceBase.WDT_ConfigPieceBase_C.GetPhotoModeIntParameterType
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigPieceBase_C_GetPhotoModeIntParameterType final
{
public:
	EPhotoModeIntParameter                        NewParam;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigPieceBase_C_GetPhotoModeIntParameterType;

// Function WDT_ConfigPieceBase.WDT_ConfigPieceBase_C.GetPhotoModeBoolParameterType
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigPieceBase_C_GetPhotoModeBoolParameterType final
{
public:
	EPhotoModeBoolParameter                       OutType;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigPieceBase_C_GetPhotoModeBoolParameterType;

// Function WDT_ConfigPieceBase.WDT_ConfigPieceBase_C.GetLogTexture
// 0x0030 (0x0030 - 0x0000)
struct WDT_ConfigPieceBase_C_GetLogTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              OutTexture;                                        // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          OutIsSuccess;                                      // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigPieceBase_C_GetLogTexture;

// Function WDT_ConfigPieceBase.WDT_ConfigPieceBase_C.GetLogMoviePath
// 0x0018 (0x0018 - 0x0000)
struct WDT_ConfigPieceBase_C_GetLogMoviePath final
{
public:
	class FString                                 OutPath;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          OutIsSuccess;                                      // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigPieceBase_C_GetLogMoviePath;

// Function WDT_ConfigPieceBase.WDT_ConfigPieceBase_C.GetIsException
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigPieceBase_C_GetIsException final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigPieceBase_C_GetIsException;

// Function WDT_ConfigPieceBase.WDT_ConfigPieceBase_C.GetIsEditable
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigPieceBase_C_GetIsEditable final
{
public:
	bool                                          OutFlag;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigPieceBase_C_GetIsEditable;

// Function WDT_ConfigPieceBase.WDT_ConfigPieceBase_C.ExecuteUbergraph_WDT_ConfigPieceBase
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigPieceBase_C_ExecuteUbergraph_WDT_ConfigPieceBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsPressStarted_1;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsPressStarted;                    // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigPieceBase_C_ExecuteUbergraph_WDT_ConfigPieceBase;

}

