#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Article_IchorConsumption

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_Article_IchorConsumption.WDT_Article_IchorConsumption_C.SetValue
// 0x0018 (0x0018 - 0x0000)
struct WDT_Article_IchorConsumption_C_SetValue final
{
public:
	int32                                         InValue;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0010)()
};
DUMPER7_ASSERTS_WDT_Article_IchorConsumption_C_SetValue;

// Function WDT_Article_IchorConsumption.WDT_Article_IchorConsumption_C.SetValueComparison
// 0x000C (0x000C - 0x0000)
struct WDT_Article_IchorConsumption_C_SetValueComparison final
{
public:
	int32                                         InCurrentValue;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InTargetValue;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SwapComparisons;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_Article_IchorConsumption_C_SetValueComparison;

}

