#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_IchorAmountPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_IchorAmountPanel.WDT_IchorAmountPanel_C
// 0x0048 (0x0648 - 0x0600)
class UWDT_IchorAmountPanel_C final : public UHudPieceBase
{
public:
	class UWidgetAnimation*                       BattleEndAnimation;                                // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrentIchorAmountText;                            // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CurrentIchorAmountText_Shadow;                     // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 IchorGauge;                                        // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       MaxIchorAmountText;                                // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_2;                                         // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentIchor;                                      // 0x0630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxIchor;                                          // 0x0634(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           ForcedShowTimerHandle;                             // 0x0638(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ForcedShowTime;                                    // 0x0640(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ForcedShowByUsage();
	void HideByGadgetPanel();
	void NotifyIchorChanged(double InCurrentIchor, double InMaxIchor, EResourceChangeFactor InChangeFactor);
	void OnBattleStateChanged(bool InBattleState);
	void OnForcedShowByUsageEnd();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_IchorAmountPanel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_IchorAmountPanel_C")
	}
	static class UWDT_IchorAmountPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_IchorAmountPanel_C>();
	}
};
DUMPER7_ASSERTS_UWDT_IchorAmountPanel_C;

}

