#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_MiniTabPiece

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_MiniTabPiece.WDT_MiniTabPiece_C.SetSelectedIndex
// 0x0004 (0x0004 - 0x0000)
struct WDT_MiniTabPiece_C_SetSelectedIndex final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MiniTabPiece_C_SetSelectedIndex;

// Function WDT_MiniTabPiece.WDT_MiniTabPiece_C.Select
// 0x0002 (0x0002 - 0x0000)
struct WDT_MiniTabPiece_C_Select final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MiniTabPiece_C_Select;

// Function WDT_MiniTabPiece.WDT_MiniTabPiece_C.GetIndexForItem
// 0x0010 (0x0010 - 0x0000)
struct WDT_MiniTabPiece_C_GetIndexForItem final
{
public:
	class UObject*                                InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         OutIndex;                                          // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetIndexForItem_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MiniTabPiece_C_GetIndexForItem;

// Function WDT_MiniTabPiece.WDT_MiniTabPiece_C.ExecuteUbergraph_WDT_MiniTabPiece
// 0x0020 (0x0020 - 0x0000)
struct WDT_MiniTabPiece_C_ExecuteUbergraph_WDT_MiniTabPiece final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_ComponentBoundEvent_Item_1;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_ComponentBoundEvent_Item;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsHovered;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MiniTabPiece_C_ExecuteUbergraph_WDT_MiniTabPiece;

// Function WDT_MiniTabPiece.WDT_MiniTabPiece_C.Deselect
// 0x0002 (0x0002 - 0x0000)
struct WDT_MiniTabPiece_C_Deselect final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MiniTabPiece_C_Deselect;

// Function WDT_MiniTabPiece.WDT_MiniTabPiece_C.BndEvt__WDT_MiniTabPiece_ListScroller_46_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WDT_MiniTabPiece_C_BndEvt__WDT_MiniTabPiece_ListScroller_46_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MiniTabPiece_C_BndEvt__WDT_MiniTabPiece_ListScroller_46_K2Node_ComponentBoundEvent_1_SimpleListItemEventDynamic__DelegateSignature;

// Function WDT_MiniTabPiece.WDT_MiniTabPiece_C.BndEvt__WDT_MiniTabPiece_ListScroller_46_K2Node_ComponentBoundEvent_0_OnItemIsHoveredChangedDynamic__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WDT_MiniTabPiece_C_BndEvt__WDT_MiniTabPiece_ListScroller_46_K2Node_ComponentBoundEvent_0_OnItemIsHoveredChangedDynamic__DelegateSignature final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHovered;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MiniTabPiece_C_BndEvt__WDT_MiniTabPiece_ListScroller_46_K2Node_ComponentBoundEvent_0_OnItemIsHoveredChangedDynamic__DelegateSignature;

// Function WDT_MiniTabPiece.WDT_MiniTabPiece_C.AddItem
// 0x0008 (0x0008 - 0x0000)
struct WDT_MiniTabPiece_C_AddItem final
{
public:
	class UObject*                                InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MiniTabPiece_C_AddItem;

}

