#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_MapMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_MapMenu.WDT_MapMenu_C
// 0x0030 (0x05E8 - 0x05B8)
class UWDT_MapMenu_C final : public UMenuBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MapOpenAnimation;                                  // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BG;                                                // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_MapImage_C*                        WDT_MapImage;                                      // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_MapMenuUIObject_C*                  BPMapMenuUIObject;                                 // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          DefaultShowMouseCursor;                            // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void ExecuteUbergraph_WDT_MapMenu(int32 EntryPoint);
	void IsOpenSupportMenu(bool* IsOpen);
	void OnClosed();
	void OnClosing();
	void OnInputDeviceChanged();
	void OnMenuInitialized();
	void OnNotifyFastTravelProhibited(bool InProhibited);
	void OnOpened();
	void OnOpening();
	void SetSelectFeature(const struct FGameplayTag& InFeatureId, class FName InSelectLouDiaryID);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_MapMenu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_MapMenu_C")
	}
	static class UWDT_MapMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_MapMenu_C>();
	}
};
DUMPER7_ASSERTS_UWDT_MapMenu_C;

}

