#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_CategoryPallet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_CategoryPallet.WDT_CategoryPallet_C
// 0x0060 (0x0658 - 0x05F8)
class UWDT_CategoryPallet_C final : public UCategoryPalletMenu
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URichTextBlock*                         IconText_SwitchLeft;                               // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         IconText_SwitchRight;                              // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_CategoryPalletSlot_C*              WDT_CategoryPalletSlot;                            // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_CategoryPalletSlot_C*              WDT_CategoryPalletSlot_1;                          // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_CategoryPalletSlot_C*              WDT_CategoryPalletSlot_2;                          // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_CategoryPalletSlot_C*              WDT_CategoryPalletSlot_3;                          // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_CategoryPalletSlot_C*              WDT_CategoryPalletSlot_4;                          // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_CategoryPalletSlot_C*              WDT_CategoryPalletSlot_5;                          // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_CategoryPalletSlot_C*              WDT_CategoryPalletSlot_6;                          // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_CategoryPalletSlot_C*              WDT_CategoryPalletSlot_7;                          // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SlotIndexChanged(const int32 InIndex);
	void RefreshTextLayout();
	void OnMouseLeftClickSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeaveSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseEnterSubPiece(class UMenuPieceBase* MenuPiece);
	class UMenuPieceBase* GetPalettSlot8();
	class UMenuPieceBase* GetPalettSlot7();
	class UMenuPieceBase* GetPalettSlot6();
	class UMenuPieceBase* GetPalettSlot5();
	class UMenuPieceBase* GetPalettSlot4();
	class UMenuPieceBase* GetPalettSlot3();
	class UMenuPieceBase* GetPalettSlot2();
	class UMenuPieceBase* GetPalettSlot1();
	void ExecuteUbergraph_WDT_CategoryPallet(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_CategoryPallet_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_CategoryPallet_C")
	}
	static class UWDT_CategoryPallet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_CategoryPallet_C>();
	}
};
DUMPER7_ASSERTS_UWDT_CategoryPallet_C;

}

