#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_FieldMenuTileBC

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.Unhighlight
// 0x0002 (0x0002 - 0x0000)
struct WDT_FieldMenuTileBC_C_Unhighlight final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_Unhighlight;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.SetTexture
// 0x0010 (0x0010 - 0x0000)
struct WDT_FieldMenuTileBC_C_SetTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_SetTexture;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.SetSubTexture
// 0x0018 (0x0018 - 0x0000)
struct WDT_FieldMenuTileBC_C_SetSubTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_SetSubTexture;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.SetSubLazyTexture
// 0x0038 (0x0038 - 0x0000)
struct WDT_FieldMenuTileBC_C_SetSubLazyTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              LazyTexture;                                       // 0x0008(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_SetSubLazyTexture;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.SetLazyTexture
// 0x0030 (0x0030 - 0x0000)
struct WDT_FieldMenuTileBC_C_SetLazyTexture final
{
public:
	TSoftObjectPtr<class UTexture2D>              LazyTexture;                                       // 0x0000(0x0028)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_SetLazyTexture;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.Select
// 0x0010 (0x0010 - 0x0000)
struct WDT_FieldMenuTileBC_C_Select final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_Select;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.Reset
// 0x0001 (0x0001 - 0x0000)
struct WDT_FieldMenuTileBC_C_Reset final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_Reset;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.PlayDecideAnimation
// 0x0008 (0x0008 - 0x0000)
struct WDT_FieldMenuTileBC_C_PlayDecideAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_PlayDecideAnimation;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WDT_FieldMenuTileBC_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_OnListItemObjectSet;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.Highlight
// 0x0002 (0x0002 - 0x0000)
struct WDT_FieldMenuTileBC_C_Highlight final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_Highlight;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.FlipTexture
// 0x0002 (0x0002 - 0x0000)
struct WDT_FieldMenuTileBC_C_FlipTexture final
{
public:
	bool                                          IsInverse;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_FlipTexture;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.ExecuteUbergraph_WDT_FieldMenuTileBC
// 0x0018 (0x0018 - 0x0000)
struct WDT_FieldMenuTileBC_C_ExecuteUbergraph_WDT_FieldMenuTileBC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Select_ReturnValue;                       // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Deselect_ReturnValue;                     // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_ExecuteUbergraph_WDT_FieldMenuTileBC;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.Enable
// 0x0002 (0x0002 - 0x0000)
struct WDT_FieldMenuTileBC_C_Enable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Enable_ReturnValue;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_Enable;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.Disable
// 0x0002 (0x0002 - 0x0000)
struct WDT_FieldMenuTileBC_C_Disable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Disable_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_Disable;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.Deselect
// 0x0002 (0x0002 - 0x0000)
struct WDT_FieldMenuTileBC_C_Deselect final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_Deselect;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.ClearTexture
// 0x0001 (0x0001 - 0x0000)
struct WDT_FieldMenuTileBC_C_ClearTexture final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_ClearTexture;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.ClearSubTexture
// 0x000C (0x000C - 0x0000)
struct WDT_FieldMenuTileBC_C_ClearSubTexture final
{
public:
	class FName                                   ImageId;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_ClearSubTexture;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_FieldMenuTileBC_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_BP_OnItemSelectionChanged;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_FieldMenuTileBC_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_BP_OnItemExpansionChanged;

// Function WDT_FieldMenuTileBC.WDT_FieldMenuTileBC_C.Blink
// 0x0001 (0x0001 - 0x0000)
struct WDT_FieldMenuTileBC_C_Blink final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_FieldMenuTileBC_C_Blink;

}

