#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_HistorySaveDataPiece

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WDT_HistorySaveDataPiece.WDT_HistorySaveDataPiece_C.SetOptionText
// 0x0010 (0x0010 - 0x0000)
struct WDT_HistorySaveDataPiece_C_SetOptionText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WDT_HistorySaveDataPiece_C_SetOptionText;

// Function WDT_HistorySaveDataPiece.WDT_HistorySaveDataPiece_C.SetHistorySaveDataInfo
// 0x02A8 (0x02A8 - 0x0000)
struct WDT_HistorySaveDataPiece_C_SetHistorySaveDataInfo final
{
public:
	struct FUIHistorySaveDataInfo                 InSaveData;                                        // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0010)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0070(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0080(0x0010)()
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00A0(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x00B0(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00C0(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0108(0x0048)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_4;          // 0x0150(0x0010)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_5;          // 0x0160(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0170(0x0048)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01B8(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue_1;          // 0x0200(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_6;          // 0x0210(0x0010)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x0220(0x0048)(HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0268(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0278(0x0010)(ReferenceParm)
	class FText                                   CallFunc_AsDateTimeWithCustomFormat_ReturnValue;   // 0x0288(0x0010)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0298(0x0010)()
};
DUMPER7_ASSERTS_WDT_HistorySaveDataPiece_C_SetHistorySaveDataInfo;

// Function WDT_HistorySaveDataPiece.WDT_HistorySaveDataPiece_C.Select
// 0x0002 (0x0002 - 0x0000)
struct WDT_HistorySaveDataPiece_C_Select final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_HistorySaveDataPiece_C_Select;

// Function WDT_HistorySaveDataPiece.WDT_HistorySaveDataPiece_C.OnMenuPieceUnhighlight
// 0x0002 (0x0002 - 0x0000)
struct WDT_HistorySaveDataPiece_C_OnMenuPieceUnhighlight final
{
public:
	bool                                          bPlayAnimation;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_HistorySaveDataPiece_C_OnMenuPieceUnhighlight;

// Function WDT_HistorySaveDataPiece.WDT_HistorySaveDataPiece_C.OnMenuPieceHighlight
// 0x0002 (0x0002 - 0x0000)
struct WDT_HistorySaveDataPiece_C_OnMenuPieceHighlight final
{
public:
	bool                                          bPlayAnimation;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_HistorySaveDataPiece_C_OnMenuPieceHighlight;

// Function WDT_HistorySaveDataPiece.WDT_HistorySaveDataPiece_C.Deselect
// 0x0002 (0x0002 - 0x0000)
struct WDT_HistorySaveDataPiece_C_Deselect final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_HistorySaveDataPiece_C_Deselect;

}

