#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ItemSynthetic_RawMaterialMenu

#include "Basic.hpp"

#include "Extensions_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WDT_ItemSynthetic_RawMaterialMenu.WDT_ItemSynthetic_RawMaterialMenu_C.SetMaterialInfo
// 0x00B0 (0x00B0 - 0x0000)
struct WDT_ItemSynthetic_RawMaterialMenu_C_SetMaterialInfo final
{
public:
	struct FRawMaterialUIInfo                     RawMaterialUIInfo;                                 // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Count;                                             // 0x0048(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSotrage;                                        // 0x004C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0058(0x0010)()
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0070(0x0010)()
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0088(0x0010)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0098(0x0014)()
};
DUMPER7_ASSERTS_WDT_ItemSynthetic_RawMaterialMenu_C_SetMaterialInfo;

// Function WDT_ItemSynthetic_RawMaterialMenu.WDT_ItemSynthetic_RawMaterialMenu_C.IsMaterialsShortage
// 0x0002 (0x0002 - 0x0000)
struct WDT_ItemSynthetic_RawMaterialMenu_C_IsMaterialsShortage final
{
public:
	bool                                          Can_tCreate;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ItemSynthetic_RawMaterialMenu_C_IsMaterialsShortage;

}

