#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigMenuTypeSelectPiece

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WDT_ConfigPieceBase_classes.hpp"
#include "Extensions_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ConfigMenuTypeSelectPiece.WDT_ConfigMenuTypeSelectPiece_C
// 0x00A0 (0x06D8 - 0x0638)
class UWDT_ConfigMenuTypeSelectPiece_C final : public UWDT_ConfigPieceBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WDT_ConfigMenuTypeSelectPiece_C;    // 0x0638(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URichTextBlock*                         IconText_Decide;                                   // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigTextElement_C*               WDT_ConfigTextElement;                             // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ConfigTypeSelectPiece_C*           WDT_ConfigTypeSelectElement;                       // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_LeftArrowPiece_C*                  WDT_LeftArrowPiece;                                // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_MiniTabPiece_C*                    WDT_MiniTabPiece;                                  // 0x0660(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_RightArrowPiece_C*                 WDT_RightArrowPiece;                               // 0x0668(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           TypeTextList;                                      // 0x0670(0x0010)(Edit, BlueprintVisible)
	int32                                         DefaultTextListIndex;                              // 0x0680(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseMiniTab;                                       // 0x0684(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_685[0x3];                                      // 0x0685(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              ImageTexture;                                      // 0x0688(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FString                                 MoviePath;                                         // 0x06B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	EPhotoModeIntParameter                        PhotoModeIntParamterType;                          // 0x06C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsForcedLoop;                                     // 0x06C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C2[0x2];                                      // 0x06C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           DisableColor;                                      // 0x06C4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldSelectIndex;                                    // 0x06D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTextStyle();
	void SetupTypeSelectElementSettings(TArray<class FText>& InTextList);
	void SetSelectIndex(int32 InIndex);
	void SetIsEditable(bool InFlag);
	void SetEnableColor(bool* OutFlag);
	void SetEditableGrayOut(bool* Flag);
	void SetDisableColor(bool* OutFlag);
	void SetDefaultSelectIndex(int32 InInitializeIndex, int32 InDefaultIndex);
	void SetButtonIconVisibility(bool InVisible);
	bool Select(bool PlayAnimation_0);
	void RefreshKeyImage();
	void PreConstruct(bool IsDesignTime);
	void OnRightPressed(bool bInIsPressStarted);
	void OnMouseWheelUpSubPiece(class UMenuPieceBase* MenuPiece, int32 Level);
	void OnMouseWheelDownSubPiece(class UMenuPieceBase* MenuPiece, int32 Level);
	void OnMouseLeftClickSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeaveSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseEnterSubPiece(class UMenuPieceBase* MenuPiece);
	void OnLeftPressed(bool bInIsPressStarted);
	void Next(bool bInCanWarp);
	void InitializeToDefaultValue();
	void Initialize();
	void GetSelectItem(class FText* SelectText, int32* SelectIndex);
	void GetSelectIndex(int32* OutIndex);
	void GetPhotoModeIntParameterType(EPhotoModeIntParameter* NewParam);
	void GetLogTexture(TSoftObjectPtr<class UTexture2D>* OutTexture, bool* OutIsSuccess);
	void GetLogMoviePath(class FString* OutPath, bool* OutIsSuccess);
	void GetLastIndex(int32* OutIndex);
	void GetDefaultSelectIndex(int32* OutDefaultIndex);
	void ExecuteUbergraph_WDT_ConfigMenuTypeSelectPiece(int32 EntryPoint);
	bool Deselect(bool PlayAnimation_0);
	void BndEvt__WDT_ConfigMenuTypeSelectPiece_WDT_MiniTabPiece_K2Node_ComponentBoundEvent_0_OnItemClickedEvent__DelegateSignature(class UObject* Item);
	void Back(bool bInCanWarp);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ConfigMenuTypeSelectPiece_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ConfigMenuTypeSelectPiece_C")
	}
	static class UWDT_ConfigMenuTypeSelectPiece_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ConfigMenuTypeSelectPiece_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ConfigMenuTypeSelectPiece_C;

}

