#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Article_AttributeMod

#include "Basic.hpp"

#include "WDT_Status_PieceBase_classes.hpp"
#include "Extensions_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_Article_AttributeMod.WDT_Article_AttributeMod_C
// 0x0060 (0x0728 - 0x06C8)
class UWDT_Article_AttributeMod_C final : public UWDT_Status_PieceBase_C
{
public:
	class UWDT_ArticleDiffArrowElement_C*         Arrow_Attr_Mod_DEX;                                // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_Attr_Mod_FOR;                                // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_Attr_Mod_MIND;                               // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_Attr_Mod_STR;                                // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_Attr_Mod_VIT;                                // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_Attr_Mod_WILL;                               // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AttrModDEX;                                        // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AttrModFOR;                                        // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AttrModMIND;                                       // 0x0708(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AttrModSTR;                                        // 0x0710(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AttrModVIT;                                        // 0x0718(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             AttrModWILL;                                       // 0x0720(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void GetRankTextByRankEnum(EUIAttributeModifierRank RankEnum, class FText* RankText);
	void SetDEXValue(EUIAttributeModifierRank InValue);
	void SetDEXValueComparison(double InCurrentValue, double InTargetValue, bool SwapComparison);
	void SetFORValue(EUIAttributeModifierRank InValue);
	void SetFORValueComparison(double InCurrentValue, double InTargetValue, bool SwapComparison);
	void SetMINDValue(EUIAttributeModifierRank InValue);
	void SetMINDValueComparison(double InCurrentValue, double InTargetValue, bool SwapComparison);
	void SetSTRValue(EUIAttributeModifierRank InValue);
	void SetSTRValueComparison(double InCurrentValue, double InTargetValue, bool SwapComparison);
	void SetValue(class UTextBlock* Target, EUIAttributeModifierRank RankEnum);
	void SetValueComparison(double EquipValue, double TargetValue, bool SwapComparison, class UTextBlock* Target, class UWDT_ArticleDiffArrowElement_C* Arrow);
	void SetVITValue(EUIAttributeModifierRank InValue);
	void SetVITValueComparison(double InCurrentValue, double InTargetValue, bool SwapComparison);
	void SetWILLValue(EUIAttributeModifierRank InValue);
	void SetWILLValueComparison(double InCurrentValue, double InTargetValue, bool SwapComparison);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_Article_AttributeMod_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_Article_AttributeMod_C")
	}
	static class UWDT_Article_AttributeMod_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_Article_AttributeMod_C>();
	}
};
DUMPER7_ASSERTS_UWDT_Article_AttributeMod_C;

}

