#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_HealthGauge

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_HealthGauge.WDT_HealthGauge_C
// 0x0038 (0x0638 - 0x0600)
class UWDT_HealthGauge_C final : public UHudPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BattleEndAnimation;                                // 0x0608(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWDT_PlayerResourceBar_C*               HealthBar;                                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_50;                                        // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool InIsVisible)> OnChangeVisibleByBatttleState;                  // 0x0628(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WDT_HealthGauge(int32 EntryPoint);
	void ForcedShow();
	void GetMaxPercent(double* OutLength);
	void GetResourcePercent(double* OutPercent);
	void HideBattleState();
	void OnBattleStateChanged(bool InBattleState);
	bool SetHealth(const float InHealth, const float InMaxHealth, const float InRecoverableHealth, const EResourceChangeFactor InFactor);
	void UpdateVisibilityBasedOnBattleState();
	void WidgetAnimationEvt_BattleEndAnimation_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_BattleEndAnimation_K2Node_WidgetAnimationEvent_1();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_HealthGauge_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_HealthGauge_C")
	}
	static class UWDT_HealthGauge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_HealthGauge_C>();
	}
};
DUMPER7_ASSERTS_UWDT_HealthGauge_C;

}

