#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_MapLostExpMarker

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_MapLostExpMarker.WDT_MapLostExpMarker_C.SetUserIndex
// 0x0020 (0x0020 - 0x0000)
struct WDT_MapLostExpMarker_C_SetUserIndex final
{
public:
	int32                                         InUserIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapLostExpMarker_C_SetUserIndex;

// Function WDT_MapLostExpMarker.WDT_MapLostExpMarker_C.PlaySelectAnimation
// 0x0008 (0x0008 - 0x0000)
struct WDT_MapLostExpMarker_C_PlaySelectAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapLostExpMarker_C_PlaySelectAnimation;

// Function WDT_MapLostExpMarker.WDT_MapLostExpMarker_C.PlayDeselectAnimation
// 0x0008 (0x0008 - 0x0000)
struct WDT_MapLostExpMarker_C_PlayDeselectAnimation final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapLostExpMarker_C_PlayDeselectAnimation;

// Function WDT_MapLostExpMarker.WDT_MapLostExpMarker_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WDT_MapLostExpMarker_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapLostExpMarker_C_OnAnimationFinished;

// Function WDT_MapLostExpMarker.WDT_MapLostExpMarker_C.ExecuteUbergraph_WDT_MapLostExpMarker
// 0x0020 (0x0020 - 0x0000)
struct WDT_MapLostExpMarker_C_ExecuteUbergraph_WDT_MapLostExpMarker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapLostExpMarker_C_ExecuteUbergraph_WDT_MapLostExpMarker;

}

