#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Status_Defence

#include "Basic.hpp"

#include "WDT_Status_PieceBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_Status_Defence.WDT_Status_Defence_C
// 0x0038 (0x0700 - 0x06C8)
class UWDT_Status_Defence_C final : public UWDT_Status_PieceBase_C
{
public:
	class UCommonTextBlock*                       CommonText_Defence1Sunder;                         // 0x06C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_Defence2Crush;                          // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_Defence3Pierce;                         // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_Diffence1Blood;                         // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_Diffence2Fire;                          // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_ElementDiffence3Ice;                    // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_ElementDiffence4Thunder;                // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetDefence(double InSunder, double InCrush, double InPierce, double InBlood, double InFire, double InIce, double InThunder);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_Status_Defence_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_Status_Defence_C")
	}
	static class UWDT_Status_Defence_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_Status_Defence_C>();
	}
};
DUMPER7_ASSERTS_UWDT_Status_Defence_C;

}

