#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_HistorySaveDataSelectDialog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "BasicUI_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_HistorySaveDataSelectDialog.WDT_HistorySaveDataSelectDialog_C
// 0x00C0 (0x06E0 - 0x0620)
class UWDT_HistorySaveDataSelectDialog_C final : public UDialogBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0620(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SystemYesNoDialogClose;                            // 0x0628(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SystemYesNoDialogOpen;                             // 0x0630(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWDT_HistorySaveDataPiece_C*            HistorySaveSlot1;                                  // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_HistorySaveDataPiece_C*            HistorySaveSlot2;                                  // 0x0640(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_HistorySaveDataPiece_C*            HistorySaveSlot3;                                  // 0x0648(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_HistorySaveDataPiece_C*            HistorySaveSlot4;                                  // 0x0650(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_SelectPiece;                           // 0x0658(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DecidePressed;                                     // 0x0660(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_661[0x7];                                      // 0x0661(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWDT_HistorySaveDataPiece_C*>    Buttons;                                           // 0x0668(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UBP_SaveDataMenuUIObject_C*             SaveDataSelectUIObject;                            // 0x0678(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FUIHistorySaveDataInfo>         CurrentHistorySaveDataInfoArray;                   // 0x0680(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentHistoryIndex;                               // 0x0690(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_694[0x4];                                      // 0x0694(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMenuContext                           ErrorDialog;                                       // 0x0698(0x0038)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class FText                                   NotEnoughDLCErrorText;                             // 0x06D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void ExecuteUbergraph_WDT_HistorySaveDataSelectDialog(int32 EntryPoint);
	void GetSelectedPieceIndex(class UMenuPieceBase* SelectedPiece, int32* Index_0);
	void Initialize();
	void InpActEvt_IA_UI_CancelOnRelease_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_DecideOnRelease_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Down_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UI_Up_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void IsValidHistorySaveData(int32 InIndex, bool* Result);
	void OnCancelPressed();
	void OnClosed();
	void OnClosedErrorDialog();
	void OnDecidePressed();
	void OnDecideWarningDialog(uint8 DecideOptionNumber);
	void OnDownPressed();
	class UWidgetAnimation* OnGetCloseAnimation();
	class UWidgetAnimation* OnGetOpenAnimation();
	void OnMenuInitialized();
	void OnMouseEnterMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeftClickMenuPiece(class UMenuPieceBase* MenuPiece);
	void OnOpened();
	void OnOpening();
	void OnSetDialogInfo(const struct FDialogInfo& InDialogInfo);
	void OnUpPressed();
	void OpenNotEnoughDLCErrorDialog(TArray<EDLCType>& NotEnoughDLCs);
	void SetHistorySaveDataArray(TArray<struct FUIHistorySaveDataInfo>& InHistorySaveDatas);
	void SetSelectDialogIndex(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_HistorySaveDataSelectDialog_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_HistorySaveDataSelectDialog_C")
	}
	static class UWDT_HistorySaveDataSelectDialog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_HistorySaveDataSelectDialog_C>();
	}
};
DUMPER7_ASSERTS_UWDT_HistorySaveDataSelectDialog_C;

}

