#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_BuddyIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BasicUI_classes.hpp"
#include "Extensions_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_BuddyIndicator.WDT_BuddyIndicator_C
// 0x0078 (0x0630 - 0x05B8)
class UWDT_BuddyIndicator_C final : public UMenuBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       BattleEndAnimation;                                // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWDT_BarrierGauge_C*                    BarrierGauge;                                      // 0x05C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_BuddyGauge_C*                      BuddyGauge;                                        // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_BuddyIcon_C*                       BuddyIcon;                                         // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           BuddyIconBox;                                      // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_BuddyIcon_C*                       LouIcon;                                           // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_1;                                     // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Barrier;                                   // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_MountIcon_C*                       WDT_MountIcon;                                     // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           ForcedShowTimerHandle;                             // 0x0608(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ForcedShowTime;                                    // 0x0610(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FixedBarrierGaugeLength;                           // 0x0614(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BarrierLengthRatio;                                // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BarrierGaugeLength;                                // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BuddyType;                                         // 0x0628(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_WDT_BuddyIndicator(int32 EntryPoint);
	void ForcedShowByStatement();
	void GetBarrierGauge(class UWDT_BarrierGauge_C** OutBarrierGauge);
	void GetBuddyGauge(class UWDT_BuddyGauge_C** OutGauge);
	void GetBuddyIcon(class UWDT_BuddyIcon_C** OutIcon);
	void GetBuddyIconBox(class UVerticalBox** OutIconBox);
	void IsShowExplorationDialog(bool* InIsShow);
	void OnBattleStateChanged(bool InBattleState);
	void OnForcedShowByStatementEnd();
	void OnInputDeviceChanged();
	void OnNotifyBuddyStatementFinished(bool IsLouStatement);
	void OnNotifyBuddyStatementStarted(bool IsLouStatement);
	void PreConstruct(bool IsDesignTime);
	void SetBarrierGaugeLength(double InMaxBarrier);
	void SetBarrierGaugeVisible(bool InVisible);
	void SetBuddyIcon(class UMaterialInstance* InBuddyMaterial);
	void SetBuddyType(const struct FGameplayTag& InBuddyType);
	void SetLouIconVisible(bool InVisible);
	void SetNoMountAction(bool InIsNoMountAction);
	void ShowBuddyIcon(bool IsShow);
	void UpdateMountIconVisibility();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_BuddyIndicator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_BuddyIndicator_C")
	}
	static class UWDT_BuddyIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_BuddyIndicator_C>();
	}
};
DUMPER7_ASSERTS_UWDT_BuddyIndicator_C;

}

