#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_MapCursor

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WDT_MapCursor.WDT_MapCursor_C.SetVisibilityFeatureNameText
// 0x0001 (0x0001 - 0x0000)
struct WDT_MapCursor_C_SetVisibilityFeatureNameText final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapCursor_C_SetVisibilityFeatureNameText;

// Function WDT_MapCursor.WDT_MapCursor_C.SetGuideVisibility
// 0x0001 (0x0001 - 0x0000)
struct WDT_MapCursor_C_SetGuideVisibility final
{
public:
	bool                                          InFlag;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapCursor_C_SetGuideVisibility;

// Function WDT_MapCursor.WDT_MapCursor_C.SetFeatureNameText
// 0x0018 (0x0018 - 0x0000)
struct WDT_MapCursor_C_SetFeatureNameText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapCursor_C_SetFeatureNameText;

// Function WDT_MapCursor.WDT_MapCursor_C.GetCursorSize
// 0x0020 (0x0020 - 0x0000)
struct WDT_MapCursor_C_GetCursorSize final
{
public:
	struct FVector2D                              OutSize;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_MapCursor_C_GetCursorSize;

// Function WDT_MapCursor.WDT_MapCursor_C.ActivateCursorGuide_AreaBuff
// 0x0010 (0x0010 - 0x0000)
struct WDT_MapCursor_C_ActivateCursorGuide_AreaBuff final
{
public:
	class FText                                   InGuideText;                                       // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WDT_MapCursor_C_ActivateCursorGuide_AreaBuff;

}

