#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_NumberMeter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_NumberMeter.WDT_NumberMeter_C
// 0x0090 (0x0678 - 0x05E8)
class UWDT_NumberMeter_C final : public UMeterPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Cancel_NumberMeter;                                // 0x05F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Confirmed_NumberMeter;                             // 0x05F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open_NumberMeter;                                  // 0x0600(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_IndicatorCtrl;                              // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                CtrlFontTop;                                       // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectLeftImage;                                   // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectRightImage;                                  // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ItemNumber;                              // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_LeftArrowPiece_C*                  WDT_LeftArrowPiece;                                // 0x0630(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_RightArrowPiece_C*                 WDT_RightArrowPiece;                               // 0x0638(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         MinDigits;                                         // 0x0640(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxDigits;                                         // 0x0644(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(double ChangedDisplayNumber)> OnValueChanged;                      // 0x0648(0x0010)(Edit, BlueprintVisible, ZeroConstructor, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnEndCloseAnimation;                               // 0x0658(0x0010)(Edit, BlueprintVisible, ZeroConstructor, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnEndOpenAnimation;                                // 0x0668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void WidgetAnimationEvt_Open_NumberMeter_K2Node_WidgetAnimationEvent_2();
	void WidgetAnimationEvt_Confirmed_NumberMeter_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_Cancel_NumberMeter_K2Node_WidgetAnimationEvent_1();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Open_Meter_Piece(double CurrentMeterValue, double MaxMeterValue, double MiniMeterValue);
	void OnMouseLeftClickSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseLeaveSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMouseEnterSubPiece(class UMenuPieceBase* MenuPiece);
	void OnMeterValueChanged(float MeterValueToNotify, float Percentage, float DisplayNumber, bool PlayAnimation_0);
	void IsMeterValueMin(bool* NewParam);
	void IsMeterValueMax(bool* NewParam);
	void IncreaseValueAndWarp(bool CanWrap, bool PlayAnimation_0);
	void IncreaseSumValue(double Value, bool CanWrap, bool PlayAnimation_0);
	void ExecuteUbergraph_WDT_NumberMeter(int32 EntryPoint);
	void DecreaseValueAndWarp(bool CanWrap, bool PlayAnimation_0);
	void Decrease_Sum_Value(double NewParam, bool CanWrap, bool PlayAnimation_0);
	void Close_Meter_Piece(bool TradeSuccess);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_NumberMeter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_NumberMeter_C")
	}
	static class UWDT_NumberMeter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_NumberMeter_C>();
	}
};
DUMPER7_ASSERTS_UWDT_NumberMeter_C;

}

