#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Status_Fraction

#include "Basic.hpp"

#include "WDT_Status_PieceBase_classes.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_Status_Fraction.WDT_Status_Fraction_C
// 0x0058 (0x0720 - 0x06C8)
class UWDT_Status_Fraction_C final : public UWDT_Status_PieceBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WDT_Status_Fraction_C;              // 0x06C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWDT_ArticleDiffArrowElement_C*         Arrow_MaxValue;                                    // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrentValue;                                      // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       IndexTextBlock;                                    // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MaxValue;                                          // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MaxValue_Diff;                                     // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            IndexColor;                                        // 0x06F8(0x0014)(Edit, BlueprintVisible)
	uint8                                         Pad_70C[0x4];                                      // 0x070C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   IndexText;                                         // 0x0710(0x0010)(Edit, BlueprintVisible)

public:
	void Construct();
	void ExecuteUbergraph_WDT_Status_Fraction(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetValueFloat(double InIchor, double InMaxIchor);
	void SetValueFloatComparison(double InMaxIchorCurrent, double InMaxIchor);
	void SetValueInt(int32 InStamina, int32 InMaxStamina);
	void SetValueIntComparison(int32 InMaxStaminaCurrent, int32 InMaxStamina);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_Status_Fraction_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_Status_Fraction_C")
	}
	static class UWDT_Status_Fraction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_Status_Fraction_C>();
	}
};
DUMPER7_ASSERTS_UWDT_Status_Fraction_C;

}

