#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_MatchingSettingsText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_MatchingSettingsText.WDT_MatchingSettingsText_C
// 0x0120 (0x05E0 - 0x04C0)
class UWDT_MatchingSettingsText_C final : public UUIElementBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             CodeName;                                          // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CodeNameText;                                      // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Password;                                          // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       PasswordHelpText;                                  // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PosingName;                                        // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Region;                                            // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RegionType;                                        // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_Piece_TrgText_C*                   WDT_Piece_TrgText;                                 // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   EnablePasswordHelpText;                            // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DisablePasswordHelpText;                           // 0x0518(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   DisablePasswordText;                               // 0x0528(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EMatchingAreaType, class FText>          AreaTextMap;                                       // 0x0538(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<EMatchingRegion, class FText>            RegionTextMap;                                     // 0x0588(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMatchingUIObject*                      MatchingUIObject;                                  // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Update();
	void OnInputDeviceChanged();
	void OnInitialized();
	void ExecuteUbergraph_WDT_MatchingSettingsText(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_MatchingSettingsText_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_MatchingSettingsText_C")
	}
	static class UWDT_MatchingSettingsText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_MatchingSettingsText_C>();
	}
};
DUMPER7_ASSERTS_UWDT_MatchingSettingsText_C;

}

