#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_VerticalResourceBar

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WDT_VerticalResourceBar.WDT_VerticalResourceBar_C.ExecuteUbergraph_WDT_VerticalResourceBar
// 0x0050 (0x0050 - 0x0000)
struct WDT_VerticalResourceBar_C_ExecuteUbergraph_WDT_VerticalResourceBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UScrollerItem*                          K2Node_Event_InItem;                               // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_VerticalResourceBar_C_ExecuteUbergraph_WDT_VerticalResourceBar;

// Function WDT_VerticalResourceBar.WDT_VerticalResourceBar_C.GetFillBrush
// 0x00D0 (0x00D0 - 0x0000)
struct WDT_VerticalResourceBar_C_GetFillBrush final
{
public:
	struct FSlateBrush                            NewParam;                                          // 0x0000(0x00D0)(Parm, OutParm)
};
DUMPER7_ASSERTS_WDT_VerticalResourceBar_C_GetFillBrush;

// Function WDT_VerticalResourceBar.WDT_VerticalResourceBar_C.GetResourcese
// 0x0008 (0x0008 - 0x0000)
struct WDT_VerticalResourceBar_C_GetResourcese final
{
public:
	int32                                         CurrentResource_0;                                 // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxResource_0;                                     // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_VerticalResourceBar_C_GetResourcese;

// Function WDT_VerticalResourceBar.WDT_VerticalResourceBar_C.GetScrollerItem
// 0x0008 (0x0008 - 0x0000)
struct WDT_VerticalResourceBar_C_GetScrollerItem final
{
public:
	class UScrollerItem*                          OutItem;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_VerticalResourceBar_C_GetScrollerItem;

// Function WDT_VerticalResourceBar.WDT_VerticalResourceBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_VerticalResourceBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_VerticalResourceBar_C_PreConstruct;

// Function WDT_VerticalResourceBar.WDT_VerticalResourceBar_C.SetFillBrush
// 0x0360 (0x0360 - 0x0000)
struct WDT_VerticalResourceBar_C_SetFillBrush final
{
public:
	struct FSlateBrush                            NewParam;                                          // 0x0000(0x00D0)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FProgressBarStyle                      K2Node_MakeStruct_ProgressBarStyle;                // 0x00D0(0x0290)()
};
DUMPER7_ASSERTS_WDT_VerticalResourceBar_C_SetFillBrush;

// Function WDT_VerticalResourceBar.WDT_VerticalResourceBar_C.SetMaxResource
// 0x0004 (0x0004 - 0x0000)
struct WDT_VerticalResourceBar_C_SetMaxResource final
{
public:
	int32                                         MaxResource_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_VerticalResourceBar_C_SetMaxResource;

// Function WDT_VerticalResourceBar.WDT_VerticalResourceBar_C.SetResource
// 0x0004 (0x0004 - 0x0000)
struct WDT_VerticalResourceBar_C_SetResource final
{
public:
	int32                                         CurrentResource_0;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_VerticalResourceBar_C_SetResource;

// Function WDT_VerticalResourceBar.WDT_VerticalResourceBar_C.SetScrollerItem
// 0x0008 (0x0008 - 0x0000)
struct WDT_VerticalResourceBar_C_SetScrollerItem final
{
public:
	class UScrollerItem*                          InItem;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_VerticalResourceBar_C_SetScrollerItem;

// Function WDT_VerticalResourceBar.WDT_VerticalResourceBar_C.Tick
// 0x003C (0x003C - 0x0000)
struct WDT_VerticalResourceBar_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_VerticalResourceBar_C_Tick;

// Function WDT_VerticalResourceBar.WDT_VerticalResourceBar_C.Update Gauges
// 0x0028 (0x0028 - 0x0000)
struct WDT_VerticalResourceBar_C_Update_Gauges final
{
public:
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_VerticalResourceBar_C_Update_Gauges;

}

