#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_SupportMenuTabElement

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_SupportMenuTabElement.WDT_SupportMenuTabElement_C.SetTitleText
// 0x0010 (0x0010 - 0x0000)
struct WDT_SupportMenuTabElement_C_SetTitleText final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WDT_SupportMenuTabElement_C_SetTitleText;

// Function WDT_SupportMenuTabElement.WDT_SupportMenuTabElement_C.SetDiffIconVIsibility
// 0x0001 (0x0001 - 0x0000)
struct WDT_SupportMenuTabElement_C_SetDiffIconVIsibility final
{
public:
	bool                                          InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuTabElement_C_SetDiffIconVIsibility;

// Function WDT_SupportMenuTabElement.WDT_SupportMenuTabElement_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WDT_SupportMenuTabElement_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuTabElement_C_OnListItemObjectSet;

// Function WDT_SupportMenuTabElement.WDT_SupportMenuTabElement_C.ExecuteUbergraph_WDT_SupportMenuTabElement
// 0x0048 (0x0048 - 0x0000)
struct WDT_SupportMenuTabElement_C_ExecuteUbergraph_WDT_SupportMenuTabElement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SupportMenuTabItemData_C*           K2Node_DynamicCast_AsBP_Support_Menu_Tab_Item_Data; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetTitleText_OutText;                     // 0x0020(0x0010)()
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool InFlag)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuTabElement_C_ExecuteUbergraph_WDT_SupportMenuTabElement;

// Function WDT_SupportMenuTabElement.WDT_SupportMenuTabElement_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_SupportMenuTabElement_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuTabElement_C_BP_OnItemSelectionChanged;

// Function WDT_SupportMenuTabElement.WDT_SupportMenuTabElement_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_SupportMenuTabElement_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_SupportMenuTabElement_C_BP_OnItemExpansionChanged;

}

