#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigTypeSelectPiece

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WDT_ConfigTypeSelectPiece.WDT_ConfigTypeSelectPiece_C.UpdateTypeText
// 0x0070 (0x0070 - 0x0000)
struct WDT_ConfigTypeSelectPiece_C_UpdateTypeText final
{
public:
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0048)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0060(0x0010)()
};
DUMPER7_ASSERTS_WDT_ConfigTypeSelectPiece_C_UpdateTypeText;

// Function WDT_ConfigTypeSelectPiece.WDT_ConfigTypeSelectPiece_C.TextNext
// 0x001C (0x001C - 0x0000)
struct WDT_ConfigTypeSelectPiece_C_TextNext final
{
public:
	bool                                          bInCanWarp;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigTypeSelectPiece_C_TextNext;

// Function WDT_ConfigTypeSelectPiece.WDT_ConfigTypeSelectPiece_C.TextBack
// 0x001C (0x001C - 0x0000)
struct WDT_ConfigTypeSelectPiece_C_TextBack final
{
public:
	bool                                          bInCanWarp;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsNotEmpty_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigTypeSelectPiece_C_TextBack;

// Function WDT_ConfigTypeSelectPiece.WDT_ConfigTypeSelectPiece_C.SetTextList
// 0x0010 (0x0010 - 0x0000)
struct WDT_ConfigTypeSelectPiece_C_SetTextList final
{
public:
	TArray<class FText>                           TextList;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WDT_ConfigTypeSelectPiece_C_SetTextList;

// Function WDT_ConfigTypeSelectPiece.WDT_ConfigTypeSelectPiece_C.SetIsForcedLoop
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigTypeSelectPiece_C_SetIsForcedLoop final
{
public:
	bool                                          Flag;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigTypeSelectPiece_C_SetIsForcedLoop;

// Function WDT_ConfigTypeSelectPiece.WDT_ConfigTypeSelectPiece_C.SetIndexText
// 0x0004 (0x0004 - 0x0000)
struct WDT_ConfigTypeSelectPiece_C_SetIndexText final
{
public:
	int32                                         TextIndex;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigTypeSelectPiece_C_SetIndexText;

// Function WDT_ConfigTypeSelectPiece.WDT_ConfigTypeSelectPiece_C.Select
// 0x0002 (0x0002 - 0x0000)
struct WDT_ConfigTypeSelectPiece_C_Select final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigTypeSelectPiece_C_Select;

// Function WDT_ConfigTypeSelectPiece.WDT_ConfigTypeSelectPiece_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WDT_ConfigTypeSelectPiece_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigTypeSelectPiece_C_PreConstruct;

// Function WDT_ConfigTypeSelectPiece.WDT_ConfigTypeSelectPiece_C.GetSelectIndex
// 0x0004 (0x0004 - 0x0000)
struct WDT_ConfigTypeSelectPiece_C_GetSelectIndex final
{
public:
	int32                                         OutIndex;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigTypeSelectPiece_C_GetSelectIndex;

// Function WDT_ConfigTypeSelectPiece.WDT_ConfigTypeSelectPiece_C.ExecuteUbergraph_WDT_ConfigTypeSelectPiece
// 0x0008 (0x0008 - 0x0000)
struct WDT_ConfigTypeSelectPiece_C_ExecuteUbergraph_WDT_ConfigTypeSelectPiece final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigTypeSelectPiece_C_ExecuteUbergraph_WDT_ConfigTypeSelectPiece;

// Function WDT_ConfigTypeSelectPiece.WDT_ConfigTypeSelectPiece_C.Deselect
// 0x0002 (0x0002 - 0x0000)
struct WDT_ConfigTypeSelectPiece_C_Deselect final
{
public:
	bool                                          PlayAnimation_0;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ConfigTypeSelectPiece_C_Deselect;

}

