#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Article_NumberAndDiff

#include "Basic.hpp"

#include "WDT_Status_PieceBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_Article_NumberAndDiff.WDT_Article_NumberAndDiff_C
// 0x0050 (0x0718 - 0x06C8)
class UWDT_Article_NumberAndDiff_C final : public UWDT_Status_PieceBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WDT_Article_NumberAndDiff_C;        // 0x06C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         Box;                                               // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Index_Text;                                        // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value;                                             // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ValueDiff_Down;                                    // 0x06E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ValueDiff_Up;                                      // 0x06F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ValueDiffNum;                                      // 0x06F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ValueDiffRoot;                                     // 0x0700(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   IndexText;                                         // 0x0708(0x0010)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WDT_Article_NumberAndDiff(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetValue(int32 InValue);
	void SetValueComparison(int32 InCurrentValue, int32 InTargetValue, bool SwapComparisons);
	void SetValueFloat(double InValue);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_Article_NumberAndDiff_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_Article_NumberAndDiff_C")
	}
	static class UWDT_Article_NumberAndDiff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_Article_NumberAndDiff_C>();
	}
};
DUMPER7_ASSERTS_UWDT_Article_NumberAndDiff_C;

}

