#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_StatusDownEffectIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Extensions_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_StatusDownEffectIcon.WDT_StatusDownEffectIcon_C
// 0x0030 (0x0630 - 0x0600)
class UWDT_StatusDownEffectIcon_C final : public UHudPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_EffectType;                                  // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StatusEffectImage;                                 // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FStatusEffectIconHandle                IconHandle;                                        // 0x0618(0x0008)(Edit, BlueprintVisible, NoDestructor)
	EStatusDownEffectIconType                     IconType;                                          // 0x0620(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DMI_StatusEffectIcon;                              // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	bool ClearSubTexture(class FName ImageId);
	bool ClearTexture();
	void Construct();
	void ExecuteUbergraph_WDT_StatusDownEffectIcon(int32 EntryPoint);
	bool FlipTexture(bool IsInverse);
	void MakeDMI();
	void PreConstruct(bool IsDesignTime);
	bool SetLazyTexture(const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	void SetStatusEffectIconInfo(const struct FStatusEffectIconHandle& InHandle, EStatusDownEffectIconType InType, class UTexture2D* InTexture, class UTexture2D* InFrame);
	void SetStatusTimeElapsed(double InTimeElapsed, double InTimeTotal);
	bool SetSubLazyTexture(class FName ImageId, const TSoftObjectPtr<class UTexture2D>& LazyTexture);
	bool SetSubTexture(class FName ImageId, class UTexture2D* Texture);
	bool SetTexture(class UTexture2D* Texture);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_StatusDownEffectIcon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_StatusDownEffectIcon_C")
	}
	static class UWDT_StatusDownEffectIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_StatusDownEffectIcon_C>();
	}
};
DUMPER7_ASSERTS_UWDT_StatusDownEffectIcon_C;

}

