#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_DescriptionTitle

#include "Basic.hpp"


namespace SDK::Params
{

// Function WDT_DescriptionTitle.WDT_DescriptionTitle_C.SetTexts
// 0x0018 (0x0018 - 0x0000)
struct WDT_DescriptionTitle_C_SetTexts final
{
public:
	TArray<class FText>                           LocalTexts;                                        // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_DescriptionTitle_C_SetTexts;

// Function WDT_DescriptionTitle.WDT_DescriptionTitle_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WDT_DescriptionTitle_C_SetText final
{
public:
	class FText                                   LocalText;                                         // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_DescriptionTitle_C_SetText;

// Function WDT_DescriptionTitle.WDT_DescriptionTitle_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct WDT_DescriptionTitle_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_DescriptionTitle_C_OnListItemObjectSet;

// Function WDT_DescriptionTitle.WDT_DescriptionTitle_C.GetTexts
// 0x0010 (0x0010 - 0x0000)
struct WDT_DescriptionTitle_C_GetTexts final
{
public:
	TArray<class FText>                           LocalTexts;                                        // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_WDT_DescriptionTitle_C_GetTexts;

// Function WDT_DescriptionTitle.WDT_DescriptionTitle_C.GetText
// 0x0010 (0x0010 - 0x0000)
struct WDT_DescriptionTitle_C_GetText final
{
public:
	class FText                                   LocalText;                                         // 0x0000(0x0010)(Parm, OutParm)
};
DUMPER7_ASSERTS_WDT_DescriptionTitle_C_GetText;

// Function WDT_DescriptionTitle.WDT_DescriptionTitle_C.ExecuteUbergraph_WDT_DescriptionTitle
// 0x0018 (0x0018 - 0x0000)
struct WDT_DescriptionTitle_C_ExecuteUbergraph_WDT_DescriptionTitle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_DescriptionTitle_C_ExecuteUbergraph_WDT_DescriptionTitle;

// Function WDT_DescriptionTitle.WDT_DescriptionTitle_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_DescriptionTitle_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_DescriptionTitle_C_BP_OnItemSelectionChanged;

// Function WDT_DescriptionTitle.WDT_DescriptionTitle_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct WDT_DescriptionTitle_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_DescriptionTitle_C_BP_OnItemExpansionChanged;

}

