#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_SupportMenuTabElement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_SupportMenuTabElement.WDT_SupportMenuTabElement_C
// 0x0040 (0x0500 - 0x04C0)
class UWDT_SupportMenuTabElement_C final : public UUIElementBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 DiffIcon;                                          // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DiffIconBG;                                        // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DiffIconOverlay;                                   // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                KeywordSelectionFilter;                            // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TabTitle;                                          // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x04F0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void SetTitleText(const class FText& Text_0);
	void SetDiffIconVIsibility(bool InVisibility);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void ExecuteUbergraph_WDT_SupportMenuTabElement(int32 EntryPoint);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_SupportMenuTabElement_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_SupportMenuTabElement_C")
	}
	static class UWDT_SupportMenuTabElement_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_SupportMenuTabElement_C>();
	}
};
DUMPER7_ASSERTS_UWDT_SupportMenuTabElement_C;

}

