#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigStandardPageBase

#include "Basic.hpp"

#include "STR_ConfigPieceBaseList_structs.hpp"
#include "Extensions_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ConfigStandardPageBase.WDT_ConfigStandardPageBase_C
// 0x0020 (0x05D8 - 0x05B8)
class UWDT_ConfigStandardPageBase_C : public UAppMenuBase
{
public:
	bool                                          IsTextInputMode;                                   // 0x05B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSTR_ConfigPieceBaseList>       ConfigPieceList;                                   // 0x05C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          bIsPressSwitchStarted;                             // 0x05D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressHorizonStarted;                            // 0x05D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsPressVerticalStarted;                           // 0x05D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetupConfigPieceList();
	void InitializeConfigPieceValue(int32 InInitializeTab);
	void SetStartTab(int32 Index_0, class UWDT_ConfigTabBase_C* ConfigTab, class UWidgetSwitcher* WidgetSwitcher, class UWDT_ConfigLog_C* ConfigLog);
	void UpdateSwitchChildPiece(int32 TabIndex, class UWidgetSwitcher* WidgetSwitcher, class UWDT_ConfigLog_C* ConfigLog);
	void UpdateMenuPieceEditable(class UWDT_ConfigPieceBase_C* ConfigPieceBase);
	void OnPageMouseEnterMenuPiece(class UMenuPieceBase* MenuPice, class UWDT_ConfigLog_C* ConfigLog);
	void OnPageMenuInitialized(class UWDT_ConfigHeader_C* ConfigHeader);
	void OnPageOpened(class UWDT_ConfigPieceBase_C* StartPiece, class UWDT_ConfigLog_C* ConfigLog);
	void OnPageClosed();
	void OnPageSwitchToIndex(int32 Index_0, class UWidgetSwitcher* WidgetSwitcher, class UWDT_ConfigLog_C* ConfigLog);
	void OnPageSwitchRight(class UWDT_ConfigTabBase_C* ConfigTab, class UWidgetSwitcher* WidgetSwitcher, class UWDT_ConfigLog_C* ConfigLog, bool bInIsPressStarted, bool* OutIsChangeTab);
	void OnPageSwitchLeft(class UWDT_ConfigTabBase_C* ConfigTab, class UWidgetSwitcher* WidgetSwitcher, class UWDT_ConfigLog_C* ConfigLog, bool bInPressStarted, bool* OutIsChangeTab);
	void Set_Page_Config_Log_Text(class UWDT_ConfigLog_C* ConfigLog, class UWDT_ConfigPieceBase_C* ConfigPiece);
	void OnPageDirectionLeft(class UWDT_ConfigLog_C* ConfigLog, bool bInIsPressStarted);
	void OnPageDirectionRight(class UWDT_ConfigLog_C* ConfigLog, bool bInIsPressStarted);
	void OnPageCancelReleased();
	void OnPageDecideReleased();
	void OnPageDownPressed(class UWDT_ConfigLog_C* ConfigLog, bool bInIsPressStarted);
	void OnPageUpPressed(class UWDT_ConfigLog_C* ConfigLog, bool bInIsPressStarted);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ConfigStandardPageBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ConfigStandardPageBase_C")
	}
	static class UWDT_ConfigStandardPageBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ConfigStandardPageBase_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ConfigStandardPageBase_C;

}

