#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ConfigTypeSelectPiece

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BasicUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_ConfigTypeSelectPiece.WDT_ConfigTypeSelectPiece_C
// 0x0038 (0x0600 - 0x05C8)
class UWDT_ConfigTypeSelectPiece_C final : public UMenuPieceBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 SelectImage;                                       // 0x05D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TypeText_1;                                        // 0x05D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TypeText_Shadow;                                   // 0x05E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           TypeTextList;                                      // 0x05E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         TextListIndex;                                     // 0x05F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsForcedLoop;                                     // 0x05FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UpdateTypeText();
	void TextNext(bool bInCanWarp);
	void TextBack(bool bInCanWarp);
	void SetTextList(TArray<class FText>& TextList);
	void SetIsForcedLoop(bool Flag);
	void SetIndexText(int32 TextIndex);
	bool Select(bool PlayAnimation_0);
	void PreConstruct(bool IsDesignTime);
	void GetSelectIndex(int32* OutIndex);
	void ExecuteUbergraph_WDT_ConfigTypeSelectPiece(int32 EntryPoint);
	bool Deselect(bool PlayAnimation_0);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_ConfigTypeSelectPiece_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_ConfigTypeSelectPiece_C")
	}
	static class UWDT_ConfigTypeSelectPiece_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_ConfigTypeSelectPiece_C>();
	}
};
DUMPER7_ASSERTS_UWDT_ConfigTypeSelectPiece_C;

}

