#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_Status_NumberAndDiff

#include "Basic.hpp"

#include "WDT_Status_PieceBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_Status_NumberAndDiff.WDT_Status_NumberAndDiff_C
// 0x0028 (0x06F0 - 0x06C8)
class UWDT_Status_NumberAndDiff_C final : public UWDT_Status_PieceBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WDT_Status_NumberAndDiff_C;         // 0x06C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             DiffNum;                                           // 0x06D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Number;                                            // 0x06D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWDT_ArticleDiffArrowElement_C*         WDT_ArticleDiffArrowElement_C_1;                   // 0x06E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PreviewNumber1;                                    // 0x06E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviewNumber2;                                    // 0x06EC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WDT_Status_NumberAndDiff(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetNumber(int32 InNumber);
	void SetNumberDiff(int32 InCurrentNumber, int32 InNumber, bool SwapComparison);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_Status_NumberAndDiff_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_Status_NumberAndDiff_C")
	}
	static class UWDT_Status_NumberAndDiff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_Status_NumberAndDiff_C>();
	}
};
DUMPER7_ASSERTS_UWDT_Status_NumberAndDiff_C;

}

