#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_MapFeatureSymbol_FadedEnishi

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WDT_MapFeatureSymbol_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WDT_MapFeatureSymbol_FadedEnishi.WDT_MapFeatureSymbol_FadedEnishi_C
// 0x0038 (0x0630 - 0x05F8)
class UWDT_MapFeatureSymbol_FadedEnishi_C final : public UWDT_MapFeatureSymbol_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WDT_MapFeatureSymbol_FadedEnishi_C; // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 FeatureSymbolImage;                                // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              FeatureSymbolScaleBox;                             // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               FeatureSymbolSizeBox;                              // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProhibitedImage;                                   // 0x0618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               QuestIconOverlay;                                  // 0x0620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             QuestPin;                                          // 0x0628(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	bool SetTexture(class UTexture2D* Texture);
	void SetQuestIconVisibility(bool InIsVisible);
	void SetProhibited(bool InProhibited);
	void SetGrayOut(bool InIsGrayOut);
	void IsProhibited(bool* OutProhibited);
	void GetWidth(double* OutWidth);
	void GetHeight(double* OutHeight);
	void ExecuteUbergraph_WDT_MapFeatureSymbol_FadedEnishi(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WDT_MapFeatureSymbol_FadedEnishi_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WDT_MapFeatureSymbol_FadedEnishi_C")
	}
	static class UWDT_MapFeatureSymbol_FadedEnishi_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWDT_MapFeatureSymbol_FadedEnishi_C>();
	}
};
DUMPER7_ASSERTS_UWDT_MapFeatureSymbol_FadedEnishi_C;

}

