#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WDT_ResilienceUpInfo

#include "Basic.hpp"

#include "Extensions_structs.hpp"


namespace SDK::Params
{

// Function WDT_ResilienceUpInfo.WDT_ResilienceUpInfo_C.SetResilienceUpInfo
// 0x00F0 (0x00F0 - 0x0000)
struct WDT_ResilienceUpInfo_C_SetResilienceUpInfo final
{
public:
	struct FUIResilienceUpInfo                    NewParam;                                          // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	EUIResilienceUpType                           NewParam1;                                         // 0x0050(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRawMaterialUIInfo                     K2Node_MakeStruct_RawMaterialUIInfo;               // 0x0058(0x0048)()
	TArray<struct FRawMaterialUIInfo>             K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00B8(0x0010)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x00D0(0x0010)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x00E0(0x0010)()
};
DUMPER7_ASSERTS_WDT_ResilienceUpInfo_C_SetResilienceUpInfo;

// Function WDT_ResilienceUpInfo.WDT_ResilienceUpInfo_C.SetSelect
// 0x0001 (0x0001 - 0x0000)
struct WDT_ResilienceUpInfo_C_SetSelect final
{
public:
	bool                                          IsSelect;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WDT_ResilienceUpInfo_C_SetSelect;

}

